bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define D2_AXISRAM_BASE           ((uint32_t)0x10000000) /*!< Base address of : (up to 288KB) system data RAM accessible over over AXI                */
#define D2_AHBSRAM_BASE           ((uint32_t)0x30000000) /*!< Base address of : (up to 288KB) system data RAM accessible over over AXI->AHB Bridge    */

#define D3_BKPSRAM_BASE           ((uint32_t)0x38800000) /*!< Base address of : Backup SRAM(4 KB) over AXI->AHB Bridge                                */                                                  
#define D3_SRAM_BASE              ((uint32_t)0x38000000) /*!< Base address of : Backup SRAM(64 KB) over AXI->AHB Bridge                               */ 

#define PERIPH_BASE               ((uint32_t)0x40000000) /*!< Base address of : AHB/ABP Peripherals                                                   */
#define QSPI_BASE                 ((uint32_t)0x90000000) /*!< Base address of : QSPI memories accessible over AXI                                     */

#define FLASH_BANK1_BASE          ((uint32_t)0x08000000) /*!< Base address of : (up to 1 MB) Flash Bank1 accessible over AXI                          */ 
#define FLASH_BANK2_BASE          ((uint32_t)0x08100000) /*!< Base address of : (up to 1 MB) Flash Bank2 accessible over AXI                          */ 
#define FLASH_END                 ((uint32_t)0x081FFFFF) /*!< FLASH end address                                                                       */

#define FLASH_OTP_BANK1_BASE      ((uint32_t)0x1FF00000) /*!< Base address of : (up to 128KB) embedded FLASH Bank1 OTP Area                           */ 
#define FLASH_OTP_BANK1_END       ((uint32_t)0x1FF1FFFF) /*!< End address of : (up to 128KB) embedded FLASH Bank1 OTP Area                            */ 
#define FLASH_OTP_BANK2_BASE      ((uint32_t)0x1FF40000) /*!< Base address of : (up to 128KB) embedded FLASH Bank2 OTP Area                           */ 
#define FLASH_OTP_BANK2_END       ((uint32_t)0x1FF5FFFF) /*!< End address of : (up to 128KB) embedded FLASH Bank2 OTP Area                            */ 

/* Legacy define */
#define FLASH_BASE                FLASH_BANK1_BASE

/*!< Device electronic signature memory map */
#define UID_BASE                  (0x1FF1E800UL)          /*!< Unique device ID register base address */


/*!< Peripheral memory map */
#define D2_APB1PERIPH_BASE        PERIPH_BASE
#define D2_APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000)
#define D2_AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000)
#define D2_AHB2PERIPH_BASE       (PERIPH_BASE + 0x08020000)

#define D1_APB1PERIPH_BASE       (PERIPH_BASE + 0x10000000)
#define D1_AHB1PERIPH_BASE       (PERIPH_BASE + 0x12000000)

#define D3_APB1PERIPH_BASE       (PERIPH_BASE + 0x18000000)
#define D3_AHB1PERIPH_BASE       (PERIPH_BASE + 0x18020000)

/*!< Legacy Peripheral memory map */
#define APB1PERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000)

/*!< D1_AHB1PERIPH peripherals */

#define MDMA_BASE             (D1_AHB1PERIPH_BASE + 0x0000)
#define DMA2D_BASE            (D1_AHB1PERIPH_BASE + 0x1000)
#define JPGDEC_BASE           (D1_AHB1PERIPH_BASE + 0x3000)
#define FLASH_R_BASE          (D1_AHB1PERIPH_BASE + 0x2000)
#define FMC_R_BASE            (D1_AHB1PERIPH_BASE + 0x4000)
#define QSPI_R_BASE           (D1_AHB1PERIPH_BASE + 0x5000)
#define DLYB_QSPI_BASE        (D1_AHB1PERIPH_BASE + 0x6000)
#define SDMMC1_BASE           (D1_AHB1PERIPH_BASE + 0x7000)
#define DLYB_SDMMC1_BASE      (D1_AHB1PERIPH_BASE + 0x8000)

/*!< D2_AHB1PERIPH peripherals */

#define DMA1_BASE               (D2_AHB1PERIPH_BASE + 0x0000)
#define DMA2_BASE               (D2_AHB1PERIPH_BASE + 0x0400)
#define DMAMUX1_BASE            (D2_AHB1PERIPH_BASE + 0x0800)
#define ADC1_BASE               (D2_AHB1PERIPH_BASE + 0x2000)
#define ADC2_BASE               (D2_AHB1PERIPH_BASE + 0x2100)
#define ADC12_COMMON_BASE       (D2_AHB1PERIPH_BASE + 0x2300)
#define ART_BASE                (D2_AHB1PERIPH_BASE + 0x4400)
#define ETH_BASE                (D2_AHB1PERIPH_BASE + 0x8000)
#define ETH_MAC_BASE            (ETH_BASE)

/*!< USB registers base address */
#define USB1_OTG_HS_PERIPH_BASE              ((uint32_t )0x40040000)
#define USB2_OTG_FS_PERIPH_BASE              ((uint32_t )0x40080000)
#define USB_OTG_GLOBAL_BASE                  ((uint32_t )0x000)
#define USB_OTG_DEVICE_BASE                  ((uint32_t )0x800)
#define USB_OTG_IN_ENDPOINT_BASE             ((uint32_t )0x900)
#define USB_OTG_OUT_ENDPOINT_BASE            ((uint32_t )0xB00)
#define USB_OTG_EP_REG_SIZE                  ((uint32_t )0x20)
#define USB_OTG_HOST_BASE                    ((uint32_t )0x400)
#define USB_OTG_HOST_PORT_BASE               ((uint32_t )0x440)
#define USB_OTG_HOST_CHANNEL_BASE            ((uint32_t )0x500)
#define USB_OTG_HOST_CHANNEL_SIZE            ((uint32_t )0x20)
#define USB_OTG_PCGCCTL_BASE                 ((uint32_t )0xE00)
#define USB_OTG_FIFO_BASE                    ((uint32_t )0x1000)
#define USB_OTG_FIFO_SIZE                    ((uint32_t )0x1000)

/*!< D2_AHB2PERIPH peripherals */

#define DCMI_BASE              (D2_AHB2PERIPH_BASE + 0x0000)
#define CRYP_BASE              (D2_AHB2PERIPH_BASE + 0x1000)
#define HASH_BASE              (D2_AHB2PERIPH_BASE + 0x1400)
#define HASH_DIGEST_BASE       (D2_AHB2PERIPH_BASE + 0x1710)
#define RNG_BASE               (D2_AHB2PERIPH_BASE + 0x1800)
#define SDMMC2_BASE            (D2_AHB2PERIPH_BASE + 0x2400)
#define DLYB_SDMMC2_BASE       (D2_AHB2PERIPH_BASE + 0x2800)


/*!< D3_AHB1PERIPH peripherals */
#define GPIOA_BASE            (D3_AHB1PERIPH_BASE + 0x0000)
#define GPIOB_BASE            (D3_AHB1PERIPH_BASE + 0x0400)
#define GPIOC_BASE            (D3_AHB1PERIPH_BASE + 0x0800)
#define GPIOD_BASE            (D3_AHB1PERIPH_BASE + 0x0C00)
#define GPIOE_BASE            (D3_AHB1PERIPH_BASE + 0x1000)
#define GPIOF_BASE            (D3_AHB1PERIPH_BASE + 0x1400)
#define GPIOG_BASE            (D3_AHB1PERIPH_BASE + 0x1800)
#define GPIOH_BASE            (D3_AHB1PERIPH_BASE + 0x1C00)
#define GPIOI_BASE            (D3_AHB1PERIPH_BASE + 0x2000)
#define GPIOJ_BASE            (D3_AHB1PERIPH_BASE + 0x2400)
#define GPIOK_BASE            (D3_AHB1PERIPH_BASE + 0x2800)
#define RCC_BASE              (D3_AHB1PERIPH_BASE + 0x4400)
#define RCC_C1_BASE           (RCC_BASE + 0x130)
#define PWR_BASE              (D3_AHB1PERIPH_BASE + 0x4800)
#define CRC_BASE              (D3_AHB1PERIPH_BASE + 0x4C00)
#define BDMA_BASE             (D3_AHB1PERIPH_BASE + 0x5400)
#define DMAMUX2_BASE          (D3_AHB1PERIPH_BASE + 0x5800)
#define ADC3_BASE             (D3_AHB1PERIPH_BASE + 0x6000)
#define ADC3_COMMON_BASE      (D3_AHB1PERIPH_BASE + 0x6300)
#define HSEM_BASE             (D3_AHB1PERIPH_BASE + 0x6400)

/*!< D1_APB1PERIPH peripherals */
#define LTDC_BASE             (D1_APB1PERIPH_BASE + 0x1000)
#define LTDC_Layer1_BASE      (LTDC_BASE + 0x84)
#define LTDC_Layer2_BASE      (LTDC_BASE + 0x104)
#define WWDG1_BASE            (D1_APB1PERIPH_BASE + 0x3000)

