bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/*!< D2_APB1PERIPH peripherals */
#define TIM2_BASE             (D2_APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (D2_APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE             (D2_APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE             (D2_APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE             (D2_APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE             (D2_APB1PERIPH_BASE + 0x1400)
#define TIM12_BASE            (D2_APB1PERIPH_BASE + 0x1800)
#define TIM13_BASE            (D2_APB1PERIPH_BASE + 0x1C00)
#define TIM14_BASE            (D2_APB1PERIPH_BASE + 0x2000)
#define LPTIM1_BASE           (D2_APB1PERIPH_BASE + 0x2400)


#define SPI2_BASE             (D2_APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE             (D2_APB1PERIPH_BASE + 0x3C00)
#define SPDIFRX_BASE          (D2_APB1PERIPH_BASE + 0x4000)
#define USART2_BASE           (D2_APB1PERIPH_BASE + 0x4400)
#define USART3_BASE           (D2_APB1PERIPH_BASE + 0x4800)
#define UART4_BASE            (D2_APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE            (D2_APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE             (D2_APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE             (D2_APB1PERIPH_BASE + 0x5800)
#define I2C3_BASE             (D2_APB1PERIPH_BASE + 0x5C00)
#define CEC_BASE              (D2_APB1PERIPH_BASE + 0x6C00)
#define DAC1_BASE             (D2_APB1PERIPH_BASE + 0x7400)
#define UART7_BASE            (D2_APB1PERIPH_BASE + 0x7800)
#define UART8_BASE            (D2_APB1PERIPH_BASE + 0x7C00)
#define CRS_BASE              (D2_APB1PERIPH_BASE + 0x8400)
#define SWPMI1_BASE           (D2_APB1PERIPH_BASE + 0x8800)
#define OPAMP_BASE            (D2_APB1PERIPH_BASE + 0x9000)
#define OPAMP1_BASE           (D2_APB1PERIPH_BASE + 0x9000)
#define OPAMP2_BASE           (D2_APB1PERIPH_BASE + 0x9010)
#define MDIOS_BASE            (D2_APB1PERIPH_BASE + 0x9400)
#define FDCAN1_BASE           (D2_APB1PERIPH_BASE + 0xA000)
#define FDCAN2_BASE           (D2_APB1PERIPH_BASE + 0xA400)
#define FDCAN_CCU_BASE        (D2_APB1PERIPH_BASE + 0xA800)
#define SRAMCAN_BASE          (D2_APB1PERIPH_BASE + 0xAC00)

/*!< D2_APB2PERIPH peripherals */

#define TIM1_BASE             (D2_APB2PERIPH_BASE + 0x0000)
#define TIM8_BASE             (D2_APB2PERIPH_BASE + 0x0400)
#define USART1_BASE           (D2_APB2PERIPH_BASE + 0x1000)
#define USART6_BASE           (D2_APB2PERIPH_BASE + 0x1400)
#define SPI1_BASE             (D2_APB2PERIPH_BASE + 0x3000)
#define SPI4_BASE             (D2_APB2PERIPH_BASE + 0x3400)
#define TIM15_BASE            (D2_APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE            (D2_APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE            (D2_APB2PERIPH_BASE + 0x4800)
#define SPI5_BASE             (D2_APB2PERIPH_BASE + 0x5000)
#define SAI1_BASE             (D2_APB2PERIPH_BASE + 0x5800)
#define SAI1_Block_A_BASE     (SAI1_BASE + 0x004)
#define SAI1_Block_B_BASE     (SAI1_BASE + 0x024)
#define SAI2_BASE             (D2_APB2PERIPH_BASE + 0x5C00)
#define SAI2_Block_A_BASE     (SAI2_BASE + 0x004)
#define SAI2_Block_B_BASE     (SAI2_BASE + 0x024)
#define SAI3_BASE             (D2_APB2PERIPH_BASE + 0x6000)
#define SAI3_Block_A_BASE     (SAI3_BASE + 0x004)
#define SAI3_Block_B_BASE     (SAI3_BASE + 0x024)
#define DFSDM1_BASE           (D2_APB2PERIPH_BASE + 0x7000)
#define DFSDM1_Channel0_BASE  (DFSDM1_BASE + 0x00)
#define DFSDM1_Channel1_BASE  (DFSDM1_BASE + 0x20)
#define DFSDM1_Channel2_BASE  (DFSDM1_BASE + 0x40)
#define DFSDM1_Channel3_BASE  (DFSDM1_BASE + 0x60)
#define DFSDM1_Channel4_BASE  (DFSDM1_BASE + 0x80)
#define DFSDM1_Channel5_BASE  (DFSDM1_BASE + 0xA0)
#define DFSDM1_Channel6_BASE  (DFSDM1_BASE + 0xC0)
#define DFSDM1_Channel7_BASE  (DFSDM1_BASE + 0xE0)
#define DFSDM1_Filter0_BASE   (DFSDM1_BASE + 0x100)
#define DFSDM1_Filter1_BASE   (DFSDM1_BASE + 0x180)
#define DFSDM1_Filter2_BASE   (DFSDM1_BASE + 0x200)
#define DFSDM1_Filter3_BASE   (DFSDM1_BASE + 0x280)
#define HRTIM1_BASE           (D2_APB2PERIPH_BASE + 0x7400)
#define HRTIM1_TIMA_BASE      (HRTIM1_BASE + 0x00000080)
#define HRTIM1_TIMB_BASE      (HRTIM1_BASE + 0x00000100)
#define HRTIM1_TIMC_BASE      (HRTIM1_BASE + 0x00000180)
#define HRTIM1_TIMD_BASE      (HRTIM1_BASE + 0x00000200)
#define HRTIM1_TIME_BASE      (HRTIM1_BASE + 0x00000280)
#define HRTIM1_COMMON_BASE    (HRTIM1_BASE + 0x00000380)


/*!< D3_APB1PERIPH peripherals */
#define EXTI_BASE             (D3_APB1PERIPH_BASE + 0x0000)
#define EXTI_D1_BASE          (EXTI_BASE + 0x0080)
#define EXTI_D2_BASE          (EXTI_BASE + 0x00C0)
#define SYSCFG_BASE           (D3_APB1PERIPH_BASE + 0x0400)
#define LPUART1_BASE          (D3_APB1PERIPH_BASE + 0x0C00)
#define SPI6_BASE             (D3_APB1PERIPH_BASE + 0x1400)
#define I2C4_BASE             (D3_APB1PERIPH_BASE + 0x1C00)
#define LPTIM2_BASE           (D3_APB1PERIPH_BASE + 0x2400)
#define LPTIM3_BASE           (D3_APB1PERIPH_BASE + 0x2800)
#define LPTIM4_BASE           (D3_APB1PERIPH_BASE + 0x2C00)
#define LPTIM5_BASE           (D3_APB1PERIPH_BASE + 0x3000)
#define COMP12_BASE           (D3_APB1PERIPH_BASE + 0x3800)
#define COMP1_BASE            (COMP12_BASE + 0x0C)
#define COMP2_BASE            (COMP12_BASE + 0x10)
#define VREFBUF_BASE          (D3_APB1PERIPH_BASE + 0x3C00)
#define RTC_BASE              (D3_APB1PERIPH_BASE + 0x4000)
#define IWDG1_BASE            (D3_APB1PERIPH_BASE + 0x4800)


#define SAI4_BASE             (D3_APB1PERIPH_BASE + 0x5400)
#define SAI4_Block_A_BASE     (SAI4_BASE + 0x004)
#define SAI4_Block_B_BASE     (SAI4_BASE + 0x024)


#define BDMA_Channel0_BASE    (BDMA_BASE + 0x0008)
#define BDMA_Channel1_BASE    (BDMA_BASE + 0x001C)
#define BDMA_Channel2_BASE    (BDMA_BASE + 0x0030)
#define BDMA_Channel3_BASE    (BDMA_BASE + 0x0044)
#define BDMA_Channel4_BASE    (BDMA_BASE + 0x0058)
#define BDMA_Channel5_BASE    (BDMA_BASE + 0x006C)
#define BDMA_Channel6_BASE    (BDMA_BASE + 0x0080)
#define BDMA_Channel7_BASE    (BDMA_BASE + 0x0094)

#define DMAMUX2_Channel0_BASE    (DMAMUX2_BASE)
#define DMAMUX2_Channel1_BASE    (DMAMUX2_BASE + 0x0004)
#define DMAMUX2_Channel2_BASE    (DMAMUX2_BASE + 0x0008)
#define DMAMUX2_Channel3_BASE    (DMAMUX2_BASE + 0x000C)
#define DMAMUX2_Channel4_BASE    (DMAMUX2_BASE + 0x0010)
#define DMAMUX2_Channel5_BASE    (DMAMUX2_BASE + 0x0014)
#define DMAMUX2_Channel6_BASE    (DMAMUX2_BASE + 0x0018)
#define DMAMUX2_Channel7_BASE    (DMAMUX2_BASE + 0x001C)

#define DMAMUX2_RequestGenerator0_BASE  (DMAMUX2_BASE + 0x0100)
#define DMAMUX2_RequestGenerator1_BASE  (DMAMUX2_BASE + 0x0104)
#define DMAMUX2_RequestGenerator2_BASE  (DMAMUX2_BASE + 0x0108)
#define DMAMUX2_RequestGenerator3_BASE  (DMAMUX2_BASE + 0x010C)
#define DMAMUX2_RequestGenerator4_BASE  (DMAMUX2_BASE + 0x0110)
#define DMAMUX2_RequestGenerator5_BASE  (DMAMUX2_BASE + 0x0114)
#define DMAMUX2_RequestGenerator6_BASE  (DMAMUX2_BASE + 0x0118)
#define DMAMUX2_RequestGenerator7_BASE  (DMAMUX2_BASE + 0x011C)

#define DMAMUX2_ChannelStatus_BASE      (DMAMUX2_BASE + 0x0080)
#define DMAMUX2_RequestGenStatus_BASE   (DMAMUX2_BASE + 0x0140)

#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8)

#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8)

