bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define ADC_SMPR2_SMP19_Pos               (27U)                                
#define ADC_SMPR2_SMP19_Msk               (0x7U << ADC_SMPR2_SMP19_Pos)        /*!< 0x38000000 */
#define ADC_SMPR2_SMP19                   ADC_SMPR2_SMP19_Msk                  /*!< ADC Channel 19 Sampling time selection  */
#define ADC_SMPR2_SMP19_0                 (0x1U << ADC_SMPR2_SMP19_Pos)        /*!< 0x08000000 */
#define ADC_SMPR2_SMP19_1                 (0x2U << ADC_SMPR2_SMP19_Pos)        /*!< 0x10000000 */
#define ADC_SMPR2_SMP19_2                 (0x4U << ADC_SMPR2_SMP19_Pos)        /*!< 0x20000000 */

/********************  Bit definition for ADC_PCSEL register  ********************/
#define ADC_PCSEL_PCSEL_Pos               (0U)                                 
#define ADC_PCSEL_PCSEL_Msk               (0xFFFFFU << ADC_PCSEL_PCSEL_Pos)    /*!< 0x000FFFFF */
#define ADC_PCSEL_PCSEL                   ADC_PCSEL_PCSEL_Msk                  /*!< ADC pre channel selection */
#define ADC_PCSEL_PCSEL_0                 (0x00001U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000001 */
#define ADC_PCSEL_PCSEL_1                 (0x00002U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000002 */
#define ADC_PCSEL_PCSEL_2                 (0x00004U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000004 */
#define ADC_PCSEL_PCSEL_3                 (0x00008U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000008 */
#define ADC_PCSEL_PCSEL_4                 (0x00010U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000010 */
#define ADC_PCSEL_PCSEL_5                 (0x00020U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000020 */
#define ADC_PCSEL_PCSEL_6                 (0x00040U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000040 */
#define ADC_PCSEL_PCSEL_7                 (0x00080U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000080 */
#define ADC_PCSEL_PCSEL_8                 (0x00100U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000100 */
#define ADC_PCSEL_PCSEL_9                 (0x00200U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000200 */
#define ADC_PCSEL_PCSEL_10                (0x00400U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000400 */
#define ADC_PCSEL_PCSEL_11                (0x00800U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00000800 */
#define ADC_PCSEL_PCSEL_12                (0x01000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00001000 */
#define ADC_PCSEL_PCSEL_13                (0x02000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00002000 */
#define ADC_PCSEL_PCSEL_14                (0x04000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00004000 */
#define ADC_PCSEL_PCSEL_15                (0x08000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00008000 */
#define ADC_PCSEL_PCSEL_16                (0x10000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00010000 */
#define ADC_PCSEL_PCSEL_17                (0x20000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00020000 */
#define ADC_PCSEL_PCSEL_18                (0x40000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00040000 */
#define ADC_PCSEL_PCSEL_19                (0x80000U << ADC_PCSEL_PCSEL_Pos)    /*!< 0x00080000 */

/********************  Bit definition for ADC_LTR1 register  ********************/
#define ADC_LTR1_LT1_Pos                  (0U)                                 
#define ADC_LTR1_LT1_Msk                  (0x3FFFFFFU << ADC_LTR1_LT1_Pos)     /*!< 0x03FFFFFF */
#define ADC_LTR1_LT1                      ADC_LTR1_LT1_Msk                     /*!< ADC Analog watchdog 1 lower threshold */
#define ADC_LTR1_LT1_0                    (0x0000001U << ADC_LTR1_LT1_Pos)     /*!< 0x00000001 */
#define ADC_LTR1_LT1_1                    (0x0000002U << ADC_LTR1_LT1_Pos)     /*!< 0x00000002 */
#define ADC_LTR1_LT1_2                    (0x0000004U << ADC_LTR1_LT1_Pos)     /*!< 0x00000004 */
#define ADC_LTR1_LT1_3                    (0x0000008U << ADC_LTR1_LT1_Pos)     /*!< 0x00000008 */
#define ADC_LTR1_LT1_4                    (0x0000010U << ADC_LTR1_LT1_Pos)     /*!< 0x00000010 */
#define ADC_LTR1_LT1_5                    (0x0000020U << ADC_LTR1_LT1_Pos)     /*!< 0x00000020 */
#define ADC_LTR1_LT1_6                    (0x0000040U << ADC_LTR1_LT1_Pos)     /*!< 0x00000040 */
#define ADC_LTR1_LT1_7                    (0x0000080U << ADC_LTR1_LT1_Pos)     /*!< 0x00000080 */
#define ADC_LTR1_LT1_8                    (0x0000100U << ADC_LTR1_LT1_Pos)     /*!< 0x00000100 */
#define ADC_LTR1_LT1_9                    (0x0000200U << ADC_LTR1_LT1_Pos)     /*!< 0x00000200 */
#define ADC_LTR1_LT1_10                   (0x0000400U << ADC_LTR1_LT1_Pos)     /*!< 0x00000400 */
#define ADC_LTR1_LT1_11                   (0x0000800U << ADC_LTR1_LT1_Pos)     /*!< 0x00000800 */
#define ADC_LTR1_LT1_12                   (0x0001000U << ADC_LTR1_LT1_Pos)     /*!< 0x00001000 */
#define ADC_LTR1_LT1_13                   (0x0002000U << ADC_LTR1_LT1_Pos)     /*!< 0x00002000 */
#define ADC_LTR1_LT1_14                   (0x0004000U << ADC_LTR1_LT1_Pos)     /*!< 0x00004000 */
#define ADC_LTR1_LT1_15                   (0x0008000U << ADC_LTR1_LT1_Pos)     /*!< 0x00008000 */
#define ADC_LTR1_LT1_16                   (0x0010000U << ADC_LTR1_LT1_Pos)     /*!< 0x00010000 */
#define ADC_LTR1_LT1_17                   (0x0020000U << ADC_LTR1_LT1_Pos)     /*!< 0x00020000 */
#define ADC_LTR1_LT1_18                   (0x0040000U << ADC_LTR1_LT1_Pos)     /*!< 0x00040000 */
#define ADC_LTR1_LT1_19                   (0x0080000U << ADC_LTR1_LT1_Pos)     /*!< 0x00080000 */
#define ADC_LTR1_LT1_20                   (0x0100000U << ADC_LTR1_LT1_Pos)     /*!< 0x00100000 */
#define ADC_LTR1_LT1_21                   (0x0200000U << ADC_LTR1_LT1_Pos)     /*!< 0x00200000 */
#define ADC_LTR1_LT1_22                   (0x0400000U << ADC_LTR1_LT1_Pos)     /*!< 0x00400000 */
#define ADC_LTR1_LT1_23                   (0x0800000U << ADC_LTR1_LT1_Pos)     /*!< 0x00800000 */
#define ADC_LTR1_LT1_24                   (0x1000000U << ADC_LTR1_LT1_Pos)     /*!< 0x01000000 */
#define ADC_LTR1_LT1_25                   (0x2000000U << ADC_LTR1_LT1_Pos)     /*!< 0x02000000 */

/********************  Bit definition for ADC_HTR1 register  ********************/
#define ADC_HTR1_HT1_Pos                  (0U)                                 
#define ADC_HTR1_HT1_Msk                  (0x3FFFFFFU << ADC_HTR1_HT1_Pos)     /*!< 0x03FFFFFF */
#define ADC_HTR1_HT1                      ADC_HTR1_HT1_Msk                     /*!< ADC Analog watchdog 1 higher threshold */
#define ADC_HTR1_HT1_0                    (0x0000001U << ADC_HTR1_HT1_Pos)     /*!< 0x00000001 */
#define ADC_HTR1_HT1_1                    (0x0000002U << ADC_HTR1_HT1_Pos)     /*!< 0x00000002 */
#define ADC_HTR1_HT1_2                    (0x0000004U << ADC_HTR1_HT1_Pos)     /*!< 0x00000004 */
#define ADC_HTR1_HT1_3                    (0x0000008U << ADC_HTR1_HT1_Pos)     /*!< 0x00000008 */
#define ADC_HTR1_HT1_4                    (0x0000010U << ADC_HTR1_HT1_Pos)     /*!< 0x00000010 */
#define ADC_HTR1_HT1_5                    (0x0000020U << ADC_HTR1_HT1_Pos)     /*!< 0x00000020 */
#define ADC_HTR1_HT1_6                    (0x0000040U << ADC_HTR1_HT1_Pos)     /*!< 0x00000040 */
#define ADC_HTR1_HT1_7                    (0x0000080U << ADC_HTR1_HT1_Pos)     /*!< 0x00000080 */
#define ADC_HTR1_HT1_8                    (0x0000100U << ADC_HTR1_HT1_Pos)     /*!< 0x00000100 */
#define ADC_HTR1_HT1_9                    (0x0000200U << ADC_HTR1_HT1_Pos)     /*!< 0x00000200 */
#define ADC_HTR1_HT1_10                   (0x0000400U << ADC_HTR1_HT1_Pos)     /*!< 0x00000400 */
#define ADC_HTR1_HT1_11                   (0x0000800U << ADC_HTR1_HT1_Pos)     /*!< 0x00000800 */
#define ADC_HTR1_HT1_12                   (0x0001000U << ADC_HTR1_HT1_Pos)     /*!< 0x00001000 */
#define ADC_HTR1_HT1_13                   (0x0002000U << ADC_HTR1_HT1_Pos)     /*!< 0x00002000 */
#define ADC_HTR1_HT1_14                   (0x0004000U << ADC_HTR1_HT1_Pos)     /*!< 0x00004000 */
#define ADC_HTR1_HT1_15                   (0x0008000U << ADC_HTR1_HT1_Pos)     /*!< 0x00008000 */
#define ADC_HTR1_HT1_16                   (0x0010000U << ADC_HTR1_HT1_Pos)     /*!< 0x00010000 */
#define ADC_HTR1_HT1_17                   (0x0020000U << ADC_HTR1_HT1_Pos)     /*!< 0x00020000 */
#define ADC_HTR1_HT1_18                   (0x0040000U << ADC_HTR1_HT1_Pos)     /*!< 0x00040000 */
#define ADC_HTR1_HT1_19                   (0x0080000U << ADC_HTR1_HT1_Pos)     /*!< 0x00080000 */
#define ADC_HTR1_HT1_20                   (0x0100000U << ADC_HTR1_HT1_Pos)     /*!< 0x00100000 */
#define ADC_HTR1_HT1_21                   (0x0200000U << ADC_HTR1_HT1_Pos)     /*!< 0x00200000 */
#define ADC_HTR1_HT1_22                   (0x0400000U << ADC_HTR1_HT1_Pos)     /*!< 0x00400000 */
#define ADC_HTR1_HT1_23                   (0x0800000U << ADC_HTR1_HT1_Pos)     /*!< 0x00800000 */
#define ADC_HTR1_HT1_24                   (0x1000000U << ADC_HTR1_HT1_Pos)     /*!< 0x01000000 */
#define ADC_HTR1_HT1_25                   (0x2000000U << ADC_HTR1_HT1_Pos)     /*!< 0x02000000 */

/********************  Bit definition for ADC_LTR2 register  ********************/
#define ADC_LTR2_LT2_Pos                  (0U)                                 
#define ADC_LTR2_LT2_Msk                  (0x3FFFFFFU << ADC_LTR2_LT2_Pos)     /*!< 0x03FFFFFF */
#define ADC_LTR2_LT2                      ADC_LTR2_LT2_Msk                     /*!< ADC Analog watchdog 2 lower threshold */
#define ADC_LTR2_LT2_0                    (0x0000001U << ADC_LTR2_LT2_Pos)     /*!< 0x00000001 */
#define ADC_LTR2_LT2_1                    (0x0000002U << ADC_LTR2_LT2_Pos)     /*!< 0x00000002 */
#define ADC_LTR2_LT2_2                    (0x0000004U << ADC_LTR2_LT2_Pos)     /*!< 0x00000004 */
#define ADC_LTR2_LT2_3                    (0x0000008U << ADC_LTR2_LT2_Pos)     /*!< 0x00000008 */
#define ADC_LTR2_LT2_4                    (0x0000010U << ADC_LTR2_LT2_Pos)     /*!< 0x00000010 */
#define ADC_LTR2_LT2_5                    (0x0000020U << ADC_LTR2_LT2_Pos)     /*!< 0x00000020 */
#define ADC_LTR2_LT2_6                    (0x0000040U << ADC_LTR2_LT2_Pos)     /*!< 0x00000040 */
#define ADC_LTR2_LT2_7                    (0x0000080U << ADC_LTR2_LT2_Pos)     /*!< 0x00000080 */
#define ADC_LTR2_LT2_8                    (0x0000100U << ADC_LTR2_LT2_Pos)     /*!< 0x00000100 */
#define ADC_LTR2_LT2_9                    (0x0000200U << ADC_LTR2_LT2_Pos)     /*!< 0x00000200 */
#define ADC_LTR2_LT2_10                   (0x0000400U << ADC_LTR2_LT2_Pos)     /*!< 0x00000400 */
#define ADC_LTR2_LT2_11                   (0x0000800U << ADC_LTR2_LT2_Pos)     /*!< 0x00000800 */
#define ADC_LTR2_LT2_12                   (0x0001000U << ADC_LTR2_LT2_Pos)     /*!< 0x00001000 */
#define ADC_LTR2_LT2_13                   (0x0002000U << ADC_LTR2_LT2_Pos)     /*!< 0x00002000 */
#define ADC_LTR2_LT2_14                   (0x0004000U << ADC_LTR2_LT2_Pos)     /*!< 0x00004000 */
#define ADC_LTR2_LT2_15                   (0x0008000U << ADC_LTR2_LT2_Pos)     /*!< 0x00008000 */
#define ADC_LTR2_LT2_16                   (0x0010000U << ADC_LTR2_LT2_Pos)     /*!< 0x00010000 */
#define ADC_LTR2_LT2_17                   (0x0020000U << ADC_LTR2_LT2_Pos)     /*!< 0x00020000 */
#define ADC_LTR2_LT2_18                   (0x0040000U << ADC_LTR2_LT2_Pos)     /*!< 0x00040000 */
#define ADC_LTR2_LT2_19                   (0x0080000U << ADC_LTR2_LT2_Pos)     /*!< 0x00080000 */
#define ADC_LTR2_LT2_20                   (0x0100000U << ADC_LTR2_LT2_Pos)     /*!< 0x00100000 */
#define ADC_LTR2_LT2_21                   (0x0200000U << ADC_LTR2_LT2_Pos)     /*!< 0x00200000 */
#define ADC_LTR2_LT2_22                   (0x0400000U << ADC_LTR2_LT2_Pos)     /*!< 0x00400000 */
#define ADC_LTR2_LT2_23                   (0x0800000U << ADC_LTR2_LT2_Pos)     /*!< 0x00800000 */
#define ADC_LTR2_LT2_24                   (0x1000000U << ADC_LTR2_LT2_Pos)     /*!< 0x01000000 */
#define ADC_LTR2_LT2_25                   (0x2000000U << ADC_LTR2_LT2_Pos)     /*!< 0x02000000 */

