bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for ADC_HTR2 register  ********************/
#define ADC_HTR2_HT2_Pos                  (0U)                                 
#define ADC_HTR2_HT2_Msk                  (0x3FFFFFFU << ADC_HTR2_HT2_Pos)     /*!< 0x03FFFFFF */
#define ADC_HTR2_HT2                      ADC_HTR2_HT2_Msk                     /*!< ADC Analog watchdog 2 higher threshold */
#define ADC_HTR2_HT2_0                    (0x0000001U << ADC_HTR2_HT2_Pos)     /*!< 0x00000001 */
#define ADC_HTR2_HT2_1                    (0x0000002U << ADC_HTR2_HT2_Pos)     /*!< 0x00000002 */
#define ADC_HTR2_HT2_2                    (0x0000004U << ADC_HTR2_HT2_Pos)     /*!< 0x00000004 */
#define ADC_HTR2_HT2_3                    (0x0000008U << ADC_HTR2_HT2_Pos)     /*!< 0x00000008 */
#define ADC_HTR2_HT2_4                    (0x0000010U << ADC_HTR2_HT2_Pos)     /*!< 0x00000010 */
#define ADC_HTR2_HT2_5                    (0x0000020U << ADC_HTR2_HT2_Pos)     /*!< 0x00000020 */
#define ADC_HTR2_HT2_6                    (0x0000040U << ADC_HTR2_HT2_Pos)     /*!< 0x00000040 */
#define ADC_HTR2_HT2_7                    (0x0000080U << ADC_HTR2_HT2_Pos)     /*!< 0x00000080 */
#define ADC_HTR2_HT2_8                    (0x0000100U << ADC_HTR2_HT2_Pos)     /*!< 0x00000100 */
#define ADC_HTR2_HT2_9                    (0x0000200U << ADC_HTR2_HT2_Pos)     /*!< 0x00000200 */
#define ADC_HTR2_HT2_10                   (0x0000400U << ADC_HTR2_HT2_Pos)     /*!< 0x00000400 */
#define ADC_HTR2_HT2_11                   (0x0000800U << ADC_HTR2_HT2_Pos)     /*!< 0x00000800 */
#define ADC_HTR2_HT2_12                   (0x0001000U << ADC_HTR2_HT2_Pos)     /*!< 0x00001000 */
#define ADC_HTR2_HT2_13                   (0x0002000U << ADC_HTR2_HT2_Pos)     /*!< 0x00002000 */
#define ADC_HTR2_HT2_14                   (0x0004000U << ADC_HTR2_HT2_Pos)     /*!< 0x00004000 */
#define ADC_HTR2_HT2_15                   (0x0008000U << ADC_HTR2_HT2_Pos)     /*!< 0x00008000 */
#define ADC_HTR2_HT2_16                   (0x0010000U << ADC_HTR2_HT2_Pos)     /*!< 0x00010000 */
#define ADC_HTR2_HT2_17                   (0x0020000U << ADC_HTR2_HT2_Pos)     /*!< 0x00020000 */
#define ADC_HTR2_HT2_18                   (0x0040000U << ADC_HTR2_HT2_Pos)     /*!< 0x00040000 */
#define ADC_HTR2_HT2_19                   (0x0080000U << ADC_HTR2_HT2_Pos)     /*!< 0x00080000 */
#define ADC_HTR2_HT2_20                   (0x0100000U << ADC_HTR2_HT2_Pos)     /*!< 0x00100000 */
#define ADC_HTR2_HT2_21                   (0x0200000U << ADC_HTR2_HT2_Pos)     /*!< 0x00200000 */
#define ADC_HTR2_HT2_22                   (0x0400000U << ADC_HTR2_HT2_Pos)     /*!< 0x00400000 */
#define ADC_HTR2_HT2_23                   (0x0800000U << ADC_HTR2_HT2_Pos)     /*!< 0x00800000 */
#define ADC_HTR2_HT2_24                   (0x1000000U << ADC_HTR2_HT2_Pos)     /*!< 0x01000000 */
#define ADC_HTR2_HT2_25                   (0x2000000U << ADC_HTR2_HT2_Pos)     /*!< 0x02000000 */

/********************  Bit definition for ADC_LTR3 register  ********************/
#define ADC_LTR3_LT3_Pos                  (0U)                                 
#define ADC_LTR3_LT3_Msk                  (0x3FFFFFFU << ADC_LTR3_LT3_Pos)     /*!< 0x03FFFFFF */
#define ADC_LTR3_LT3                      ADC_LTR3_LT3_Msk                     /*!< ADC Analog watchdog 3 lower threshold */
#define ADC_LTR3_LT3_0                    (0x0000001U << ADC_LTR3_LT3_Pos)     /*!< 0x00000001 */
#define ADC_LTR3_LT3_1                    (0x0000002U << ADC_LTR3_LT3_Pos)     /*!< 0x00000002 */
#define ADC_LTR3_LT3_2                    (0x0000004U << ADC_LTR3_LT3_Pos)     /*!< 0x00000004 */
#define ADC_LTR3_LT3_3                    (0x0000008U << ADC_LTR3_LT3_Pos)     /*!< 0x00000008 */
#define ADC_LTR3_LT3_4                    (0x0000010U << ADC_LTR3_LT3_Pos)     /*!< 0x00000010 */
#define ADC_LTR3_LT3_5                    (0x0000020U << ADC_LTR3_LT3_Pos)     /*!< 0x00000020 */
#define ADC_LTR3_LT3_6                    (0x0000040U << ADC_LTR3_LT3_Pos)     /*!< 0x00000040 */
#define ADC_LTR3_LT3_7                    (0x0000080U << ADC_LTR3_LT3_Pos)     /*!< 0x00000080 */
#define ADC_LTR3_LT3_8                    (0x0000100U << ADC_LTR3_LT3_Pos)     /*!< 0x00000100 */
#define ADC_LTR3_LT3_9                    (0x0000200U << ADC_LTR3_LT3_Pos)     /*!< 0x00000200 */
#define ADC_LTR3_LT3_10                   (0x0000400U << ADC_LTR3_LT3_Pos)     /*!< 0x00000400 */
#define ADC_LTR3_LT3_11                   (0x0000800U << ADC_LTR3_LT3_Pos)     /*!< 0x00000800 */
#define ADC_LTR3_LT3_12                   (0x0001000U << ADC_LTR3_LT3_Pos)     /*!< 0x00001000 */
#define ADC_LTR3_LT3_13                   (0x0002000U << ADC_LTR3_LT3_Pos)     /*!< 0x00002000 */
#define ADC_LTR3_LT3_14                   (0x0004000U << ADC_LTR3_LT3_Pos)     /*!< 0x00004000 */
#define ADC_LTR3_LT3_15                   (0x0008000U << ADC_LTR3_LT3_Pos)     /*!< 0x00008000 */
#define ADC_LTR3_LT3_16                   (0x0010000U << ADC_LTR3_LT3_Pos)     /*!< 0x00010000 */
#define ADC_LTR3_LT3_17                   (0x0020000U << ADC_LTR3_LT3_Pos)     /*!< 0x00020000 */
#define ADC_LTR3_LT3_18                   (0x0040000U << ADC_LTR3_LT3_Pos)     /*!< 0x00040000 */
#define ADC_LTR3_LT3_19                   (0x0080000U << ADC_LTR3_LT3_Pos)     /*!< 0x00080000 */
#define ADC_LTR3_LT3_20                   (0x0100000U << ADC_LTR3_LT3_Pos)     /*!< 0x00100000 */
#define ADC_LTR3_LT3_21                   (0x0200000U << ADC_LTR3_LT3_Pos)     /*!< 0x00200000 */
#define ADC_LTR3_LT3_22                   (0x0400000U << ADC_LTR3_LT3_Pos)     /*!< 0x00400000 */
#define ADC_LTR3_LT3_23                   (0x0800000U << ADC_LTR3_LT3_Pos)     /*!< 0x00800000 */
#define ADC_LTR3_LT3_24                   (0x1000000U << ADC_LTR3_LT3_Pos)     /*!< 0x01000000 */
#define ADC_LTR3_LT3_25                   (0x2000000U << ADC_LTR3_LT3_Pos)     /*!< 0x02000000 */

/********************  Bit definition for ADC_HTR3 register  ********************/
#define ADC_HTR3_HT3_Pos                  (0U)                                 
#define ADC_HTR3_HT3_Msk                  (0x3FFFFFFU << ADC_HTR3_HT3_Pos)     /*!< 0x03FFFFFF */
#define ADC_HTR3_HT3                      ADC_HTR3_HT3_Msk                     /*!< ADC Analog watchdog 3 higher threshold */
#define ADC_HTR3_HT3_0                    (0x0000001U << ADC_HTR3_HT3_Pos)     /*!< 0x00000001 */
#define ADC_HTR3_HT3_1                    (0x0000002U << ADC_HTR3_HT3_Pos)     /*!< 0x00000002 */
#define ADC_HTR3_HT3_2                    (0x0000004U << ADC_HTR3_HT3_Pos)     /*!< 0x00000004 */
#define ADC_HTR3_HT3_3                    (0x0000008U << ADC_HTR3_HT3_Pos)     /*!< 0x00000008 */
#define ADC_HTR3_HT3_4                    (0x0000010U << ADC_HTR3_HT3_Pos)     /*!< 0x00000010 */
#define ADC_HTR3_HT3_5                    (0x0000020U << ADC_HTR3_HT3_Pos)     /*!< 0x00000020 */
#define ADC_HTR3_HT3_6                    (0x0000040U << ADC_HTR3_HT3_Pos)     /*!< 0x00000040 */
#define ADC_HTR3_HT3_7                    (0x0000080U << ADC_HTR3_HT3_Pos)     /*!< 0x00000080 */
#define ADC_HTR3_HT3_8                    (0x0000100U << ADC_HTR3_HT3_Pos)     /*!< 0x00000100 */
#define ADC_HTR3_HT3_9                    (0x0000200U << ADC_HTR3_HT3_Pos)     /*!< 0x00000200 */
#define ADC_HTR3_HT3_10                   (0x0000400U << ADC_HTR3_HT3_Pos)     /*!< 0x00000400 */
#define ADC_HTR3_HT3_11                   (0x0000800U << ADC_HTR3_HT3_Pos)     /*!< 0x00000800 */
#define ADC_HTR3_HT3_12                   (0x0001000U << ADC_HTR3_HT3_Pos)     /*!< 0x00001000 */
#define ADC_HTR3_HT3_13                   (0x0002000U << ADC_HTR3_HT3_Pos)     /*!< 0x00002000 */
#define ADC_HTR3_HT3_14                   (0x0004000U << ADC_HTR3_HT3_Pos)     /*!< 0x00004000 */
#define ADC_HTR3_HT3_15                   (0x0008000U << ADC_HTR3_HT3_Pos)     /*!< 0x00008000 */
#define ADC_HTR3_HT3_16                   (0x0010000U << ADC_HTR3_HT3_Pos)     /*!< 0x00010000 */
#define ADC_HTR3_HT3_17                   (0x0020000U << ADC_HTR3_HT3_Pos)     /*!< 0x00020000 */
#define ADC_HTR3_HT3_18                   (0x0040000U << ADC_HTR3_HT3_Pos)     /*!< 0x00040000 */
#define ADC_HTR3_HT3_19                   (0x0080000U << ADC_HTR3_HT3_Pos)     /*!< 0x00080000 */
#define ADC_HTR3_HT3_20                   (0x0100000U << ADC_HTR3_HT3_Pos)     /*!< 0x00100000 */
#define ADC_HTR3_HT3_21                   (0x0200000U << ADC_HTR3_HT3_Pos)     /*!< 0x00200000 */
#define ADC_HTR3_HT3_22                   (0x0400000U << ADC_HTR3_HT3_Pos)     /*!< 0x00400000 */
#define ADC_HTR3_HT3_23                   (0x0800000U << ADC_HTR3_HT3_Pos)     /*!< 0x00800000 */
#define ADC_HTR3_HT3_24                   (0x1000000U << ADC_HTR3_HT3_Pos)     /*!< 0x01000000 */
#define ADC_HTR3_HT3_25                   (0x2000000U << ADC_HTR3_HT3_Pos)     /*!< 0x02000000 */

/********************  Bit definition for ADC_SQR1 register  ********************/
#define ADC_SQR1_L_Pos                    (0U)                                 
#define ADC_SQR1_L_Msk                    (0xFU << ADC_SQR1_L_Pos)             /*!< 0x0000000F */
#define ADC_SQR1_L                        ADC_SQR1_L_Msk                       /*!< ADC regular channel sequence lenght */
#define ADC_SQR1_L_0                      (0x1U << ADC_SQR1_L_Pos)             /*!< 0x00000001 */
#define ADC_SQR1_L_1                      (0x2U << ADC_SQR1_L_Pos)             /*!< 0x00000002 */
#define ADC_SQR1_L_2                      (0x4U << ADC_SQR1_L_Pos)             /*!< 0x00000004 */
#define ADC_SQR1_L_3                      (0x8U << ADC_SQR1_L_Pos)             /*!< 0x00000008 */

#define ADC_SQR1_SQ1_Pos                  (6U)                                 
#define ADC_SQR1_SQ1_Msk                  (0x1FU << ADC_SQR1_SQ1_Pos)          /*!< 0x000007C0 */
#define ADC_SQR1_SQ1                      ADC_SQR1_SQ1_Msk                     /*!< ADC 1st conversion in regular sequence */
#define ADC_SQR1_SQ1_0                    (0x01U << ADC_SQR1_SQ1_Pos)          /*!< 0x00000040 */
#define ADC_SQR1_SQ1_1                    (0x02U << ADC_SQR1_SQ1_Pos)          /*!< 0x00000080 */
#define ADC_SQR1_SQ1_2                    (0x04U << ADC_SQR1_SQ1_Pos)          /*!< 0x00000100 */
#define ADC_SQR1_SQ1_3                    (0x08U << ADC_SQR1_SQ1_Pos)          /*!< 0x00000200 */
#define ADC_SQR1_SQ1_4                    (0x10U << ADC_SQR1_SQ1_Pos)          /*!< 0x00000400 */

#define ADC_SQR1_SQ2_Pos                  (12U)                                
#define ADC_SQR1_SQ2_Msk                  (0x1FU << ADC_SQR1_SQ2_Pos)          /*!< 0x0001F000 */
#define ADC_SQR1_SQ2                      ADC_SQR1_SQ2_Msk                     /*!< ADC 2nd conversion in regular sequence */
#define ADC_SQR1_SQ2_0                    (0x01U << ADC_SQR1_SQ2_Pos)          /*!< 0x00001000 */
#define ADC_SQR1_SQ2_1                    (0x02U << ADC_SQR1_SQ2_Pos)          /*!< 0x00002000 */
#define ADC_SQR1_SQ2_2                    (0x04U << ADC_SQR1_SQ2_Pos)          /*!< 0x00004000 */
#define ADC_SQR1_SQ2_3                    (0x08U << ADC_SQR1_SQ2_Pos)          /*!< 0x00008000 */
#define ADC_SQR1_SQ2_4                    (0x10U << ADC_SQR1_SQ2_Pos)          /*!< 0x00010000 */

#define ADC_SQR1_SQ3_Pos                  (18U)                                
#define ADC_SQR1_SQ3_Msk                  (0x1FU << ADC_SQR1_SQ3_Pos)          /*!< 0x007C0000 */
#define ADC_SQR1_SQ3                      ADC_SQR1_SQ3_Msk                     /*!< ADC 3rd conversion in regular sequence */
#define ADC_SQR1_SQ3_0                    (0x01U << ADC_SQR1_SQ3_Pos)          /*!< 0x00040000 */
#define ADC_SQR1_SQ3_1                    (0x02U << ADC_SQR1_SQ3_Pos)          /*!< 0x00080000 */
#define ADC_SQR1_SQ3_2                    (0x04U << ADC_SQR1_SQ3_Pos)          /*!< 0x00100000 */
#define ADC_SQR1_SQ3_3                    (0x08U << ADC_SQR1_SQ3_Pos)          /*!< 0x00200000 */
#define ADC_SQR1_SQ3_4                    (0x10U << ADC_SQR1_SQ3_Pos)          /*!< 0x00400000 */

