bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for ADC_CALFACT register  ********************/
#define ADC_CALFACT_CALFACT_S_Pos         (0U)                                 
#define ADC_CALFACT_CALFACT_S_Msk         (0x7FFU << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x000007FF */
#define ADC_CALFACT_CALFACT_S             ADC_CALFACT_CALFACT_S_Msk            /*!< ADC calibration factors in single-ended mode */
#define ADC_CALFACT_CALFACT_S_0           (0x001U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000001 */
#define ADC_CALFACT_CALFACT_S_1           (0x002U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000002 */
#define ADC_CALFACT_CALFACT_S_2           (0x004U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000004 */
#define ADC_CALFACT_CALFACT_S_3           (0x008U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000008 */
#define ADC_CALFACT_CALFACT_S_4           (0x010U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000010 */
#define ADC_CALFACT_CALFACT_S_5           (0x020U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000020 */
#define ADC_CALFACT_CALFACT_S_6           (0x040U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000040 */
#define ADC_CALFACT_CALFACT_S_7           (0x080U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000080 */
#define ADC_CALFACT_CALFACT_S_8           (0x100U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000100 */
#define ADC_CALFACT_CALFACT_S_9           (0x200U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000200 */
#define ADC_CALFACT_CALFACT_S_10          (0x400U << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000400 */
#define ADC_CALFACT_CALFACT_D_Pos         (16U)                                
#define ADC_CALFACT_CALFACT_D_Msk         (0x7FFU << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x07FF0000 */
#define ADC_CALFACT_CALFACT_D             ADC_CALFACT_CALFACT_D_Msk            /*!< ADC calibration factors in differential mode */
#define ADC_CALFACT_CALFACT_D_0           (0x001U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00010000 */
#define ADC_CALFACT_CALFACT_D_1           (0x002U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00020000 */
#define ADC_CALFACT_CALFACT_D_2           (0x004U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00040000 */
#define ADC_CALFACT_CALFACT_D_3           (0x008U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00080000 */
#define ADC_CALFACT_CALFACT_D_4           (0x010U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00100000 */
#define ADC_CALFACT_CALFACT_D_5           (0x020U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00200000 */
#define ADC_CALFACT_CALFACT_D_6           (0x040U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00400000 */
#define ADC_CALFACT_CALFACT_D_7           (0x080U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00800000 */
#define ADC_CALFACT_CALFACT_D_8           (0x100U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x01000000 */
#define ADC_CALFACT_CALFACT_D_9           (0x200U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x02000000 */
#define ADC_CALFACT_CALFACT_D_10          (0x400U << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x04000000 */

/********************  Bit definition for ADC_CALFACT2 register  ********************/
#define ADC_CALFACT2_LINCALFACT_Pos       (0U)                                 
#define ADC_CALFACT2_LINCALFACT_Msk       (0x3FFFFFFFU << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x3FFFFFFF */
#define ADC_CALFACT2_LINCALFACT           ADC_CALFACT2_LINCALFACT_Msk          /*!< ADC Linearity calibration factors */
#define ADC_CALFACT2_LINCALFACT_0         (0x00000001U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000001 */
#define ADC_CALFACT2_LINCALFACT_1         (0x00000002U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000002 */
#define ADC_CALFACT2_LINCALFACT_2         (0x00000004U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000004 */
#define ADC_CALFACT2_LINCALFACT_3         (0x00000008U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000008 */
#define ADC_CALFACT2_LINCALFACT_4         (0x00000010U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000010 */
#define ADC_CALFACT2_LINCALFACT_5         (0x00000020U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000020 */
#define ADC_CALFACT2_LINCALFACT_6         (0x00000040U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000040 */
#define ADC_CALFACT2_LINCALFACT_7         (0x00000080U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000080 */
#define ADC_CALFACT2_LINCALFACT_8         (0x00000100U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000100 */
#define ADC_CALFACT2_LINCALFACT_9         (0x00000200U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000200 */
#define ADC_CALFACT2_LINCALFACT_10        (0x00000400U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000400 */
#define ADC_CALFACT2_LINCALFACT_11        (0x00000800U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00000800 */
#define ADC_CALFACT2_LINCALFACT_12        (0x00001000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00001000 */
#define ADC_CALFACT2_LINCALFACT_13        (0x00002000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00002000 */
#define ADC_CALFACT2_LINCALFACT_14        (0x00004000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00004000 */
#define ADC_CALFACT2_LINCALFACT_15        (0x00008000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00008000 */
#define ADC_CALFACT2_LINCALFACT_16        (0x00010000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00010000 */
#define ADC_CALFACT2_LINCALFACT_17        (0x00020000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00020000 */
#define ADC_CALFACT2_LINCALFACT_18        (0x00040000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00040000 */
#define ADC_CALFACT2_LINCALFACT_19        (0x00080000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00080000 */
#define ADC_CALFACT2_LINCALFACT_20        (0x00100000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00100000 */
#define ADC_CALFACT2_LINCALFACT_21        (0x00200000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00200000 */
#define ADC_CALFACT2_LINCALFACT_22        (0x00400000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00400000 */
#define ADC_CALFACT2_LINCALFACT_23        (0x00800000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x00800000 */
#define ADC_CALFACT2_LINCALFACT_24        (0x01000000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x01000000 */
#define ADC_CALFACT2_LINCALFACT_25        (0x02000000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x02000000 */
#define ADC_CALFACT2_LINCALFACT_26        (0x04000000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x04000000 */
#define ADC_CALFACT2_LINCALFACT_27        (0x08000000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x08000000 */
#define ADC_CALFACT2_LINCALFACT_28        (0x10000000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x10000000 */
#define ADC_CALFACT2_LINCALFACT_29        (0x20000000U << ADC_CALFACT2_LINCALFACT_Pos) /*!< 0x20000000 */

/*************************  ADC Common registers  *****************************/
/********************  Bit definition for ADC_CSR register  ********************/
#define ADC123_CSR_ADRDY_MST_Pos        (0U)                                   
#define ADC123_CSR_ADRDY_MST_Msk        (0x1U << ADC123_CSR_ADRDY_MST_Pos)     /*!< 0x00000001 */
#define ADC123_CSR_ADRDY_MST            ADC123_CSR_ADRDY_MST_Msk               /*!< Master ADC ready */
#define ADC123_CSR_EOSMP_MST_Pos        (1U)                                   
#define ADC123_CSR_EOSMP_MST_Msk        (0x1U << ADC123_CSR_EOSMP_MST_Pos)     /*!< 0x00000002 */
#define ADC123_CSR_EOSMP_MST            ADC123_CSR_EOSMP_MST_Msk               /*!< End of sampling phase flag of the master ADC */
#define ADC123_CSR_EOC_MST_Pos          (2U)                                   
#define ADC123_CSR_EOC_MST_Msk          (0x1U << ADC123_CSR_EOC_MST_Pos)       /*!< 0x00000004 */
#define ADC123_CSR_EOC_MST              ADC123_CSR_EOC_MST_Msk                 /*!< End of regular conversion of the master ADC */
#define ADC123_CSR_EOS_MST_Pos          (3U)                                   
#define ADC123_CSR_EOS_MST_Msk          (0x1U << ADC123_CSR_EOS_MST_Pos)       /*!< 0x00000008 */
#define ADC123_CSR_EOS_MST              ADC123_CSR_EOS_MST_Msk                 /*!< End of regular sequence flag of the master ADC */
#define ADC123_CSR_OVR_MST_Pos          (4U)                                   
#define ADC123_CSR_OVR_MST_Msk          (0x1U << ADC123_CSR_OVR_MST_Pos)       /*!< 0x00000010 */
#define ADC123_CSR_OVR_MST              ADC123_CSR_OVR_MST_Msk                 /*!< Overrun flag of the master ADC */
#define ADC123_CSR_JEOC_MST_Pos         (5U)                                   
#define ADC123_CSR_JEOC_MST_Msk         (0x1U << ADC123_CSR_JEOC_MST_Pos)      /*!< 0x00000020 */
#define ADC123_CSR_JEOC_MST             ADC123_CSR_JEOC_MST_Msk                /*!< End of injected conversion of the master ADC */
#define ADC123_CSR_JEOS_MST_Pos         (6U)                                   
#define ADC123_CSR_JEOS_MST_Msk         (0x1U << ADC123_CSR_JEOS_MST_Pos)      /*!< 0x00000040 */
#define ADC123_CSR_JEOS_MST             ADC123_CSR_JEOS_MST_Msk                /*!< End of injected sequence flag of the master ADC */
#define ADC123_CSR_AWD1_MST_Pos         (7U)                                   
#define ADC123_CSR_AWD1_MST_Msk         (0x1U << ADC123_CSR_AWD1_MST_Pos)      /*!< 0x00000080 */
#define ADC123_CSR_AWD1_MST             ADC123_CSR_AWD1_MST_Msk                /*!< Analog watchdog 1 flag of the master ADC */
#define ADC123_CSR_AWD2_MST_Pos         (8U)                                   
#define ADC123_CSR_AWD2_MST_Msk         (0x1U << ADC123_CSR_AWD2_MST_Pos)      /*!< 0x00000100 */
#define ADC123_CSR_AWD2_MST             ADC123_CSR_AWD2_MST_Msk                /*!< Analog watchdog 2 flag of the master ADC */
#define ADC123_CSR_AWD3_MST_Pos         (9U)                                   
#define ADC123_CSR_AWD3_MST_Msk         (0x1U << ADC123_CSR_AWD3_MST_Pos)      /*!< 0x00000200 */
#define ADC123_CSR_AWD3_MST             ADC123_CSR_AWD3_MST_Msk                /*!< Analog watchdog 3 flag of the master ADC */
#define ADC123_CSR_JQOVF_MST_Pos        (10U)                                  
#define ADC123_CSR_JQOVF_MST_Msk        (0x1U << ADC123_CSR_JQOVF_MST_Pos)     /*!< 0x00000400 */
#define ADC123_CSR_JQOVF_MST            ADC123_CSR_JQOVF_MST_Msk               /*!< Injected context queue overflow flag of the master ADC */
#define ADC123_CSR_ADRDY_SLV_Pos        (16U)                                  
#define ADC123_CSR_ADRDY_SLV_Msk        (0x1U << ADC123_CSR_ADRDY_SLV_Pos)     /*!< 0x00010000 */
#define ADC123_CSR_ADRDY_SLV            ADC123_CSR_ADRDY_SLV_Msk               /*!< Slave ADC ready */
#define ADC123_CSR_EOSMP_SLV_Pos        (17U)                                  
#define ADC123_CSR_EOSMP_SLV_Msk        (0x1U << ADC123_CSR_EOSMP_SLV_Pos)     /*!< 0x00020000 */
#define ADC123_CSR_EOSMP_SLV            ADC123_CSR_EOSMP_SLV_Msk               /*!< End of sampling phase flag of the slave ADC */
#define ADC123_CSR_EOC_SLV_Pos          (18U)                                  
#define ADC123_CSR_EOC_SLV_Msk          (0x1U << ADC123_CSR_EOC_SLV_Pos)       /*!< 0x00040000 */
#define ADC123_CSR_EOC_SLV              ADC123_CSR_EOC_SLV_Msk                 /*!< End of regular conversion of the slave ADC */
#define ADC123_CSR_EOS_SLV_Pos          (19U)                                  
#define ADC123_CSR_EOS_SLV_Msk          (0x1U << ADC123_CSR_EOS_SLV_Pos)       /*!< 0x00080000 */
#define ADC123_CSR_EOS_SLV              ADC123_CSR_EOS_SLV_Msk                 /*!< End of regular sequence flag of the slave ADC */
#define ADC123_CSR_OVR_SLV_Pos          (20U)                                  
#define ADC123_CSR_OVR_SLV_Msk          (0x1U << ADC123_CSR_OVR_SLV_Pos)       /*!< 0x00100000 */
#define ADC123_CSR_OVR_SLV              ADC123_CSR_OVR_SLV_Msk                 /*!< Overrun flag of the slave ADC */
#define ADC123_CSR_JEOC_SLV_Pos         (21U)                                  
#define ADC123_CSR_JEOC_SLV_Msk         (0x1U << ADC123_CSR_JEOC_SLV_Pos)      /*!< 0x00200000 */
#define ADC123_CSR_JEOC_SLV             ADC123_CSR_JEOC_SLV_Msk                /*!< End of injected conversion of the slave ADC */
#define ADC123_CSR_JEOS_SLV_Pos         (22U)                                  
#define ADC123_CSR_JEOS_SLV_Msk         (0x1U << ADC123_CSR_JEOS_SLV_Pos)      /*!< 0x00400000 */
#define ADC123_CSR_JEOS_SLV             ADC123_CSR_JEOS_SLV_Msk                /*!< End of injected sequence flag of the slave ADC */
#define ADC123_CSR_AWD1_SLV_Pos         (23U)                                  
#define ADC123_CSR_AWD1_SLV_Msk         (0x1U << ADC123_CSR_AWD1_SLV_Pos)      /*!< 0x00800000 */
#define ADC123_CSR_AWD1_SLV             ADC123_CSR_AWD1_SLV_Msk                /*!< Analog watchdog 1 flag of the slave ADC */
#define ADC123_CSR_AWD2_SLV_Pos         (24U)                                  
#define ADC123_CSR_AWD2_SLV_Msk         (0x1U << ADC123_CSR_AWD2_SLV_Pos)      /*!< 0x01000000 */
#define ADC123_CSR_AWD2_SLV             ADC123_CSR_AWD2_SLV_Msk                /*!< Analog watchdog 2 flag of the slave ADC */
#define ADC123_CSR_AWD3_SLV_Pos         (25U)                                  
#define ADC123_CSR_AWD3_SLV_Msk         (0x1U << ADC123_CSR_AWD3_SLV_Pos)      /*!< 0x02000000 */
#define ADC123_CSR_AWD3_SLV             ADC123_CSR_AWD3_SLV_Msk                /*!< Analog watchdog 3 flag of the slave ADC */
#define ADC123_CSR_JQOVF_SLV_Pos        (26U)                                  
#define ADC123_CSR_JQOVF_SLV_Msk        (0x1U << ADC123_CSR_JQOVF_SLV_Pos)     /*!< 0x04000000 */
#define ADC123_CSR_JQOVF_SLV            ADC123_CSR_JQOVF_SLV_Msk               /*!< Injected context queue overflow flag of the slave ADC */

/********************  Bit definition for ADC_CCR register  ********************/
#define ADC_CCR_DUAL_Pos                  (0U)                                 
#define ADC_CCR_DUAL_Msk                  (0x1FU << ADC_CCR_DUAL_Pos)          /*!< 0x0000001F */
#define ADC_CCR_DUAL                      ADC_CCR_DUAL_Msk                     /*!< Dual ADC mode selection */
#define ADC_CCR_DUAL_0                    (0x01U << ADC_CCR_DUAL_Pos)          /*!< 0x00000001 */
#define ADC_CCR_DUAL_1                    (0x02U << ADC_CCR_DUAL_Pos)          /*!< 0x00000002 */
#define ADC_CCR_DUAL_2                    (0x04U << ADC_CCR_DUAL_Pos)          /*!< 0x00000004 */
#define ADC_CCR_DUAL_3                    (0x08U << ADC_CCR_DUAL_Pos)          /*!< 0x00000008 */
#define ADC_CCR_DUAL_4                    (0x10U << ADC_CCR_DUAL_Pos)          /*!< 0x00000010 */

#define ADC_CCR_DELAY_Pos                 (8U)                                 
#define ADC_CCR_DELAY_Msk                 (0xFU << ADC_CCR_DELAY_Pos)          /*!< 0x00000F00 */
#define ADC_CCR_DELAY                     ADC_CCR_DELAY_Msk                    /*!< Delay between 2 sampling phases */
#define ADC_CCR_DELAY_0                   (0x1U << ADC_CCR_DELAY_Pos)          /*!< 0x00000100 */
#define ADC_CCR_DELAY_1                   (0x2U << ADC_CCR_DELAY_Pos)          /*!< 0x00000200 */
#define ADC_CCR_DELAY_2                   (0x4U << ADC_CCR_DELAY_Pos)          /*!< 0x00000400 */
#define ADC_CCR_DELAY_3                   (0x8U << ADC_CCR_DELAY_Pos)          /*!< 0x00000800 */


