bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define ADC_CCR_DAMDF_Pos                 (14U)                                
#define ADC_CCR_DAMDF_Msk                 (0x3U << ADC_CCR_DAMDF_Pos)          /*!< 0x0000C000 */
#define ADC_CCR_DAMDF                     ADC_CCR_DAMDF_Msk                    /*!< Dual ADC mode Data format */
#define ADC_CCR_DAMDF_0                   (0x1U << ADC_CCR_DAMDF_Pos)          /*!< 0x00004000 */
#define ADC_CCR_DAMDF_1                   (0x2U << ADC_CCR_DAMDF_Pos)          /*!< 0x00008000 */

#define ADC_CCR_CKMODE_Pos                (16U)                                
#define ADC_CCR_CKMODE_Msk                (0x3U << ADC_CCR_CKMODE_Pos)         /*!< 0x00030000 */
#define ADC_CCR_CKMODE                    ADC_CCR_CKMODE_Msk                   /*!< ADC clock mode */
#define ADC_CCR_CKMODE_0                  (0x1U << ADC_CCR_CKMODE_Pos)         /*!< 0x00010000 */
#define ADC_CCR_CKMODE_1                  (0x2U << ADC_CCR_CKMODE_Pos)         /*!< 0x00020000 */

#define ADC_CCR_PRESC_Pos                 (18U)                                
#define ADC_CCR_PRESC_Msk                 (0xFU << ADC_CCR_PRESC_Pos)          /*!< 0x003C0000 */
#define ADC_CCR_PRESC                     ADC_CCR_PRESC_Msk                    /*!< ADC prescaler */
#define ADC_CCR_PRESC_0                   (0x1U << ADC_CCR_PRESC_Pos)          /*!< 0x00040000 */
#define ADC_CCR_PRESC_1                   (0x2U << ADC_CCR_PRESC_Pos)          /*!< 0x00080000 */
#define ADC_CCR_PRESC_2                   (0x4U << ADC_CCR_PRESC_Pos)          /*!< 0x00100000 */
#define ADC_CCR_PRESC_3                   (0x8U << ADC_CCR_PRESC_Pos)          /*!< 0x00200000 */

#define ADC_CCR_VREFEN_Pos                (22U)                                
#define ADC_CCR_VREFEN_Msk                (0x1U << ADC_CCR_VREFEN_Pos)         /*!< 0x00400000 */
#define ADC_CCR_VREFEN                    ADC_CCR_VREFEN_Msk                   /*!< VREFINT enable */
#define ADC_CCR_TSEN_Pos                  (23U)                                
#define ADC_CCR_TSEN_Msk                  (0x1U << ADC_CCR_TSEN_Pos)           /*!< 0x00800000 */
#define ADC_CCR_TSEN                      ADC_CCR_TSEN_Msk                     /*!< Temperature sensor enable */
#define ADC_CCR_VBATEN_Pos                (24U)                                
#define ADC_CCR_VBATEN_Msk                (0x1U << ADC_CCR_VBATEN_Pos)         /*!< 0x01000000 */
#define ADC_CCR_VBATEN                    ADC_CCR_VBATEN_Msk                   /*!< VBAT enable */

/********************  Bit definition for ADC_CDR register  ********************/
#define ADC123_CDR_RDATA_MST_Pos        (0U)                                   
#define ADC123_CDR_RDATA_MST_Msk        (0xFFFFU << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x0000FFFF */
#define ADC123_CDR_RDATA_MST            ADC123_CDR_RDATA_MST_Msk               /*!< Regular Data of the master ADC */
#define ADC123_CDR_RDATA_MST_0          (0x0001U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000001 */
#define ADC123_CDR_RDATA_MST_1          (0x0002U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000002 */
#define ADC123_CDR_RDATA_MST_2          (0x0004U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000004 */
#define ADC123_CDR_RDATA_MST_3          (0x0008U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000008 */
#define ADC123_CDR_RDATA_MST_4          (0x0010U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000010 */
#define ADC123_CDR_RDATA_MST_5          (0x0020U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000020 */
#define ADC123_CDR_RDATA_MST_6          (0x0040U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000040 */
#define ADC123_CDR_RDATA_MST_7          (0x0080U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000080 */
#define ADC123_CDR_RDATA_MST_8          (0x0100U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000100 */
#define ADC123_CDR_RDATA_MST_9          (0x0200U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000200 */
#define ADC123_CDR_RDATA_MST_10         (0x0400U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000400 */
#define ADC123_CDR_RDATA_MST_11         (0x0800U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00000800 */
#define ADC123_CDR_RDATA_MST_12         (0x1000U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00001000 */
#define ADC123_CDR_RDATA_MST_13         (0x2000U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00002000 */
#define ADC123_CDR_RDATA_MST_14         (0x4000U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00004000 */
#define ADC123_CDR_RDATA_MST_15         (0x8000U << ADC123_CDR_RDATA_MST_Pos)  /*!< 0x00008000 */

#define ADC123_CDR_RDATA_SLV_Pos        (16U)                                  
#define ADC123_CDR_RDATA_SLV_Msk        (0xFFFFU << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0xFFFF0000 */
#define ADC123_CDR_RDATA_SLV            ADC123_CDR_RDATA_SLV_Msk               /*!< Regular Data of the master ADC */
#define ADC123_CDR_RDATA_SLV_0          (0x0001U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00010000 */
#define ADC123_CDR_RDATA_SLV_1          (0x0002U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00020000 */
#define ADC123_CDR_RDATA_SLV_2          (0x0004U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00040000 */
#define ADC123_CDR_RDATA_SLV_3          (0x0008U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00080000 */
#define ADC123_CDR_RDATA_SLV_4          (0x0010U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00100000 */
#define ADC123_CDR_RDATA_SLV_5          (0x0020U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00200000 */
#define ADC123_CDR_RDATA_SLV_6          (0x0040U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00400000 */
#define ADC123_CDR_RDATA_SLV_7          (0x0080U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x00800000 */
#define ADC123_CDR_RDATA_SLV_8          (0x0100U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x01000000 */
#define ADC123_CDR_RDATA_SLV_9          (0x0200U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x02000000 */
#define ADC123_CDR_RDATA_SLV_10         (0x0400U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x04000000 */
#define ADC123_CDR_RDATA_SLV_11         (0x0800U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x08000000 */
#define ADC123_CDR_RDATA_SLV_12         (0x1000U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x10000000 */
#define ADC123_CDR_RDATA_SLV_13         (0x2000U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x20000000 */
#define ADC123_CDR_RDATA_SLV_14         (0x4000U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x40000000 */
#define ADC123_CDR_RDATA_SLV_15         (0x8000U << ADC123_CDR_RDATA_SLV_Pos)  /*!< 0x80000000 */

/********************  Bit definition for ADC_CDR2 register  ********************/
#define ADC123_CDR2_RDATA_ALT_Pos       (0U)                                   
#define ADC123_CDR2_RDATA_ALT_Msk       (0xFFFFFFFFU << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0xFFFFFFFF */
#define ADC123_CDR2_RDATA_ALT           ADC123_CDR2_RDATA_ALT_Msk              /*!< Regular Data for dual Mode */
#define ADC123_CDR2_RDATA_ALT_0         (0x00000001U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000001 */
#define ADC123_CDR2_RDATA_ALT_1         (0x00000002U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000002 */
#define ADC123_CDR2_RDATA_ALT_2         (0x00000004U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000004 */
#define ADC123_CDR2_RDATA_ALT_3         (0x00000008U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000008 */
#define ADC123_CDR2_RDATA_ALT_4         (0x00000010U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000010 */
#define ADC123_CDR2_RDATA_ALT_5         (0x00000020U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000020 */
#define ADC123_CDR2_RDATA_ALT_6         (0x00000040U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000040 */
#define ADC123_CDR2_RDATA_ALT_7         (0x00000080U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000080 */
#define ADC123_CDR2_RDATA_ALT_8         (0x00000100U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000100 */
#define ADC123_CDR2_RDATA_ALT_9         (0x00000200U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000200 */
#define ADC123_CDR2_RDATA_ALT_10        (0x00000400U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000400 */
#define ADC123_CDR2_RDATA_ALT_11        (0x00000800U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00000800 */
#define ADC123_CDR2_RDATA_ALT_12        (0x00001000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00001000 */
#define ADC123_CDR2_RDATA_ALT_13        (0x00002000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00002000 */
#define ADC123_CDR2_RDATA_ALT_14        (0x00004000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00004000 */
#define ADC123_CDR2_RDATA_ALT_15        (0x00008000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00008000 */
#define ADC123_CDR2_RDATA_ALT_16        (0x00010000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00010000 */
#define ADC123_CDR2_RDATA_ALT_17        (0x00020000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00020000 */
#define ADC123_CDR2_RDATA_ALT_18        (0x00040000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00040000 */
#define ADC123_CDR2_RDATA_ALT_19        (0x00080000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00080000 */
#define ADC123_CDR2_RDATA_ALT_20        (0x00100000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00100000 */
#define ADC123_CDR2_RDATA_ALT_21        (0x00200000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00200000 */
#define ADC123_CDR2_RDATA_ALT_22        (0x00400000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00400000 */
#define ADC123_CDR2_RDATA_ALT_23        (0x00800000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x00800000 */
#define ADC123_CDR2_RDATA_ALT_24        (0x01000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x01000000 */
#define ADC123_CDR2_RDATA_ALT_25        (0x02000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x02000000 */
#define ADC123_CDR2_RDATA_ALT_26        (0x04000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x04000000 */
#define ADC123_CDR2_RDATA_ALT_27        (0x08000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x08000000 */
#define ADC123_CDR2_RDATA_ALT_28        (0x10000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x10000000 */
#define ADC123_CDR2_RDATA_ALT_29        (0x20000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x20000000 */
#define ADC123_CDR2_RDATA_ALT_30        (0x40000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x40000000 */
#define ADC123_CDR2_RDATA_ALT_31        (0x80000000U << ADC123_CDR2_RDATA_ALT_Pos) /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                                   VREFBUF                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos        (0U)                                       
#define VREFBUF_CSR_ENVR_Msk        (0x1U << VREFBUF_CSR_ENVR_Pos)             /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR            VREFBUF_CSR_ENVR_Msk                       /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos         (1U)                                       
#define VREFBUF_CSR_HIZ_Msk         (0x1U << VREFBUF_CSR_HIZ_Pos)              /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ             VREFBUF_CSR_HIZ_Msk                        /*!<High impedance mode             */
#define VREFBUF_CSR_VRR_Pos         (3U)                                       
#define VREFBUF_CSR_VRR_Msk         (0x1U << VREFBUF_CSR_VRR_Pos)              /*!< 0x00000008 */
#define VREFBUF_CSR_VRR             VREFBUF_CSR_VRR_Msk                        /*!<Voltage reference buffer ready  */
#define VREFBUF_CSR_VRS_Pos         (4U)                                       
#define VREFBUF_CSR_VRS_Msk         (0x7U << VREFBUF_CSR_VRS_Pos)              /*!< 0x00000070 */
#define VREFBUF_CSR_VRS             VREFBUF_CSR_VRS_Msk                        /*!<Voltage reference scale         */

#define VREFBUF_CSR_VRS_OUT1        ((uint32_t)0x00000000)                     /*!<Voltage reference VREF_OUT1     */
#define VREFBUF_CSR_VRS_OUT2_Pos    (4U)                                       
#define VREFBUF_CSR_VRS_OUT2_Msk    (0x1U << VREFBUF_CSR_VRS_OUT2_Pos)         /*!< 0x00000010 */
#define VREFBUF_CSR_VRS_OUT2        VREFBUF_CSR_VRS_OUT2_Msk                   /*!<Voltage reference VREF_OUT2     */
#define VREFBUF_CSR_VRS_OUT3_Pos    (5U)                                       
#define VREFBUF_CSR_VRS_OUT3_Msk    (0x1U << VREFBUF_CSR_VRS_OUT3_Pos)         /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_OUT3        VREFBUF_CSR_VRS_OUT3_Msk                   /*!<Voltage reference VREF_OUT3     */
#define VREFBUF_CSR_VRS_OUT4_Pos    (4U)                                       
#define VREFBUF_CSR_VRS_OUT4_Msk    (0x3U << VREFBUF_CSR_VRS_OUT4_Pos)         /*!< 0x00000030 */
#define VREFBUF_CSR_VRS_OUT4        VREFBUF_CSR_VRS_OUT4_Msk                   /*!<Voltage reference VREF_OUT4     */

/*******************  Bit definition for VREFBUF_CCR register  ****************/
#define VREFBUF_CCR_TRIM_Pos        (0U)                                       
#define VREFBUF_CCR_TRIM_Msk        (0x3FU << VREFBUF_CCR_TRIM_Pos)            /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM            VREFBUF_CCR_TRIM_Msk                       /*!<TRIM[5:0] bits (Trimming code)  */


/******************************************************************************/
/*                                                                            */
/*                 Flexible Datarate Controller Area Network                  */
/*                                                                            */
/******************************************************************************/
/*!<FDCAN control and status registers */
/*****************  Bit definition for FDCAN_CREL register  *******************/
#define FDCAN_CREL_DAY_Pos        (0U)                                         
#define FDCAN_CREL_DAY_Msk        (0xFFU << FDCAN_CREL_DAY_Pos)                /*!< 0x000000FF */
#define FDCAN_CREL_DAY            FDCAN_CREL_DAY_Msk                           /*!<Timestamp Day                           */
#define FDCAN_CREL_MON_Pos        (8U)                                         
#define FDCAN_CREL_MON_Msk        (0xFFU << FDCAN_CREL_MON_Pos)                /*!< 0x0000FF00 */
#define FDCAN_CREL_MON            FDCAN_CREL_MON_Msk                           /*!<Timestamp Month                         */
#define FDCAN_CREL_YEAR_Pos       (16U)                                        
#define FDCAN_CREL_YEAR_Msk       (0xFU << FDCAN_CREL_YEAR_Pos)                /*!< 0x000F0000 */
#define FDCAN_CREL_YEAR           FDCAN_CREL_YEAR_Msk                          /*!<Timestamp Year                          */
#define FDCAN_CREL_SUBSTEP_Pos    (20U)                                        
#define FDCAN_CREL_SUBSTEP_Msk    (0xFU << FDCAN_CREL_SUBSTEP_Pos)             /*!< 0x00F00000 */
#define FDCAN_CREL_SUBSTEP        FDCAN_CREL_SUBSTEP_Msk                       /*!<Sub-step of Core release                */
#define FDCAN_CREL_STEP_Pos       (24U)                                        
#define FDCAN_CREL_STEP_Msk       (0xFU << FDCAN_CREL_STEP_Pos)                /*!< 0x0F000000 */
#define FDCAN_CREL_STEP           FDCAN_CREL_STEP_Msk                          /*!<Step of Core release                    */
#define FDCAN_CREL_REL_Pos        (28U)                                        
#define FDCAN_CREL_REL_Msk        (0xFU << FDCAN_CREL_REL_Pos)                 /*!< 0xF0000000 */
#define FDCAN_CREL_REL            FDCAN_CREL_REL_Msk                           /*!<Core release                            */

/*****************  Bit definition for FDCAN_ENDN register  *******************/
#define FDCAN_ENDN_ETV_Pos        (0U)                                         
#define FDCAN_ENDN_ETV_Msk        (0xFFFFFFFFU << FDCAN_ENDN_ETV_Pos)          /*!< 0xFFFFFFFF */
#define FDCAN_ENDN_ETV            FDCAN_ENDN_ETV_Msk                           /*!<Endiannes Test Value                    */

/*****************  Bit definition for FDCAN_DBTP register  *******************/
#define FDCAN_DBTP_DSJW_Pos       (0U)                                         
#define FDCAN_DBTP_DSJW_Msk       (0xFU << FDCAN_DBTP_DSJW_Pos)                /*!< 0x0000000F */
#define FDCAN_DBTP_DSJW           FDCAN_DBTP_DSJW_Msk                          /*!<Synchronization Jump Width              */
#define FDCAN_DBTP_DTSEG2_Pos     (4U)                                         
#define FDCAN_DBTP_DTSEG2_Msk     (0xFU << FDCAN_DBTP_DTSEG2_Pos)              /*!< 0x000000F0 */
#define FDCAN_DBTP_DTSEG2         FDCAN_DBTP_DTSEG2_Msk                        /*!<Data time segment after sample point    */
#define FDCAN_DBTP_DTSEG1_Pos     (8U)                                         
#define FDCAN_DBTP_DTSEG1_Msk     (0xFU << FDCAN_DBTP_DTSEG1_Pos)              /*!< 0x00000F00 */
#define FDCAN_DBTP_DTSEG1         FDCAN_DBTP_DTSEG1_Msk                        /*!<Data time segment before sample point   */
#define FDCAN_DBTP_DBRP_Pos       (16U)                                        
#define FDCAN_DBTP_DBRP_Msk       (0x1FU << FDCAN_DBTP_DBRP_Pos)               /*!< 0x001F0000 */
#define FDCAN_DBTP_DBRP           FDCAN_DBTP_DBRP_Msk                          /*!<Data BIt Rate Prescaler                 */
#define FDCAN_DBTP_TDC_Pos        (23U)                                        
#define FDCAN_DBTP_TDC_Msk        (0x1U << FDCAN_DBTP_TDC_Pos)                 /*!< 0x00800000 */
#define FDCAN_DBTP_TDC            FDCAN_DBTP_TDC_Msk                           /*!<Transceiver Delay Compensation          */

