bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/*******************  Bit definition for BDMA_IFCR register  *******************/
#define BDMA_IFCR_CGIF0_Pos     (0U)                                           
#define BDMA_IFCR_CGIF0_Msk     (0x1U << BDMA_IFCR_CGIF0_Pos)                  /*!< 0x00000001 */
#define BDMA_IFCR_CGIF0         BDMA_IFCR_CGIF0_Msk                            /*!< Channel 0 Global interrupt clearr */
#define BDMA_IFCR_CTCIF0_Pos    (1U)                                           
#define BDMA_IFCR_CTCIF0_Msk    (0x1U << BDMA_IFCR_CTCIF0_Pos)                 /*!< 0x00000002 */
#define BDMA_IFCR_CTCIF0        BDMA_IFCR_CTCIF0_Msk                           /*!< Channel 0 Transfer Complete clear */
#define BDMA_IFCR_CHTIF0_Pos    (2U)                                           
#define BDMA_IFCR_CHTIF0_Msk    (0x1U << BDMA_IFCR_CHTIF0_Pos)                 /*!< 0x00000004 */
#define BDMA_IFCR_CHTIF0        BDMA_IFCR_CHTIF0_Msk                           /*!< Channel 0 Half Transfer clear */
#define BDMA_IFCR_CTEIF0_Pos    (3U)                                           
#define BDMA_IFCR_CTEIF0_Msk    (0x1U << BDMA_IFCR_CTEIF0_Pos)                 /*!< 0x00000008 */
#define BDMA_IFCR_CTEIF0        BDMA_IFCR_CTEIF0_Msk                           /*!< Channel 0 Transfer Error clear */
#define BDMA_IFCR_CGIF1_Pos     (4U)                                           
#define BDMA_IFCR_CGIF1_Msk     (0x1U << BDMA_IFCR_CGIF1_Pos)                  /*!< 0x00000010 */
#define BDMA_IFCR_CGIF1         BDMA_IFCR_CGIF1_Msk                            /*!< Channel 1 Global interrupt clear */
#define BDMA_IFCR_CTCIF1_Pos    (5U)                                           
#define BDMA_IFCR_CTCIF1_Msk    (0x1U << BDMA_IFCR_CTCIF1_Pos)                 /*!< 0x00000020 */
#define BDMA_IFCR_CTCIF1        BDMA_IFCR_CTCIF1_Msk                           /*!< Channel 1 Transfer Complete clear */
#define BDMA_IFCR_CHTIF1_Pos    (6U)                                           
#define BDMA_IFCR_CHTIF1_Msk    (0x1U << BDMA_IFCR_CHTIF1_Pos)                 /*!< 0x00000040 */
#define BDMA_IFCR_CHTIF1        BDMA_IFCR_CHTIF1_Msk                           /*!< Channel 1 Half Transfer clear */
#define BDMA_IFCR_CTEIF1_Pos    (7U)                                           
#define BDMA_IFCR_CTEIF1_Msk    (0x1U << BDMA_IFCR_CTEIF1_Pos)                 /*!< 0x00000080 */
#define BDMA_IFCR_CTEIF1        BDMA_IFCR_CTEIF1_Msk                           /*!< Channel 1 Transfer Error clear */
#define BDMA_IFCR_CGIF2_Pos     (8U)                                           
#define BDMA_IFCR_CGIF2_Msk     (0x1U << BDMA_IFCR_CGIF2_Pos)                  /*!< 0x00000100 */
#define BDMA_IFCR_CGIF2         BDMA_IFCR_CGIF2_Msk                            /*!< Channel 2 Global interrupt clear */
#define BDMA_IFCR_CTCIF2_Pos    (9U)                                           
#define BDMA_IFCR_CTCIF2_Msk    (0x1U << BDMA_IFCR_CTCIF2_Pos)                 /*!< 0x00000200 */
#define BDMA_IFCR_CTCIF2        BDMA_IFCR_CTCIF2_Msk                           /*!< Channel 2 Transfer Complete clear */
#define BDMA_IFCR_CHTIF2_Pos    (10U)                                          
#define BDMA_IFCR_CHTIF2_Msk    (0x1U << BDMA_IFCR_CHTIF2_Pos)                 /*!< 0x00000400 */
#define BDMA_IFCR_CHTIF2        BDMA_IFCR_CHTIF2_Msk                           /*!< Channel 2 Half Transfer clear */
#define BDMA_IFCR_CTEIF2_Pos    (11U)                                          
#define BDMA_IFCR_CTEIF2_Msk    (0x1U << BDMA_IFCR_CTEIF2_Pos)                 /*!< 0x00000800 */
#define BDMA_IFCR_CTEIF2        BDMA_IFCR_CTEIF2_Msk                           /*!< Channel 2 Transfer Error clear */
#define BDMA_IFCR_CGIF3_Pos     (12U)                                          
#define BDMA_IFCR_CGIF3_Msk     (0x1U << BDMA_IFCR_CGIF3_Pos)                  /*!< 0x00001000 */
#define BDMA_IFCR_CGIF3         BDMA_IFCR_CGIF3_Msk                            /*!< Channel 3 Global interrupt clear */
#define BDMA_IFCR_CTCIF3_Pos    (13U)                                          
#define BDMA_IFCR_CTCIF3_Msk    (0x1U << BDMA_IFCR_CTCIF3_Pos)                 /*!< 0x00002000 */
#define BDMA_IFCR_CTCIF3        BDMA_IFCR_CTCIF3_Msk                           /*!< Channel 3 Transfer Complete clear */
#define BDMA_IFCR_CHTIF3_Pos    (14U)                                          
#define BDMA_IFCR_CHTIF3_Msk    (0x1U << BDMA_IFCR_CHTIF3_Pos)                 /*!< 0x00004000 */
#define BDMA_IFCR_CHTIF3        BDMA_IFCR_CHTIF3_Msk                           /*!< Channel 3 Half Transfer clear */
#define BDMA_IFCR_CTEIF3_Pos    (15U)                                          
#define BDMA_IFCR_CTEIF3_Msk    (0x1U << BDMA_IFCR_CTEIF3_Pos)                 /*!< 0x00008000 */
#define BDMA_IFCR_CTEIF3        BDMA_IFCR_CTEIF3_Msk                           /*!< Channel 3 Transfer Error clear */
#define BDMA_IFCR_CGIF4_Pos     (16U)                                          
#define BDMA_IFCR_CGIF4_Msk     (0x1U << BDMA_IFCR_CGIF4_Pos)                  /*!< 0x00010000 */
#define BDMA_IFCR_CGIF4         BDMA_IFCR_CGIF4_Msk                            /*!< Channel 4 Global interrupt clear */
#define BDMA_IFCR_CTCIF4_Pos    (17U)                                          
#define BDMA_IFCR_CTCIF4_Msk    (0x1U << BDMA_IFCR_CTCIF4_Pos)                 /*!< 0x00020000 */
#define BDMA_IFCR_CTCIF4        BDMA_IFCR_CTCIF4_Msk                           /*!< Channel 4 Transfer Complete clear */
#define BDMA_IFCR_CHTIF4_Pos    (18U)                                          
#define BDMA_IFCR_CHTIF4_Msk    (0x1U << BDMA_IFCR_CHTIF4_Pos)                 /*!< 0x00040000 */
#define BDMA_IFCR_CHTIF4        BDMA_IFCR_CHTIF4_Msk                           /*!< Channel 4 Half Transfer clear */
#define BDMA_IFCR_CTEIF4_Pos    (19U)                                          
#define BDMA_IFCR_CTEIF4_Msk    (0x1U << BDMA_IFCR_CTEIF4_Pos)                 /*!< 0x00080000 */
#define BDMA_IFCR_CTEIF4        BDMA_IFCR_CTEIF4_Msk                           /*!< Channel 4 Transfer Error clear */
#define BDMA_IFCR_CGIF5_Pos     (20U)                                          
#define BDMA_IFCR_CGIF5_Msk     (0x1U << BDMA_IFCR_CGIF5_Pos)                  /*!< 0x00100000 */
#define BDMA_IFCR_CGIF5         BDMA_IFCR_CGIF5_Msk                            /*!< Channel 5 Global interrupt clear */
#define BDMA_IFCR_CTCIF5_Pos    (21U)                                          
#define BDMA_IFCR_CTCIF5_Msk    (0x1U << BDMA_IFCR_CTCIF5_Pos)                 /*!< 0x00200000 */
#define BDMA_IFCR_CTCIF5        BDMA_IFCR_CTCIF5_Msk                           /*!< Channel 5 Transfer Complete clear */
#define BDMA_IFCR_CHTIF5_Pos    (22U)                                          
#define BDMA_IFCR_CHTIF5_Msk    (0x1U << BDMA_IFCR_CHTIF5_Pos)                 /*!< 0x00400000 */
#define BDMA_IFCR_CHTIF5        BDMA_IFCR_CHTIF5_Msk                           /*!< Channel 5 Half Transfer clear */
#define BDMA_IFCR_CTEIF5_Pos    (23U)                                          
#define BDMA_IFCR_CTEIF5_Msk    (0x1U << BDMA_IFCR_CTEIF5_Pos)                 /*!< 0x00800000 */
#define BDMA_IFCR_CTEIF5        BDMA_IFCR_CTEIF5_Msk                           /*!< Channel 5 Transfer Error clear */
#define BDMA_IFCR_CGIF6_Pos     (24U)                                          
#define BDMA_IFCR_CGIF6_Msk     (0x1U << BDMA_IFCR_CGIF6_Pos)                  /*!< 0x01000000 */
#define BDMA_IFCR_CGIF6         BDMA_IFCR_CGIF6_Msk                            /*!< Channel 6 Global interrupt clear */
#define BDMA_IFCR_CTCIF6_Pos    (25U)                                          
#define BDMA_IFCR_CTCIF6_Msk    (0x1U << BDMA_IFCR_CTCIF6_Pos)                 /*!< 0x02000000 */
#define BDMA_IFCR_CTCIF6        BDMA_IFCR_CTCIF6_Msk                           /*!< Channel 6 Transfer Complete clear */
#define BDMA_IFCR_CHTIF6_Pos    (26U)                                          
#define BDMA_IFCR_CHTIF6_Msk    (0x1U << BDMA_IFCR_CHTIF6_Pos)                 /*!< 0x04000000 */
#define BDMA_IFCR_CHTIF6        BDMA_IFCR_CHTIF6_Msk                           /*!< Channel 6 Half Transfer clear */
#define BDMA_IFCR_CTEIF6_Pos    (27U)                                          
#define BDMA_IFCR_CTEIF6_Msk    (0x1U << BDMA_IFCR_CTEIF6_Pos)                 /*!< 0x08000000 */
#define BDMA_IFCR_CTEIF6        BDMA_IFCR_CTEIF6_Msk                           /*!< Channel 6 Transfer Error clear */
#define BDMA_IFCR_CGIF7_Pos     (28U)                                          
#define BDMA_IFCR_CGIF7_Msk     (0x1U << BDMA_IFCR_CGIF7_Pos)                  /*!< 0x10000000 */
#define BDMA_IFCR_CGIF7         BDMA_IFCR_CGIF7_Msk                            /*!< Channel 7 Global interrupt clear */
#define BDMA_IFCR_CTCIF7_Pos    (29U)                                          
#define BDMA_IFCR_CTCIF7_Msk    (0x1U << BDMA_IFCR_CTCIF7_Pos)                 /*!< 0x20000000 */
#define BDMA_IFCR_CTCIF7        BDMA_IFCR_CTCIF7_Msk                           /*!< Channel 7 Transfer Complete clear */
#define BDMA_IFCR_CHTIF7_Pos    (30U)                                          
#define BDMA_IFCR_CHTIF7_Msk    (0x1U << BDMA_IFCR_CHTIF7_Pos)                 /*!< 0x40000000 */
#define BDMA_IFCR_CHTIF7        BDMA_IFCR_CHTIF7_Msk                           /*!< Channel 7 Half Transfer clear */
#define BDMA_IFCR_CTEIF7_Pos    (31U)                                          
#define BDMA_IFCR_CTEIF7_Msk    (0x1U << BDMA_IFCR_CTEIF7_Pos)                 /*!< 0x80000000 */
#define BDMA_IFCR_CTEIF7        BDMA_IFCR_CTEIF7_Msk                           /*!< Channel 7 Transfer Error clear */

/*******************  Bit definition for BDMA_CCR register  ********************/
#define BDMA_CCR_EN_Pos         (0U)                                           
#define BDMA_CCR_EN_Msk         (0x1U << BDMA_CCR_EN_Pos)                      /*!< 0x00000001 */
#define BDMA_CCR_EN             BDMA_CCR_EN_Msk                                /*!< Channel enable                      */
#define BDMA_CCR_TCIE_Pos       (1U)                                           
#define BDMA_CCR_TCIE_Msk       (0x1U << BDMA_CCR_TCIE_Pos)                    /*!< 0x00000002 */
#define BDMA_CCR_TCIE           BDMA_CCR_TCIE_Msk                              /*!< Transfer complete interrupt enable  */
#define BDMA_CCR_HTIE_Pos       (2U)                                           
#define BDMA_CCR_HTIE_Msk       (0x1U << BDMA_CCR_HTIE_Pos)                    /*!< 0x00000004 */
#define BDMA_CCR_HTIE           BDMA_CCR_HTIE_Msk                              /*!< Half Transfer interrupt enable      */
#define BDMA_CCR_TEIE_Pos       (3U)                                           
#define BDMA_CCR_TEIE_Msk       (0x1U << BDMA_CCR_TEIE_Pos)                    /*!< 0x00000008 */
#define BDMA_CCR_TEIE           BDMA_CCR_TEIE_Msk                              /*!< Transfer error interrupt enable     */
#define BDMA_CCR_DIR_Pos        (4U)                                           
#define BDMA_CCR_DIR_Msk        (0x1U << BDMA_CCR_DIR_Pos)                     /*!< 0x00000010 */
#define BDMA_CCR_DIR            BDMA_CCR_DIR_Msk                               /*!< Data transfer direction             */
#define BDMA_CCR_CIRC_Pos       (5U)                                           
#define BDMA_CCR_CIRC_Msk       (0x1U << BDMA_CCR_CIRC_Pos)                    /*!< 0x00000020 */
#define BDMA_CCR_CIRC           BDMA_CCR_CIRC_Msk                              /*!< Circular mode                       */
#define BDMA_CCR_PINC_Pos       (6U)                                           
#define BDMA_CCR_PINC_Msk       (0x1U << BDMA_CCR_PINC_Pos)                    /*!< 0x00000040 */
#define BDMA_CCR_PINC           BDMA_CCR_PINC_Msk                              /*!< Peripheral increment mode           */
#define BDMA_CCR_MINC_Pos       (7U)                                           
#define BDMA_CCR_MINC_Msk       (0x1U << BDMA_CCR_MINC_Pos)                    /*!< 0x00000080 */
#define BDMA_CCR_MINC           BDMA_CCR_MINC_Msk                              /*!< Memory increment mode               */

#define BDMA_CCR_PSIZE_Pos      (8U)                                           
#define BDMA_CCR_PSIZE_Msk      (0x3U << BDMA_CCR_PSIZE_Pos)                   /*!< 0x00000300 */
#define BDMA_CCR_PSIZE          BDMA_CCR_PSIZE_Msk                             /*!< PSIZE[1:0] bits (Peripheral size)   */
#define BDMA_CCR_PSIZE_0        (0x1U << BDMA_CCR_PSIZE_Pos)                   /*!< 0x00000100 */
#define BDMA_CCR_PSIZE_1        (0x2U << BDMA_CCR_PSIZE_Pos)                   /*!< 0x00000200 */

#define BDMA_CCR_MSIZE_Pos      (10U)                                          
#define BDMA_CCR_MSIZE_Msk      (0x3U << BDMA_CCR_MSIZE_Pos)                   /*!< 0x00000C00 */
#define BDMA_CCR_MSIZE          BDMA_CCR_MSIZE_Msk                             /*!< MSIZE[1:0] bits (Memory size)       */
#define BDMA_CCR_MSIZE_0        (0x1U << BDMA_CCR_MSIZE_Pos)                   /*!< 0x00000400 */
#define BDMA_CCR_MSIZE_1        (0x2U << BDMA_CCR_MSIZE_Pos)                   /*!< 0x00000800 */

