bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/******************  Bit definition for EXTI_SWIER2 register  ******************/
#define EXTI_SWIER2_SWIER49_Pos    (17U)                                       
#define EXTI_SWIER2_SWIER49_Msk    (0x1U << EXTI_SWIER2_SWIER49_Pos)           /*!< 0x00020000 */
#define EXTI_SWIER2_SWIER49        EXTI_SWIER2_SWIER49_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI_SWIER2_SWIER51_Pos    (19U)                                       
#define EXTI_SWIER2_SWIER51_Msk    (0x1U << EXTI_SWIER2_SWIER51_Pos)           /*!< 0x00080000 */
#define EXTI_SWIER2_SWIER51        EXTI_SWIER2_SWIER51_Msk                     /*!< Software Interrupt on line 51 */

/******************  Bit definition for EXTI_SWIER3 register  ******************/
#define EXTI_SWIER3_SWIER82_Pos    (18U)                                       
#define EXTI_SWIER3_SWIER82_Msk    (0x1U << EXTI_SWIER3_SWIER82_Pos)           /*!< 0x00040000 */
#define EXTI_SWIER3_SWIER82        EXTI_SWIER3_SWIER82_Msk                     /*!< Software Interrupt on line 82 */
#define EXTI_SWIER3_SWIER84_Pos    (20U)                                       
#define EXTI_SWIER3_SWIER84_Msk    (0x1U << EXTI_SWIER3_SWIER84_Pos)           /*!< 0x00100000 */
#define EXTI_SWIER3_SWIER84        EXTI_SWIER3_SWIER84_Msk                     /*!< Software Interrupt on line 84 */
#define EXTI_SWIER3_SWIER85_Pos    (21U)                                       
#define EXTI_SWIER3_SWIER85_Msk    (0x1U << EXTI_SWIER3_SWIER85_Pos)           /*!< 0x00200000 */
#define EXTI_SWIER3_SWIER85        EXTI_SWIER3_SWIER85_Msk                     /*!< Software Interrupt on line 85 */
#define EXTI_SWIER3_SWIER86_Pos    (22U)                                       
#define EXTI_SWIER3_SWIER86_Msk    (0x1U << EXTI_SWIER3_SWIER86_Pos)           /*!< 0x00400000 */
#define EXTI_SWIER3_SWIER86        EXTI_SWIER3_SWIER86_Msk                     /*!< Software Interrupt on line 86 */

/******************  Bit definition for EXTI_D3PMR1 register  ******************/
#define EXTI_D3PMR1_MR0_Pos        (0U)                                        
#define EXTI_D3PMR1_MR0_Msk        (0x1U << EXTI_D3PMR1_MR0_Pos)               /*!< 0x00000001 */
#define EXTI_D3PMR1_MR0            EXTI_D3PMR1_MR0_Msk                         /*!< Pending Mask Event for line 0  */
#define EXTI_D3PMR1_MR1_Pos        (1U)                                        
#define EXTI_D3PMR1_MR1_Msk        (0x1U << EXTI_D3PMR1_MR1_Pos)               /*!< 0x00000002 */
#define EXTI_D3PMR1_MR1            EXTI_D3PMR1_MR1_Msk                         /*!< Pending Mask Event for line 1  */
#define EXTI_D3PMR1_MR2_Pos        (2U)                                        
#define EXTI_D3PMR1_MR2_Msk        (0x1U << EXTI_D3PMR1_MR2_Pos)               /*!< 0x00000004 */
#define EXTI_D3PMR1_MR2            EXTI_D3PMR1_MR2_Msk                         /*!< Pending Mask Event for line 2  */
#define EXTI_D3PMR1_MR3_Pos        (3U)                                        
#define EXTI_D3PMR1_MR3_Msk        (0x1U << EXTI_D3PMR1_MR3_Pos)               /*!< 0x00000008 */
#define EXTI_D3PMR1_MR3            EXTI_D3PMR1_MR3_Msk                         /*!< Pending Mask Event for line 3  */
#define EXTI_D3PMR1_MR4_Pos        (4U)                                        
#define EXTI_D3PMR1_MR4_Msk        (0x1U << EXTI_D3PMR1_MR4_Pos)               /*!< 0x00000010 */
#define EXTI_D3PMR1_MR4            EXTI_D3PMR1_MR4_Msk                         /*!< Pending Mask Event for line 4  */
#define EXTI_D3PMR1_MR5_Pos        (5U)                                        
#define EXTI_D3PMR1_MR5_Msk        (0x1U << EXTI_D3PMR1_MR5_Pos)               /*!< 0x00000020 */
#define EXTI_D3PMR1_MR5            EXTI_D3PMR1_MR5_Msk                         /*!< Pending Mask Event for line 5  */
#define EXTI_D3PMR1_MR6_Pos        (6U)                                        
#define EXTI_D3PMR1_MR6_Msk        (0x1U << EXTI_D3PMR1_MR6_Pos)               /*!< 0x00000040 */
#define EXTI_D3PMR1_MR6            EXTI_D3PMR1_MR6_Msk                         /*!< Pending Mask Event for line 6  */
#define EXTI_D3PMR1_MR7_Pos        (7U)                                        
#define EXTI_D3PMR1_MR7_Msk        (0x1U << EXTI_D3PMR1_MR7_Pos)               /*!< 0x00000080 */
#define EXTI_D3PMR1_MR7            EXTI_D3PMR1_MR7_Msk                         /*!< Pending Mask Event for line 7  */
#define EXTI_D3PMR1_MR8_Pos        (8U)                                        
#define EXTI_D3PMR1_MR8_Msk        (0x1U << EXTI_D3PMR1_MR8_Pos)               /*!< 0x00000100 */
#define EXTI_D3PMR1_MR8            EXTI_D3PMR1_MR8_Msk                         /*!< Pending Mask Event for line 8  */
#define EXTI_D3PMR1_MR9_Pos        (9U)                                        
#define EXTI_D3PMR1_MR9_Msk        (0x1U << EXTI_D3PMR1_MR9_Pos)               /*!< 0x00000200 */
#define EXTI_D3PMR1_MR9            EXTI_D3PMR1_MR9_Msk                         /*!< Pending Mask Event for line 9  */
#define EXTI_D3PMR1_MR10_Pos       (10U)                                       
#define EXTI_D3PMR1_MR10_Msk       (0x1U << EXTI_D3PMR1_MR10_Pos)              /*!< 0x00000400 */
#define EXTI_D3PMR1_MR10           EXTI_D3PMR1_MR10_Msk                        /*!< Pending Mask Event for line 10 */
#define EXTI_D3PMR1_MR11_Pos       (11U)                                       
#define EXTI_D3PMR1_MR11_Msk       (0x1U << EXTI_D3PMR1_MR11_Pos)              /*!< 0x00000800 */
#define EXTI_D3PMR1_MR11           EXTI_D3PMR1_MR11_Msk                        /*!< Pending Mask Event for line 11 */
#define EXTI_D3PMR1_MR12_Pos       (12U)                                       
#define EXTI_D3PMR1_MR12_Msk       (0x1U << EXTI_D3PMR1_MR12_Pos)              /*!< 0x00001000 */
#define EXTI_D3PMR1_MR12           EXTI_D3PMR1_MR12_Msk                        /*!< Pending Mask Event for line 12 */
#define EXTI_D3PMR1_MR13_Pos       (13U)                                       
#define EXTI_D3PMR1_MR13_Msk       (0x1U << EXTI_D3PMR1_MR13_Pos)              /*!< 0x00002000 */
#define EXTI_D3PMR1_MR13           EXTI_D3PMR1_MR13_Msk                        /*!< Pending Mask Event for line 13 */
#define EXTI_D3PMR1_MR14_Pos       (14U)                                       
#define EXTI_D3PMR1_MR14_Msk       (0x1U << EXTI_D3PMR1_MR14_Pos)              /*!< 0x00004000 */
#define EXTI_D3PMR1_MR14           EXTI_D3PMR1_MR14_Msk                        /*!< Pending Mask Event for line 14 */
#define EXTI_D3PMR1_MR15_Pos       (15U)                                       
#define EXTI_D3PMR1_MR15_Msk       (0x1U << EXTI_D3PMR1_MR15_Pos)              /*!< 0x00008000 */
#define EXTI_D3PMR1_MR15           EXTI_D3PMR1_MR15_Msk                        /*!< Pending Mask Event for line 15 */
#define EXTI_D3PMR1_MR19_Pos       (19U)                                       
#define EXTI_D3PMR1_MR19_Msk       (0x1U << EXTI_D3PMR1_MR19_Pos)              /*!< 0x00080000 */
#define EXTI_D3PMR1_MR19           EXTI_D3PMR1_MR19_Msk                        /*!< Pending Mask Event for line 19 */
#define EXTI_D3PMR1_MR20_Pos       (20U)                                       
#define EXTI_D3PMR1_MR20_Msk       (0x1U << EXTI_D3PMR1_MR20_Pos)              /*!< 0x00100000 */
#define EXTI_D3PMR1_MR20           EXTI_D3PMR1_MR20_Msk                        /*!< Pending Mask Event for line 20 */
#define EXTI_D3PMR1_MR21_Pos       (21U)                                       
#define EXTI_D3PMR1_MR21_Msk       (0x1U << EXTI_D3PMR1_MR21_Pos)              /*!< 0x00200000 */
#define EXTI_D3PMR1_MR21           EXTI_D3PMR1_MR21_Msk                        /*!< Pending Mask Event for line 21 */
#define EXTI_D3PMR1_MR25_Pos       (24U)                                       
#define EXTI_D3PMR1_MR25_Msk       (0x1U << EXTI_D3PMR1_MR25_Pos)              /*!< 0x01000000 */
#define EXTI_D3PMR1_MR25           EXTI_D3PMR1_MR25_Msk                        /*!< Pending Mask Event for line 25 */

/******************  Bit definition for EXTI_D3PMR2 register  ******************/
#define EXTI_D3PMR2_MR34_Pos       (2U)                                        
#define EXTI_D3PMR2_MR34_Msk       (0x1U << EXTI_D3PMR2_MR34_Pos)              /*!< 0x00000004 */
#define EXTI_D3PMR2_MR34           EXTI_D3PMR2_MR34_Msk                        /*!< Pending Mask Event for line 34  */
#define EXTI_D3PMR2_MR35_Pos       (3U)                                        
#define EXTI_D3PMR2_MR35_Msk       (0x1U << EXTI_D3PMR2_MR35_Pos)              /*!< 0x00000008 */
#define EXTI_D3PMR2_MR35           EXTI_D3PMR2_MR35_Msk                        /*!< Pending Mask Event for line 35  */
#define EXTI_D3PMR2_MR41_Pos       (9U)                                        
#define EXTI_D3PMR2_MR41_Msk       (0x1U << EXTI_D3PMR2_MR41_Pos)              /*!< 0x00000200 */
#define EXTI_D3PMR2_MR41           EXTI_D3PMR2_MR41_Msk                        /*!< Pending Mask Event for line 41  */
#define EXTI_D3PMR2_MR48_Pos       (16U)                                       
#define EXTI_D3PMR2_MR48_Msk       (0x1U << EXTI_D3PMR2_MR48_Pos)              /*!< 0x00010000 */
#define EXTI_D3PMR2_MR48           EXTI_D3PMR2_MR48_Msk                        /*!< Pending Mask Event for line 48  */
#define EXTI_D3PMR2_MR49_Pos       (17U)                                       
#define EXTI_D3PMR2_MR49_Msk       (0x1U << EXTI_D3PMR2_MR49_Pos)              /*!< 0x00020000 */
#define EXTI_D3PMR2_MR49           EXTI_D3PMR2_MR49_Msk                        /*!< Pending Mask Event for line 49  */
#define EXTI_D3PMR2_MR50_Pos       (18U)                                       
#define EXTI_D3PMR2_MR50_Msk       (0x1U << EXTI_D3PMR2_MR50_Pos)              /*!< 0x00040000 */
#define EXTI_D3PMR2_MR50           EXTI_D3PMR2_MR50_Msk                        /*!< Pending Mask Event for line 50  */
#define EXTI_D3PMR2_MR51_Pos       (19U)                                       
#define EXTI_D3PMR2_MR51_Msk       (0x1U << EXTI_D3PMR2_MR51_Pos)              /*!< 0x00080000 */
#define EXTI_D3PMR2_MR51           EXTI_D3PMR2_MR51_Msk                        /*!< Pending Mask Event for line 51  */
#define EXTI_D3PMR2_MR52_Pos       (20U)                                       
#define EXTI_D3PMR2_MR52_Msk       (0x1U << EXTI_D3PMR2_MR52_Pos)              /*!< 0x00100000 */
#define EXTI_D3PMR2_MR52           EXTI_D3PMR2_MR52_Msk                        /*!< Pending Mask Event for line 52  */
#define EXTI_D3PMR2_MR53_Pos       (21U)                                       
#define EXTI_D3PMR2_MR53_Msk       (0x1U << EXTI_D3PMR2_MR53_Pos)              /*!< 0x00200000 */
#define EXTI_D3PMR2_MR53           EXTI_D3PMR2_MR53_Msk                        /*!< Pending Mask Event for line 53  */

