bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/*******************  Bits definition for FLASH_ACR register  **********************/
#define FLASH_ACR_LATENCY_Pos                (0U)                              
#define FLASH_ACR_LATENCY_Msk                (0x7U << FLASH_ACR_LATENCY_Pos)   /*!< 0x00000007 */
#define FLASH_ACR_LATENCY                    FLASH_ACR_LATENCY_Msk             
#define FLASH_ACR_LATENCY_0WS                ((uint32_t)0x00000000)            
#define FLASH_ACR_LATENCY_1WS                ((uint32_t)0x00000001)            
#define FLASH_ACR_LATENCY_2WS                ((uint32_t)0x00000002)            
#define FLASH_ACR_LATENCY_3WS                ((uint32_t)0x00000003)            
#define FLASH_ACR_LATENCY_4WS                ((uint32_t)0x00000004)            
#define FLASH_ACR_LATENCY_5WS                ((uint32_t)0x00000005)            
#define FLASH_ACR_LATENCY_6WS                ((uint32_t)0x00000006)            
#define FLASH_ACR_LATENCY_7WS                ((uint32_t)0x00000007)            
#define FLASH_ACR_WRHIGHFREQ_Pos             (4U)                              
#define FLASH_ACR_WRHIGHFREQ_Msk             (0x3U << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000030 */
#define FLASH_ACR_WRHIGHFREQ                 FLASH_ACR_WRHIGHFREQ_Msk          
#define FLASH_ACR_WRHIGHFREQ_0               (0x0U << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000000 */
#define FLASH_ACR_WRHIGHFREQ_1               (0x1U << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000010 */
#define FLASH_ACR_WRHIGHFREQ_2               (0x2U << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000020 */
#define FLASH_ACR_WRHIGHFREQ_3               (0x3U << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000030 */

/*******************  Bits definition for FLASH_CR register  ***********************/
#define FLASH_CR_LOCK_Pos                    (0U)                              
#define FLASH_CR_LOCK_Msk                    (0x1U << FLASH_CR_LOCK_Pos)       /*!< 0x00000001 */
#define FLASH_CR_LOCK                        FLASH_CR_LOCK_Msk                 
#define FLASH_CR_PG_Pos                      (1U)                              
#define FLASH_CR_PG_Msk                      (0x1U << FLASH_CR_PG_Pos)         /*!< 0x00000002 */
#define FLASH_CR_PG                          FLASH_CR_PG_Msk                   
#define FLASH_CR_SER_Pos                     (2U)                              
#define FLASH_CR_SER_Msk                     (0x1U << FLASH_CR_SER_Pos)        /*!< 0x00000004 */
#define FLASH_CR_SER                         FLASH_CR_SER_Msk                  
#define FLASH_CR_BER_Pos                     (3U)                              
#define FLASH_CR_BER_Msk                     (0x1U << FLASH_CR_BER_Pos)        /*!< 0x00000008 */
#define FLASH_CR_BER                         FLASH_CR_BER_Msk                  

#define FLASH_CR_PSIZE_Pos                   (4U)                              
#define FLASH_CR_PSIZE_Msk                   (0x3U << FLASH_CR_PSIZE_Pos)      /*!< 0x00000030 */
#define FLASH_CR_PSIZE                       FLASH_CR_PSIZE_Msk                
#define FLASH_CR_PSIZE_0                     (0x1U << FLASH_CR_PSIZE_Pos)      /*!< 0x00000010 */
#define FLASH_CR_PSIZE_1                     (0x2U << FLASH_CR_PSIZE_Pos)      /*!< 0x00000020 */
#define FLASH_CR_FW_Pos                      (6U)                              
#define FLASH_CR_FW_Msk                      (0x1U << FLASH_CR_FW_Pos)         /*!< 0x00000040 */
#define FLASH_CR_FW                          FLASH_CR_FW_Msk                   
#define FLASH_CR_START_Pos                   (7U)                              
#define FLASH_CR_START_Msk                   (0x1U << FLASH_CR_START_Pos)      /*!< 0x00000080 */
#define FLASH_CR_START                       FLASH_CR_START_Msk                

#define FLASH_CR_SNB_Pos                     (8U)                              
#define FLASH_CR_SNB_Msk                     (0x7U << FLASH_CR_SNB_Pos)        /*!< 0x00000700 */
#define FLASH_CR_SNB                         FLASH_CR_SNB_Msk                  
#define FLASH_CR_SNB_0                       (0x0U << FLASH_CR_SNB_Pos)        /*!< 0x00000000 */
#define FLASH_CR_SNB_1                       (0x1U << FLASH_CR_SNB_Pos)        /*!< 0x00000100 */
#define FLASH_CR_SNB_2                       (0x2U << FLASH_CR_SNB_Pos)        /*!< 0x00000200 */
#define FLASH_CR_SNB_3                       (0x3U << FLASH_CR_SNB_Pos)        /*!< 0x00000300 */
#define FLASH_CR_SNB_4                       (0x4U << FLASH_CR_SNB_Pos)        /*!< 0x00000400 */
#define FLASH_CR_SNB_5                       (0x5U << FLASH_CR_SNB_Pos)        /*!< 0x00000500 */
#define FLASH_CR_SNB_6                       (0x6U << FLASH_CR_SNB_Pos)        /*!< 0x00000600 */
#define FLASH_CR_SNB_7                       (0x7U << FLASH_CR_SNB_Pos)        /*!< 0x00000700 */

#define FLASH_CR_CRC_EN_Pos                  (15U)                             
#define FLASH_CR_CRC_EN_Msk                  (0x1U << FLASH_CR_CRC_EN_Pos)     /*!< 0x00008000 */
#define FLASH_CR_CRC_EN                      FLASH_CR_CRC_EN_Msk               

#define FLASH_CR_EOPIE_Pos                   (16U)                             
#define FLASH_CR_EOPIE_Msk                   (0x1U << FLASH_CR_EOPIE_Pos)      /*!< 0x00010000 */
#define FLASH_CR_EOPIE                       FLASH_CR_EOPIE_Msk                
#define FLASH_CR_WRPERRIE_Pos                (17U)                             
#define FLASH_CR_WRPERRIE_Msk                (0x1U << FLASH_CR_WRPERRIE_Pos)   /*!< 0x00020000 */
#define FLASH_CR_WRPERRIE                    FLASH_CR_WRPERRIE_Msk             
#define FLASH_CR_PGSERRIE_Pos                (18U)                             
#define FLASH_CR_PGSERRIE_Msk                (0x1U << FLASH_CR_PGSERRIE_Pos)   /*!< 0x00040000 */
#define FLASH_CR_PGSERRIE                    FLASH_CR_PGSERRIE_Msk             
#define FLASH_CR_STRBERRIE_Pos               (19U)                             
#define FLASH_CR_STRBERRIE_Msk               (0x1U << FLASH_CR_STRBERRIE_Pos)  /*!< 0x00080000 */
#define FLASH_CR_STRBERRIE                   FLASH_CR_STRBERRIE_Msk            
#define FLASH_CR_INCERRIE_Pos                (21U)                             
#define FLASH_CR_INCERRIE_Msk                (0x1U << FLASH_CR_INCERRIE_Pos)   /*!< 0x00200000 */
#define FLASH_CR_INCERRIE                    FLASH_CR_INCERRIE_Msk             
#define FLASH_CR_OPERRIE_Pos                 (22U)                             
#define FLASH_CR_OPERRIE_Msk                 (0x1U << FLASH_CR_OPERRIE_Pos)    /*!< 0x00400000 */
#define FLASH_CR_OPERRIE                     FLASH_CR_OPERRIE_Msk              
#define FLASH_CR_RDPERRIE_Pos                (23U)                             
#define FLASH_CR_RDPERRIE_Msk                (0x1U << FLASH_CR_RDPERRIE_Pos)   /*!< 0x00800000 */
#define FLASH_CR_RDPERRIE                    FLASH_CR_RDPERRIE_Msk             
#define FLASH_CR_RDSERRIE_Pos                (24U)                             
#define FLASH_CR_RDSERRIE_Msk                (0x1U << FLASH_CR_RDSERRIE_Pos)   /*!< 0x01000000 */
#define FLASH_CR_RDSERRIE                    FLASH_CR_RDSERRIE_Msk             

