bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define FLASH_CR_SNECCERRIE_Pos              (25U)                             
#define FLASH_CR_SNECCERRIE_Msk              (0x1U << FLASH_CR_SNECCERRIE_Pos) /*!< 0x02000000 */
#define FLASH_CR_SNECCERRIE                  FLASH_CR_SNECCERRIE_Msk           
#define FLASH_CR_DBECCERRIE_Pos              (26U)                             
#define FLASH_CR_DBECCERRIE_Msk              (0x1U << FLASH_CR_DBECCERRIE_Pos) /*!< 0x04000000 */
#define FLASH_CR_DBECCERRIE                  FLASH_CR_DBECCERRIE_Msk           

#define FLASH_CR_CRCENDIE_Pos                (27U)                             
#define FLASH_CR_CRCENDIE_Msk                (0x1U << FLASH_CR_CRCENDIE_Pos)   /*!< 0x08000000 */
#define FLASH_CR_CRCENDIE                    FLASH_CR_CRCENDIE_Msk             

/*******************  Bits definition for FLASH_SR register  ***********************/
#define FLASH_SR_BSY_Pos                     (0U)                              
#define FLASH_SR_BSY_Msk                     (0x1U << FLASH_SR_BSY_Pos)        /*!< 0x00000001 */
#define FLASH_SR_BSY                         FLASH_SR_BSY_Msk                  
#define FLASH_SR_WBNE_Pos                    (1U)                              
#define FLASH_SR_WBNE_Msk                    (0x1U << FLASH_SR_WBNE_Pos)       /*!< 0x00000002 */
#define FLASH_SR_WBNE                        FLASH_SR_WBNE_Msk                 
#define FLASH_SR_QW_Pos                      (2U)                              
#define FLASH_SR_QW_Msk                      (0x1U << FLASH_SR_QW_Pos)         /*!< 0x00000004 */
#define FLASH_SR_QW                          FLASH_SR_QW_Msk                   

#define FLASH_SR_CRC_BUSY_Pos                (3U)                              
#define FLASH_SR_CRC_BUSY_Msk                (0x1U << FLASH_SR_CRC_BUSY_Pos)   /*!< 0x00000008 */
#define FLASH_SR_CRC_BUSY                    FLASH_SR_CRC_BUSY_Msk             

#define FLASH_SR_EOP_Pos                     (16U)                             
#define FLASH_SR_EOP_Msk                     (0x1U << FLASH_SR_EOP_Pos)        /*!< 0x00010000 */
#define FLASH_SR_EOP                         FLASH_SR_EOP_Msk                  
#define FLASH_SR_WRPERR_Pos                  (17U)                             
#define FLASH_SR_WRPERR_Msk                  (0x1U << FLASH_SR_WRPERR_Pos)     /*!< 0x00020000 */
#define FLASH_SR_WRPERR                      FLASH_SR_WRPERR_Msk               
#define FLASH_SR_PGSERR_Pos                  (18U)                             
#define FLASH_SR_PGSERR_Msk                  (0x1U << FLASH_SR_PGSERR_Pos)     /*!< 0x00040000 */
#define FLASH_SR_PGSERR                      FLASH_SR_PGSERR_Msk               
#define FLASH_SR_STRBERR_Pos                 (19U)                             
#define FLASH_SR_STRBERR_Msk                 (0x1U << FLASH_SR_STRBERR_Pos)    /*!< 0x00080000 */
#define FLASH_SR_STRBERR                     FLASH_SR_STRBERR_Msk              
#define FLASH_SR_INCERR_Pos                  (21U)                             
#define FLASH_SR_INCERR_Msk                  (0x1U << FLASH_SR_INCERR_Pos)     /*!< 0x00200000 */
#define FLASH_SR_INCERR                      FLASH_SR_INCERR_Msk               
#define FLASH_SR_OPERR_Pos                   (22U)                             
#define FLASH_SR_OPERR_Msk                   (0x1U << FLASH_SR_OPERR_Pos)      /*!< 0x00400000 */
#define FLASH_SR_OPERR                       FLASH_SR_OPERR_Msk                

#define FLASH_SR_RDPERR_Pos                  (23U)                             
#define FLASH_SR_RDPERR_Msk                  (0x1U << FLASH_SR_RDPERR_Pos)     /*!< 0x00800000 */
#define FLASH_SR_RDPERR                      FLASH_SR_RDPERR_Msk               
#define FLASH_SR_RDSERR_Pos                  (24U)                             
#define FLASH_SR_RDSERR_Msk                  (0x1U << FLASH_SR_RDSERR_Pos)     /*!< 0x01000000 */
#define FLASH_SR_RDSERR                      FLASH_SR_RDSERR_Msk               

#define FLASH_SR_SNECCERR_Pos                (25U)                             
#define FLASH_SR_SNECCERR_Msk                (0x1U << FLASH_SR_SNECCERR_Pos)   /*!< 0x02000000 */
#define FLASH_SR_SNECCERR                    FLASH_SR_SNECCERR_Msk             
#define FLASH_SR_DBECCERR_Pos                (26U)                             
#define FLASH_SR_DBECCERR_Msk                (0x1U << FLASH_SR_DBECCERR_Pos)   /*!< 0x04000000 */
#define FLASH_SR_DBECCERR                    FLASH_SR_DBECCERR_Msk             

#define FLASH_SR_CRCEND_Pos                  (27U)                             
#define FLASH_SR_CRCEND_Msk                  (0x1U << FLASH_SR_CRCEND_Pos)     /*!< 0x08000000 */
#define FLASH_SR_CRCEND                      FLASH_SR_CRCEND_Msk               

/*******************  Bits definition for FLASH_CCR register  *******************/
#define FLASH_CCR_CLR_EOP_Pos                (16U)                             
#define FLASH_CCR_CLR_EOP_Msk                (0x1U << FLASH_CCR_CLR_EOP_Pos)   /*!< 0x00010000 */
#define FLASH_CCR_CLR_EOP                    FLASH_CCR_CLR_EOP_Msk             
#define FLASH_CCR_CLR_WRPERR_Pos             (17U)                             
#define FLASH_CCR_CLR_WRPERR_Msk             (0x1U << FLASH_CCR_CLR_WRPERR_Pos) /*!< 0x00020000 */
#define FLASH_CCR_CLR_WRPERR                 FLASH_CCR_CLR_WRPERR_Msk          
#define FLASH_CCR_CLR_PGSERR_Pos             (18U)                             
#define FLASH_CCR_CLR_PGSERR_Msk             (0x1U << FLASH_CCR_CLR_PGSERR_Pos) /*!< 0x00040000 */
#define FLASH_CCR_CLR_PGSERR                 FLASH_CCR_CLR_PGSERR_Msk          
#define FLASH_CCR_CLR_STRBERR_Pos            (19U)                             
#define FLASH_CCR_CLR_STRBERR_Msk            (0x1U << FLASH_CCR_CLR_STRBERR_Pos) /*!< 0x00080000 */
#define FLASH_CCR_CLR_STRBERR                FLASH_CCR_CLR_STRBERR_Msk         
#define FLASH_CCR_CLR_INCERR_Pos             (21U)                             
#define FLASH_CCR_CLR_INCERR_Msk             (0x1U << FLASH_CCR_CLR_INCERR_Pos) /*!< 0x00200000 */
#define FLASH_CCR_CLR_INCERR                 FLASH_CCR_CLR_INCERR_Msk          
#define FLASH_CCR_CLR_OPERR_Pos              (22U)                             
#define FLASH_CCR_CLR_OPERR_Msk              (0x1U << FLASH_CCR_CLR_OPERR_Pos) /*!< 0x00400000 */
#define FLASH_CCR_CLR_OPERR                  FLASH_CCR_CLR_OPERR_Msk           

