bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define FLASH_CCR_CLR_RDPERR_Pos             (23U)                             
#define FLASH_CCR_CLR_RDPERR_Msk             (0x1U << FLASH_CCR_CLR_RDPERR_Pos) /*!< 0x00800000 */
#define FLASH_CCR_CLR_RDPERR                 FLASH_CCR_CLR_RDPERR_Msk          
#define FLASH_CCR_CLR_RDSERR_Pos             (24U)                             
#define FLASH_CCR_CLR_RDSERR_Msk             (0x1U << FLASH_CCR_CLR_RDSERR_Pos) /*!< 0x01000000 */
#define FLASH_CCR_CLR_RDSERR                 FLASH_CCR_CLR_RDSERR_Msk          

#define FLASH_CCR_CLR_SNECCERR_Pos           (25U)                             
#define FLASH_CCR_CLR_SNECCERR_Msk           (0x1U << FLASH_CCR_CLR_SNECCERR_Pos) /*!< 0x02000000 */
#define FLASH_CCR_CLR_SNECCERR               FLASH_CCR_CLR_SNECCERR_Msk        
#define FLASH_CCR_CLR_DBECCERR_Pos           (26U)                             
#define FLASH_CCR_CLR_DBECCERR_Msk           (0x1U << FLASH_CCR_CLR_DBECCERR_Pos) /*!< 0x04000000 */
#define FLASH_CCR_CLR_DBECCERR               FLASH_CCR_CLR_DBECCERR_Msk        

#define FLASH_CCR_CLR_CRCEND_Pos             (27U)                             
#define FLASH_CCR_CLR_CRCEND_Msk             (0x1U << FLASH_CCR_CLR_CRCEND_Pos) /*!< 0x08000000 */
#define FLASH_CCR_CLR_CRCEND                 FLASH_CCR_CLR_CRCEND_Msk          

/*******************  Bits definition for FLASH_OPTCR register  *******************/
#define FLASH_OPTCR_OPTLOCK_Pos              (0U)                              
#define FLASH_OPTCR_OPTLOCK_Msk              (0x1U << FLASH_OPTCR_OPTLOCK_Pos) /*!< 0x00000001 */
#define FLASH_OPTCR_OPTLOCK                  FLASH_OPTCR_OPTLOCK_Msk           
#define FLASH_OPTCR_OPTSTART_Pos             (1U)                              
#define FLASH_OPTCR_OPTSTART_Msk             (0x1U << FLASH_OPTCR_OPTSTART_Pos) /*!< 0x00000002 */
#define FLASH_OPTCR_OPTSTART                 FLASH_OPTCR_OPTSTART_Msk          
#define FLASH_OPTCR_MER_Pos                  (3U)                              
#define FLASH_OPTCR_MER_Msk                  (0x1U << FLASH_OPTCR_MER_Pos)     /*!< 0x00000008 */
#define FLASH_OPTCR_MER                      FLASH_OPTCR_MER_Msk               
#define FLASH_OPTCR_OPTCHANGEERRIE_Pos       (30U)                             
#define FLASH_OPTCR_OPTCHANGEERRIE_Msk       (0x1U << FLASH_OPTCR_OPTCHANGEERRIE_Pos) /*!< 0x40000000 */
#define FLASH_OPTCR_OPTCHANGEERRIE           FLASH_OPTCR_OPTCHANGEERRIE_Msk    
#define FLASH_OPTCR_SWAP_BANK_Pos            (31U)                             
#define FLASH_OPTCR_SWAP_BANK_Msk            (0x1U << FLASH_OPTCR_SWAP_BANK_Pos) /*!< 0x80000000 */
#define FLASH_OPTCR_SWAP_BANK                FLASH_OPTCR_SWAP_BANK_Msk         

/*******************  Bits definition for FLASH_OPTSR register  ***************/
#define FLASH_OPTSR_OPT_BUSY_Pos             (0U)                              
#define FLASH_OPTSR_OPT_BUSY_Msk             (0x1U << FLASH_OPTSR_OPT_BUSY_Pos) /*!< 0x00000001 */
#define FLASH_OPTSR_OPT_BUSY                 FLASH_OPTSR_OPT_BUSY_Msk          
#define FLASH_OPTSR_BOR_LEV_Pos              (2U)                              
#define FLASH_OPTSR_BOR_LEV_Msk              (0x3U << FLASH_OPTSR_BOR_LEV_Pos) /*!< 0x0000000C */
#define FLASH_OPTSR_BOR_LEV                  FLASH_OPTSR_BOR_LEV_Msk           
#define FLASH_OPTSR_BOR_LEV_0                (0x1U << FLASH_OPTSR_BOR_LEV_Pos) /*!< 0x00000004 */
#define FLASH_OPTSR_BOR_LEV_1                (0x2U << FLASH_OPTSR_BOR_LEV_Pos) /*!< 0x00000008 */
#define FLASH_OPTSR_IWDG1_SW_Pos             (4U)                              
#define FLASH_OPTSR_IWDG1_SW_Msk             (0x1U << FLASH_OPTSR_IWDG1_SW_Pos) /*!< 0x00000010 */
#define FLASH_OPTSR_IWDG1_SW                 FLASH_OPTSR_IWDG1_SW_Msk          


#define FLASH_OPTSR_NRST_STOP_D1_Pos         (6U)                              
#define FLASH_OPTSR_NRST_STOP_D1_Msk         (0x1U << FLASH_OPTSR_NRST_STOP_D1_Pos) /*!< 0x00000040 */
#define FLASH_OPTSR_NRST_STOP_D1             FLASH_OPTSR_NRST_STOP_D1_Msk      
#define FLASH_OPTSR_NRST_STBY_D1_Pos         (7U)                              
#define FLASH_OPTSR_NRST_STBY_D1_Msk         (0x1U << FLASH_OPTSR_NRST_STBY_D1_Pos) /*!< 0x00000080 */
#define FLASH_OPTSR_NRST_STBY_D1             FLASH_OPTSR_NRST_STBY_D1_Msk      
#define FLASH_OPTSR_RDP_Pos                  (8U)                              
#define FLASH_OPTSR_RDP_Msk                  (0xFFU << FLASH_OPTSR_RDP_Pos)    /*!< 0x0000FF00 */
#define FLASH_OPTSR_RDP                      FLASH_OPTSR_RDP_Msk               
#define FLASH_OPTCR_RDP_0                    ((uint32_t)0x00000100)            
#define FLASH_OPTCR_RDP_1                    ((uint32_t)0x00000200)            
#define FLASH_OPTCR_RDP_2                    ((uint32_t)0x00000400)            
#define FLASH_OPTCR_RDP_3                    ((uint32_t)0x00000800)            
#define FLASH_OPTCR_RDP_4                    ((uint32_t)0x00001000)            
#define FLASH_OPTCR_RDP_5                    ((uint32_t)0x00002000)            
#define FLASH_OPTCR_RDP_6                    ((uint32_t)0x00004000)            
#define FLASH_OPTCR_RDP_7                    ((uint32_t)0x00008000)            

#define FLASH_OPTSR_FZ_IWDG_STOP_Pos         (17U)                             
#define FLASH_OPTSR_FZ_IWDG_STOP_Msk         (0x1U << FLASH_OPTSR_FZ_IWDG_STOP_Pos) /*!< 0x00020000 */
#define FLASH_OPTSR_FZ_IWDG_STOP             FLASH_OPTSR_FZ_IWDG_STOP_Msk      
#define FLASH_OPTSR_FZ_IWDG_SDBY_Pos         (18U)                             
#define FLASH_OPTSR_FZ_IWDG_SDBY_Msk         (0x1U << FLASH_OPTSR_FZ_IWDG_SDBY_Pos) /*!< 0x00040000 */
#define FLASH_OPTSR_FZ_IWDG_SDBY             FLASH_OPTSR_FZ_IWDG_SDBY_Msk      
#define FLASH_OPTSR_ST_RAM_SIZE_Pos          (19U)                             
#define FLASH_OPTSR_ST_RAM_SIZE_Msk          (0x3U << FLASH_OPTSR_ST_RAM_SIZE_Pos) /*!< 0x00180000 */
#define FLASH_OPTSR_ST_RAM_SIZE              FLASH_OPTSR_ST_RAM_SIZE_Msk       
#define FLASH_OPTSR_ST_RAM_SIZE_0            (0x1U << FLASH_OPTSR_ST_RAM_SIZE_Pos) /*!< 0x00080000 */
#define FLASH_OPTSR_ST_RAM_SIZE_1            (0x2U << FLASH_OPTSR_ST_RAM_SIZE_Pos) /*!< 0x00100000 */
#define FLASH_OPTSR_SECURITY_Pos             (21U)                             
#define FLASH_OPTSR_SECURITY_Msk             (0x1U << FLASH_OPTSR_SECURITY_Pos) /*!< 0x00200000 */
#define FLASH_OPTSR_SECURITY                 FLASH_OPTSR_SECURITY_Msk          
#define FLASH_OPTSR_RSS1_Pos                 (26U)                             
#define FLASH_OPTSR_RSS1_Msk                 (0x1U << FLASH_OPTSR_RSS1_Pos)    /*!< 0x04000000 */
#define FLASH_OPTSR_RSS1                     FLASH_OPTSR_RSS1_Msk              
#define FLASH_OPTSR_RSS2_Pos                 (27U)                             
#define FLASH_OPTSR_RSS2_Msk                 (0x1U << FLASH_OPTSR_RSS2_Pos)    /*!< 0x08000000 */
#define FLASH_OPTSR_RSS2                     FLASH_OPTSR_RSS2_Msk              
#define FLASH_OPTSR_PERSO_OK_Pos             (28U)                             
#define FLASH_OPTSR_PERSO_OK_Msk             (0x1U << FLASH_OPTSR_PERSO_OK_Pos) /*!< 0x10000000 */
#define FLASH_OPTSR_PERSO_OK                 FLASH_OPTSR_PERSO_OK_Msk          
#define FLASH_OPTSR_IO_HSLV_Pos              (29U)                             
#define FLASH_OPTSR_IO_HSLV_Msk              (0x1U << FLASH_OPTSR_IO_HSLV_Pos) /*!< 0x20000000 */
#define FLASH_OPTSR_IO_HSLV                  FLASH_OPTSR_IO_HSLV_Msk           
#define FLASH_OPTSR_OPTCHANGEERR_Pos         (30U)                             
#define FLASH_OPTSR_OPTCHANGEERR_Msk         (0x1U << FLASH_OPTSR_OPTCHANGEERR_Pos) /*!< 0x40000000 */
#define FLASH_OPTSR_OPTCHANGEERR             FLASH_OPTSR_OPTCHANGEERR_Msk      
#define FLASH_OPTSR_SWAP_BANK_OPT_Pos        (31U)                             
#define FLASH_OPTSR_SWAP_BANK_OPT_Msk        (0x1U << FLASH_OPTSR_SWAP_BANK_OPT_Pos) /*!< 0x80000000 */
#define FLASH_OPTSR_SWAP_BANK_OPT            FLASH_OPTSR_SWAP_BANK_OPT_Msk     

