bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/*******************  Bits definition for FLASH_OPTCCR register  *******************/
#define FLASH_OPTCCR_CLR_OPTCHANGEERR_Pos    (30U)                             
#define FLASH_OPTCCR_CLR_OPTCHANGEERR_Msk    (0x1U << FLASH_OPTCCR_CLR_OPTCHANGEERR_Pos) /*!< 0x40000000 */
#define FLASH_OPTCCR_CLR_OPTCHANGEERR        FLASH_OPTCCR_CLR_OPTCHANGEERR_Msk 

/*******************  Bits definition for FLASH_PRAR register  *********************/
#define FLASH_PRAR_PROT_AREA_START_Pos       (0U)                              
#define FLASH_PRAR_PROT_AREA_START_Msk       (0xFFFU << FLASH_PRAR_PROT_AREA_START_Pos) /*!< 0x00000FFF */
#define FLASH_PRAR_PROT_AREA_START           FLASH_PRAR_PROT_AREA_START_Msk    
#define FLASH_PRAR_PROT_AREA_END_Pos         (16U)                             
#define FLASH_PRAR_PROT_AREA_END_Msk         (0xFFFU << FLASH_PRAR_PROT_AREA_END_Pos) /*!< 0x0FFF0000 */
#define FLASH_PRAR_PROT_AREA_END             FLASH_PRAR_PROT_AREA_END_Msk      
#define FLASH_PRAR_DMEP_Pos                  (31U)                             
#define FLASH_PRAR_DMEP_Msk                  (0x1U << FLASH_PRAR_DMEP_Pos)     /*!< 0x80000000 */
#define FLASH_PRAR_DMEP                      FLASH_PRAR_DMEP_Msk               

/*******************  Bits definition for FLASH_SCAR register  *********************/
#define FLASH_SCAR_SEC_AREA_START_Pos        (0U)                              
#define FLASH_SCAR_SEC_AREA_START_Msk        (0xFFFU << FLASH_SCAR_SEC_AREA_START_Pos) /*!< 0x00000FFF */
#define FLASH_SCAR_SEC_AREA_START            FLASH_SCAR_SEC_AREA_START_Msk     
#define FLASH_SCAR_SEC_AREA_END_Pos          (16U)                             
#define FLASH_SCAR_SEC_AREA_END_Msk          (0xFFFU << FLASH_SCAR_SEC_AREA_END_Pos) /*!< 0x0FFF0000 */
#define FLASH_SCAR_SEC_AREA_END              FLASH_SCAR_SEC_AREA_END_Msk       
#define FLASH_SCAR_DMES_Pos                  (31U)                             
#define FLASH_SCAR_DMES_Msk                  (0x1U << FLASH_SCAR_DMES_Pos)     /*!< 0x80000000 */
#define FLASH_SCAR_DMES                      FLASH_SCAR_DMES_Msk               

/*******************  Bits definition for FLASH_WPSN register  *********************/
#define FLASH_WPSN_WRPSN_Pos                 (0U)                              
#define FLASH_WPSN_WRPSN_Msk                 (0xFFU << FLASH_WPSN_WRPSN_Pos)   /*!< 0x000000FF */
#define FLASH_WPSN_WRPSN                     FLASH_WPSN_WRPSN_Msk              

/*******************  Bits definition for FLASH_BOOT_CUR register  ****************/
#define FLASH_BOOT_ADD0_Pos                  (0U)                              
#define FLASH_BOOT_ADD0_Msk                  (0xFFFFU << FLASH_BOOT_ADD0_Pos)  /*!< 0x0000FFFF */
#define FLASH_BOOT_ADD0                      FLASH_BOOT_ADD0_Msk               
#define FLASH_BOOT_ADD1_Pos                  (16U)                             
#define FLASH_BOOT_ADD1_Msk                  (0xFFFFU << FLASH_BOOT_ADD1_Pos)  /*!< 0xFFFF0000 */
#define FLASH_BOOT_ADD1                      FLASH_BOOT_ADD1_Msk               


/*******************  Bits definition for FLASH_CRCCR register  ********************/
#define FLASH_CRCCR_CRC_SECT_Pos             (0U)                              
#define FLASH_CRCCR_CRC_SECT_Msk             (0x7U << FLASH_CRCCR_CRC_SECT_Pos) /*!< 0x00000007 */
#define FLASH_CRCCR_CRC_SECT                 FLASH_CRCCR_CRC_SECT_Msk          
#define FLASH_CRCCR_ALL_BANK_Pos             (7U)                              
#define FLASH_CRCCR_ALL_BANK_Msk             (0x1U << FLASH_CRCCR_ALL_BANK_Pos) /*!< 0x00000080 */
#define FLASH_CRCCR_ALL_BANK                 FLASH_CRCCR_ALL_BANK_Msk          
#define FLASH_CRCCR_CRC_BY_SECT_Pos          (8U)                              
#define FLASH_CRCCR_CRC_BY_SECT_Msk          (0x1U << FLASH_CRCCR_CRC_BY_SECT_Pos) /*!< 0x00000100 */
#define FLASH_CRCCR_CRC_BY_SECT              FLASH_CRCCR_CRC_BY_SECT_Msk       
#define FLASH_CRCCR_ADD_SECT_Pos             (9U)                              
#define FLASH_CRCCR_ADD_SECT_Msk             (0x1U << FLASH_CRCCR_ADD_SECT_Pos) /*!< 0x00000200 */
#define FLASH_CRCCR_ADD_SECT                 FLASH_CRCCR_ADD_SECT_Msk          
#define FLASH_CRCCR_CLEAN_SECT_Pos           (10U)                             
#define FLASH_CRCCR_CLEAN_SECT_Msk           (0x1U << FLASH_CRCCR_CLEAN_SECT_Pos) /*!< 0x00000400 */
#define FLASH_CRCCR_CLEAN_SECT               FLASH_CRCCR_CLEAN_SECT_Msk        
#define FLASH_CRCCR_START_CRC_Pos            (16U)                             
#define FLASH_CRCCR_START_CRC_Msk            (0x1U << FLASH_CRCCR_START_CRC_Pos) /*!< 0x00010000 */
#define FLASH_CRCCR_START_CRC                FLASH_CRCCR_START_CRC_Msk         
#define FLASH_CRCCR_CLEAN_CRC_Pos            (17U)                             
#define FLASH_CRCCR_CLEAN_CRC_Msk            (0x1U << FLASH_CRCCR_CLEAN_CRC_Pos) /*!< 0x00020000 */
#define FLASH_CRCCR_CLEAN_CRC                FLASH_CRCCR_CLEAN_CRC_Msk         
#define FLASH_CRCCR_CRC_BURST_Pos            (20U)                             
#define FLASH_CRCCR_CRC_BURST_Msk            (0x3U << FLASH_CRCCR_CRC_BURST_Pos) /*!< 0x00300000 */
#define FLASH_CRCCR_CRC_BURST                FLASH_CRCCR_CRC_BURST_Msk         
#define FLASH_CRCCR_CRC_BURST_0              (0x0U << FLASH_CRCCR_CRC_BURST_Pos) /*!< 0x00000000 */
#define FLASH_CRCCR_CRC_BURST_1              (0x1U << FLASH_CRCCR_CRC_BURST_Pos) /*!< 0x00100000 */
#define FLASH_CRCCR_CRC_BURST_2              (0x2U << FLASH_CRCCR_CRC_BURST_Pos) /*!< 0x00200000 */
#define FLASH_CRCCR_CRC_BURST_3              (0x3U << FLASH_CRCCR_CRC_BURST_Pos) /*!< 0x00300000 */

/*******************  Bits definition for FLASH_CRCSADD register  ****************/
#define FLASH_CRCSADD_CRC_START_ADDR_Pos     (0U)                              
#define FLASH_CRCSADD_CRC_START_ADDR_Msk     (0xFFFFFFFFU << FLASH_CRCSADD_CRC_START_ADDR_Pos) /*!< 0xFFFFFFFF */
#define FLASH_CRCSADD_CRC_START_ADDR         FLASH_CRCSADD_CRC_START_ADDR_Msk  

/*******************  Bits definition for FLASH_CRCEADD register  ****************/
#define FLASH_CRCEADD_CRC_END_ADDR_Pos       (0U)                              
#define FLASH_CRCEADD_CRC_END_ADDR_Msk       (0xFFFFFFFFU << FLASH_CRCEADD_CRC_END_ADDR_Pos) /*!< 0xFFFFFFFF */
#define FLASH_CRCEADD_CRC_END_ADDR           FLASH_CRCEADD_CRC_END_ADDR_Msk    

/*******************  Bits definition for FLASH_CRCDATA register  ***************/
#define FLASH_CRCDATA_CRC_DATA_Pos           (0U)                              
#define FLASH_CRCDATA_CRC_DATA_Msk           (0xFFFFFFFFU << FLASH_CRCDATA_CRC_DATA_Pos) /*!< 0xFFFFFFFF */
#define FLASH_CRCDATA_CRC_DATA               FLASH_CRCDATA_CRC_DATA_Msk        

