bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/****************** Bit definition for GPIO_AFRL register  ********************/
#define GPIO_AFRL_AFRL0_Pos              (0U)                                  
#define GPIO_AFRL_AFRL0_Msk              (0xFU << GPIO_AFRL_AFRL0_Pos)         /*!< 0x0000000F */
#define GPIO_AFRL_AFRL0                  GPIO_AFRL_AFRL0_Msk                   
#define GPIO_AFRL_AFRL1_Pos              (4U)                                  
#define GPIO_AFRL_AFRL1_Msk              (0xFU << GPIO_AFRL_AFRL1_Pos)         /*!< 0x000000F0 */
#define GPIO_AFRL_AFRL1                  GPIO_AFRL_AFRL1_Msk                   
#define GPIO_AFRL_AFRL2_Pos              (8U)                                  
#define GPIO_AFRL_AFRL2_Msk              (0xFU << GPIO_AFRL_AFRL2_Pos)         /*!< 0x00000F00 */
#define GPIO_AFRL_AFRL2                  GPIO_AFRL_AFRL2_Msk                   
#define GPIO_AFRL_AFRL3_Pos              (12U)                                 
#define GPIO_AFRL_AFRL3_Msk              (0xFU << GPIO_AFRL_AFRL3_Pos)         /*!< 0x0000F000 */
#define GPIO_AFRL_AFRL3                  GPIO_AFRL_AFRL3_Msk                   
#define GPIO_AFRL_AFRL4_Pos              (16U)                                 
#define GPIO_AFRL_AFRL4_Msk              (0xFU << GPIO_AFRL_AFRL4_Pos)         /*!< 0x000F0000 */
#define GPIO_AFRL_AFRL4                  GPIO_AFRL_AFRL4_Msk                   
#define GPIO_AFRL_AFRL5_Pos              (20U)                                 
#define GPIO_AFRL_AFRL5_Msk              (0xFU << GPIO_AFRL_AFRL5_Pos)         /*!< 0x00F00000 */
#define GPIO_AFRL_AFRL5                  GPIO_AFRL_AFRL5_Msk                   
#define GPIO_AFRL_AFRL6_Pos              (24U)                                 
#define GPIO_AFRL_AFRL6_Msk              (0xFU << GPIO_AFRL_AFRL6_Pos)         /*!< 0x0F000000 */
#define GPIO_AFRL_AFRL6                  GPIO_AFRL_AFRL6_Msk                   
#define GPIO_AFRL_AFRL7_Pos              (28U)                                 
#define GPIO_AFRL_AFRL7_Msk              (0xFU << GPIO_AFRL_AFRL7_Pos)         /*!< 0xF0000000 */
#define GPIO_AFRL_AFRL7                  GPIO_AFRL_AFRL7_Msk                   

/****************** Bit definition for GPIO_AFRH register  ********************/
#define GPIO_AFRH_AFRH0_Pos              (0U)                                  
#define GPIO_AFRH_AFRH0_Msk              (0xFU << GPIO_AFRH_AFRH0_Pos)         /*!< 0x0000000F */
#define GPIO_AFRH_AFRH0                  GPIO_AFRH_AFRH0_Msk                   
#define GPIO_AFRH_AFRH1_Pos              (4U)                                  
#define GPIO_AFRH_AFRH1_Msk              (0xFU << GPIO_AFRH_AFRH1_Pos)         /*!< 0x000000F0 */
#define GPIO_AFRH_AFRH1                  GPIO_AFRH_AFRH1_Msk                   
#define GPIO_AFRH_AFRH2_Pos              (8U)                                  
#define GPIO_AFRH_AFRH2_Msk              (0xFU << GPIO_AFRH_AFRH2_Pos)         /*!< 0x00000F00 */
#define GPIO_AFRH_AFRH2                  GPIO_AFRH_AFRH2_Msk                   
#define GPIO_AFRH_AFRH3_Pos              (12U)                                 
#define GPIO_AFRH_AFRH3_Msk              (0xFU << GPIO_AFRH_AFRH3_Pos)         /*!< 0x0000F000 */
#define GPIO_AFRH_AFRH3                  GPIO_AFRH_AFRH3_Msk                   
#define GPIO_AFRH_AFRH4_Pos              (16U)                                 
#define GPIO_AFRH_AFRH4_Msk              (0xFU << GPIO_AFRH_AFRH4_Pos)         /*!< 0x000F0000 */
#define GPIO_AFRH_AFRH4                  GPIO_AFRH_AFRH4_Msk                   
#define GPIO_AFRH_AFRH5_Pos              (20U)                                 
#define GPIO_AFRH_AFRH5_Msk              (0xFU << GPIO_AFRH_AFRH5_Pos)         /*!< 0x00F00000 */
#define GPIO_AFRH_AFRH5                  GPIO_AFRH_AFRH5_Msk                   
#define GPIO_AFRH_AFRH6_Pos              (24U)                                 
#define GPIO_AFRH_AFRH6_Msk              (0xFU << GPIO_AFRH_AFRH6_Pos)         /*!< 0x0F000000 */
#define GPIO_AFRH_AFRH6                  GPIO_AFRH_AFRH6_Msk                   
#define GPIO_AFRH_AFRH7_Pos              (28U)                                 
#define GPIO_AFRH_AFRH7_Msk              (0xFU << GPIO_AFRH_AFRH7_Pos)         /*!< 0xF0000000 */
#define GPIO_AFRH_AFRH7                  GPIO_AFRH_AFRH7_Msk                   


/******************************************************************************/
/*                                                                            */
/*                        HSEM HW Semaphore                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for HSEM_R register  ********************/
#define HSEM_R_PROCID_Pos        (0U)                                          
#define HSEM_R_PROCID_Msk        (0xFFU << HSEM_R_PROCID_Pos)                  /*!< 0x000000FF */
#define HSEM_R_PROCID            HSEM_R_PROCID_Msk                             /*!<Semaphore ProcessID */
#define HSEM_R_MASTERID_Pos      (8U)                                          
#define HSEM_R_MASTERID_Msk      (0xFFU << HSEM_R_MASTERID_Pos)                /*!< 0x0000FF00 */
#define HSEM_R_MASTERID          HSEM_R_MASTERID_Msk                           /*!<Semaphore MasterID. */
#define HSEM_R_LOCK_Pos          (31U)                                         
#define HSEM_R_LOCK_Msk          (0x1U << HSEM_R_LOCK_Pos)                     /*!< 0x80000000 */
#define HSEM_R_LOCK              HSEM_R_LOCK_Msk                               /*!<Lock indication. */

/********************  Bit definition for HSEM_RLR register  ******************/
#define HSEM_RLR_PROCID_Pos      (0U)                                          
#define HSEM_RLR_PROCID_Msk      (0xFFU << HSEM_RLR_PROCID_Pos)                /*!< 0x000000FF */
#define HSEM_RLR_PROCID          HSEM_RLR_PROCID_Msk                           /*!<Semaphore ProcessID */
#define HSEM_RLR_MASTERID_Pos    (8U)                                          
#define HSEM_RLR_MASTERID_Msk    (0xFFU << HSEM_RLR_MASTERID_Pos)              /*!< 0x0000FF00 */
#define HSEM_RLR_MASTERID        HSEM_RLR_MASTERID_Msk                         /*!<Semaphore MasterID. */
#define HSEM_RLR_LOCK_Pos        (31U)                                         
#define HSEM_RLR_LOCK_Msk        (0x1U << HSEM_RLR_LOCK_Pos)                   /*!< 0x80000000 */
#define HSEM_RLR_LOCK            HSEM_RLR_LOCK_Msk                             /*!<Lock indication. */

/********************  Bit definition for HSEM_IER register  *****************/
#define HSEM_IER_ISEM0_Pos       (0U)                                          
#define HSEM_IER_ISEM0_Msk       (0x1U << HSEM_IER_ISEM0_Pos)                  /*!< 0x00000001 */
#define HSEM_IER_ISEM0           HSEM_IER_ISEM0_Msk                            /*!<semaphore 0 , interrupt 0 enable bit.  */
#define HSEM_IER_ISEM1_Pos       (1U)                                          
#define HSEM_IER_ISEM1_Msk       (0x1U << HSEM_IER_ISEM1_Pos)                  /*!< 0x00000002 */
#define HSEM_IER_ISEM1           HSEM_IER_ISEM1_Msk                            /*!<semaphore 1 , interrupt 0 enable bit.  */
#define HSEM_IER_ISEM2_Pos       (2U)                                          
#define HSEM_IER_ISEM2_Msk       (0x1U << HSEM_IER_ISEM2_Pos)                  /*!< 0x00000004 */
#define HSEM_IER_ISEM2           HSEM_IER_ISEM2_Msk                            /*!<semaphore 2 , interrupt 0 enable bit.  */
#define HSEM_IER_ISEM3_Pos       (3U)                                          
#define HSEM_IER_ISEM3_Msk       (0x1U << HSEM_IER_ISEM3_Pos)                  /*!< 0x00000008 */
#define HSEM_IER_ISEM3           HSEM_IER_ISEM3_Msk                            /*!<semaphore 3 , interrupt 0 enable bit.  */
#define HSEM_IER_ISEM4_Pos       (4U)                                          
#define HSEM_IER_ISEM4_Msk       (0x1U << HSEM_IER_ISEM4_Pos)                  /*!< 0x00000010 */
#define HSEM_IER_ISEM4           HSEM_IER_ISEM4_Msk                            /*!<semaphore 4 , interrupt 0 enable bit.  */
#define HSEM_IER_ISEM5_Pos       (5U)                                          
#define HSEM_IER_ISEM5_Msk       (0x1U << HSEM_IER_ISEM5_Pos)                  /*!< 0x00000020 */
#define HSEM_IER_ISEM5           HSEM_IER_ISEM5_Msk                            /*!<semaphore 5 interrupt 0 enable bit.  */
#define HSEM_IER_ISEM6_Pos       (6U)                                          
#define HSEM_IER_ISEM6_Msk       (0x1U << HSEM_IER_ISEM6_Pos)                  /*!< 0x00000040 */
#define HSEM_IER_ISEM6           HSEM_IER_ISEM6_Msk                            /*!<semaphore 6 interrupt 0 enable bit.  */
#define HSEM_IER_ISEM7_Pos       (7U)                                          
#define HSEM_IER_ISEM7_Msk       (0x1U << HSEM_IER_ISEM7_Pos)                  /*!< 0x00000080 */
#define HSEM_IER_ISEM7           HSEM_IER_ISEM7_Msk                            /*!<semaphore 7 interrupt 0 enable bit.  */
#define HSEM_IER_ISEM8_Pos       (8U)                                          
#define HSEM_IER_ISEM8_Msk       (0x1U << HSEM_IER_ISEM8_Pos)                  /*!< 0x00000100 */
#define HSEM_IER_ISEM8           HSEM_IER_ISEM8_Msk                            /*!<semaphore 8 interrupt 0 enable bit.  */
#define HSEM_IER_ISEM9_Pos       (9U)                                          
#define HSEM_IER_ISEM9_Msk       (0x1U << HSEM_IER_ISEM9_Pos)                  /*!< 0x00000200 */
#define HSEM_IER_ISEM9           HSEM_IER_ISEM9_Msk                            /*!<semaphore 9 interrupt 0 enable bit.  */
#define HSEM_IER_ISEM10_Pos      (10U)                                         
#define HSEM_IER_ISEM10_Msk      (0x1U << HSEM_IER_ISEM10_Pos)                 /*!< 0x00000400 */
#define HSEM_IER_ISEM10          HSEM_IER_ISEM10_Msk                           /*!<semaphore 10 interrupt 0 enable bit. */
#define HSEM_IER_ISEM11_Pos      (11U)                                         
#define HSEM_IER_ISEM11_Msk      (0x1U << HSEM_IER_ISEM11_Pos)                 /*!< 0x00000800 */
#define HSEM_IER_ISEM11          HSEM_IER_ISEM11_Msk                           /*!<semaphore 11 interrupt 0 enable bit. */
#define HSEM_IER_ISEM12_Pos      (12U)                                         
#define HSEM_IER_ISEM12_Msk      (0x1U << HSEM_IER_ISEM12_Pos)                 /*!< 0x00001000 */
#define HSEM_IER_ISEM12          HSEM_IER_ISEM12_Msk                           /*!<semaphore 12 interrupt 0 enable bit. */
#define HSEM_IER_ISEM13_Pos      (13U)                                         
#define HSEM_IER_ISEM13_Msk      (0x1U << HSEM_IER_ISEM13_Pos)                 /*!< 0x00002000 */
#define HSEM_IER_ISEM13          HSEM_IER_ISEM13_Msk                           /*!<semaphore 13 interrupt 0 enable bit. */
#define HSEM_IER_ISEM14_Pos      (14U)                                         
#define HSEM_IER_ISEM14_Msk      (0x1U << HSEM_IER_ISEM14_Pos)                 /*!< 0x00004000 */
#define HSEM_IER_ISEM14          HSEM_IER_ISEM14_Msk                           /*!<semaphore 14 interrupt 0 enable bit. */
#define HSEM_IER_ISEM15_Pos      (15U)                                         
#define HSEM_IER_ISEM15_Msk      (0x1U << HSEM_IER_ISEM15_Pos)                 /*!< 0x00008000 */
#define HSEM_IER_ISEM15          HSEM_IER_ISEM15_Msk                           /*!<semaphore 15 interrupt 0 enable bit. */
#define HSEM_IER_ISEM16_Pos      (16U)                                         
#define HSEM_IER_ISEM16_Msk      (0x1U << HSEM_IER_ISEM16_Pos)                 /*!< 0x00010000 */
#define HSEM_IER_ISEM16          HSEM_IER_ISEM16_Msk                           /*!<semaphore 16 interrupt 0 enable bit. */
#define HSEM_IER_ISEM17_Pos      (17U)                                         
#define HSEM_IER_ISEM17_Msk      (0x1U << HSEM_IER_ISEM17_Pos)                 /*!< 0x00020000 */
#define HSEM_IER_ISEM17          HSEM_IER_ISEM17_Msk                           /*!<semaphore 17 interrupt 0 enable bit. */
#define HSEM_IER_ISEM18_Pos      (18U)                                         
#define HSEM_IER_ISEM18_Msk      (0x1U << HSEM_IER_ISEM18_Pos)                 /*!< 0x00040000 */
#define HSEM_IER_ISEM18          HSEM_IER_ISEM18_Msk                           /*!<semaphore 18 interrupt 0 enable bit. */
#define HSEM_IER_ISEM19_Pos      (19U)                                         
#define HSEM_IER_ISEM19_Msk      (0x1U << HSEM_IER_ISEM19_Pos)                 /*!< 0x00080000 */
#define HSEM_IER_ISEM19          HSEM_IER_ISEM19_Msk                           /*!<semaphore 19 interrupt 0 enable bit. */
#define HSEM_IER_ISEM20_Pos      (20U)                                         
#define HSEM_IER_ISEM20_Msk      (0x1U << HSEM_IER_ISEM20_Pos)                 /*!< 0x00100000 */
#define HSEM_IER_ISEM20          HSEM_IER_ISEM20_Msk                           /*!<semaphore 20 interrupt 0 enable bit. */
#define HSEM_IER_ISEM21_Pos      (21U)                                         
#define HSEM_IER_ISEM21_Msk      (0x1U << HSEM_IER_ISEM21_Pos)                 /*!< 0x00200000 */
#define HSEM_IER_ISEM21          HSEM_IER_ISEM21_Msk                           /*!<semaphore 21 interrupt 0 enable bit. */
#define HSEM_IER_ISEM22_Pos      (22U)                                         
#define HSEM_IER_ISEM22_Msk      (0x1U << HSEM_IER_ISEM22_Pos)                 /*!< 0x00400000 */
#define HSEM_IER_ISEM22          HSEM_IER_ISEM22_Msk                           /*!<semaphore 22 interrupt 0 enable bit. */
#define HSEM_IER_ISEM23_Pos      (23U)                                         
#define HSEM_IER_ISEM23_Msk      (0x1U << HSEM_IER_ISEM23_Pos)                 /*!< 0x00800000 */
#define HSEM_IER_ISEM23          HSEM_IER_ISEM23_Msk                           /*!<semaphore 23 interrupt 0 enable bit. */
#define HSEM_IER_ISEM24_Pos      (24U)                                         
#define HSEM_IER_ISEM24_Msk      (0x1U << HSEM_IER_ISEM24_Pos)                 /*!< 0x01000000 */
#define HSEM_IER_ISEM24          HSEM_IER_ISEM24_Msk                           /*!<semaphore 24 interrupt 0 enable bit. */
#define HSEM_IER_ISEM25_Pos      (25U)                                         
#define HSEM_IER_ISEM25_Msk      (0x1U << HSEM_IER_ISEM25_Pos)                 /*!< 0x02000000 */
#define HSEM_IER_ISEM25          HSEM_IER_ISEM25_Msk                           /*!<semaphore 25 interrupt 0 enable bit. */
#define HSEM_IER_ISEM26_Pos      (26U)                                         
#define HSEM_IER_ISEM26_Msk      (0x1U << HSEM_IER_ISEM26_Pos)                 /*!< 0x04000000 */
#define HSEM_IER_ISEM26          HSEM_IER_ISEM26_Msk                           /*!<semaphore 26 interrupt 0 enable bit. */
#define HSEM_IER_ISEM27_Pos      (27U)                                         
#define HSEM_IER_ISEM27_Msk      (0x1U << HSEM_IER_ISEM27_Pos)                 /*!< 0x08000000 */
#define HSEM_IER_ISEM27          HSEM_IER_ISEM27_Msk                           /*!<semaphore 27 interrupt 0 enable bit. */
#define HSEM_IER_ISEM28_Pos      (28U)                                         
#define HSEM_IER_ISEM28_Msk      (0x1U << HSEM_IER_ISEM28_Pos)                 /*!< 0x10000000 */
#define HSEM_IER_ISEM28          HSEM_IER_ISEM28_Msk                           /*!<semaphore 28 interrupt 0 enable bit. */
#define HSEM_IER_ISEM29_Pos      (29U)                                         
#define HSEM_IER_ISEM29_Msk      (0x1U << HSEM_IER_ISEM29_Pos)                 /*!< 0x20000000 */
#define HSEM_IER_ISEM29          HSEM_IER_ISEM29_Msk                           /*!<semaphore 29 interrupt 0 enable bit. */
#define HSEM_IER_ISEM30_Pos      (30U)                                         
#define HSEM_IER_ISEM30_Msk      (0x1U << HSEM_IER_ISEM30_Pos)                 /*!< 0x40000000 */
#define HSEM_IER_ISEM30          HSEM_IER_ISEM30_Msk                           /*!<semaphore 30 interrupt 0 enable bit. */
#define HSEM_IER_ISEM31_Pos      (31U)                                         
#define HSEM_IER_ISEM31_Msk      (0x1U << HSEM_IER_ISEM31_Pos)                 /*!< 0x80000000 */
#define HSEM_IER_ISEM31          HSEM_IER_ISEM31_Msk                           /*!<semaphore 31 interrupt 0 enable bit. */

