bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for HSEM_ICR register  *****************/
#define HSEM_ICR_ISEM0_Pos       (0U)                                          
#define HSEM_ICR_ISEM0_Msk       (0x1U << HSEM_ICR_ISEM0_Pos)                  /*!< 0x00000001 */
#define HSEM_ICR_ISEM0           HSEM_ICR_ISEM0_Msk                            /*!<semaphore 0 , interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM1_Pos       (1U)                                          
#define HSEM_ICR_ISEM1_Msk       (0x1U << HSEM_ICR_ISEM1_Pos)                  /*!< 0x00000002 */
#define HSEM_ICR_ISEM1           HSEM_ICR_ISEM1_Msk                            /*!<semaphore 1 , interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM2_Pos       (2U)                                          
#define HSEM_ICR_ISEM2_Msk       (0x1U << HSEM_ICR_ISEM2_Pos)                  /*!< 0x00000004 */
#define HSEM_ICR_ISEM2           HSEM_ICR_ISEM2_Msk                            /*!<semaphore 2 , interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM3_Pos       (3U)                                          
#define HSEM_ICR_ISEM3_Msk       (0x1U << HSEM_ICR_ISEM3_Pos)                  /*!< 0x00000008 */
#define HSEM_ICR_ISEM3           HSEM_ICR_ISEM3_Msk                            /*!<semaphore 3 , interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM4_Pos       (4U)                                          
#define HSEM_ICR_ISEM4_Msk       (0x1U << HSEM_ICR_ISEM4_Pos)                  /*!< 0x00000010 */
#define HSEM_ICR_ISEM4           HSEM_ICR_ISEM4_Msk                            /*!<semaphore 4 , interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM5_Pos       (5U)                                          
#define HSEM_ICR_ISEM5_Msk       (0x1U << HSEM_ICR_ISEM5_Pos)                  /*!< 0x00000020 */
#define HSEM_ICR_ISEM5           HSEM_ICR_ISEM5_Msk                            /*!<semaphore 5 interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM6_Pos       (6U)                                          
#define HSEM_ICR_ISEM6_Msk       (0x1U << HSEM_ICR_ISEM6_Pos)                  /*!< 0x00000040 */
#define HSEM_ICR_ISEM6           HSEM_ICR_ISEM6_Msk                            /*!<semaphore 6 interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM7_Pos       (7U)                                          
#define HSEM_ICR_ISEM7_Msk       (0x1U << HSEM_ICR_ISEM7_Pos)                  /*!< 0x00000080 */
#define HSEM_ICR_ISEM7           HSEM_ICR_ISEM7_Msk                            /*!<semaphore 7 interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM8_Pos       (8U)                                          
#define HSEM_ICR_ISEM8_Msk       (0x1U << HSEM_ICR_ISEM8_Pos)                  /*!< 0x00000100 */
#define HSEM_ICR_ISEM8           HSEM_ICR_ISEM8_Msk                            /*!<semaphore 8 interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM9_Pos       (9U)                                          
#define HSEM_ICR_ISEM9_Msk       (0x1U << HSEM_ICR_ISEM9_Pos)                  /*!< 0x00000200 */
#define HSEM_ICR_ISEM9           HSEM_ICR_ISEM9_Msk                            /*!<semaphore 9 interrupt 0 clear bit.  */
#define HSEM_ICR_ISEM10_Pos      (10U)                                         
#define HSEM_ICR_ISEM10_Msk      (0x1U << HSEM_ICR_ISEM10_Pos)                 /*!< 0x00000400 */
#define HSEM_ICR_ISEM10          HSEM_ICR_ISEM10_Msk                           /*!<semaphore 10 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM11_Pos      (11U)                                         
#define HSEM_ICR_ISEM11_Msk      (0x1U << HSEM_ICR_ISEM11_Pos)                 /*!< 0x00000800 */
#define HSEM_ICR_ISEM11          HSEM_ICR_ISEM11_Msk                           /*!<semaphore 11 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM12_Pos      (12U)                                         
#define HSEM_ICR_ISEM12_Msk      (0x1U << HSEM_ICR_ISEM12_Pos)                 /*!< 0x00001000 */
#define HSEM_ICR_ISEM12          HSEM_ICR_ISEM12_Msk                           /*!<semaphore 12 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM13_Pos      (13U)                                         
#define HSEM_ICR_ISEM13_Msk      (0x1U << HSEM_ICR_ISEM13_Pos)                 /*!< 0x00002000 */
#define HSEM_ICR_ISEM13          HSEM_ICR_ISEM13_Msk                           /*!<semaphore 13 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM14_Pos      (14U)                                         
#define HSEM_ICR_ISEM14_Msk      (0x1U << HSEM_ICR_ISEM14_Pos)                 /*!< 0x00004000 */
#define HSEM_ICR_ISEM14          HSEM_ICR_ISEM14_Msk                           /*!<semaphore 14 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM15_Pos      (15U)                                         
#define HSEM_ICR_ISEM15_Msk      (0x1U << HSEM_ICR_ISEM15_Pos)                 /*!< 0x00008000 */
#define HSEM_ICR_ISEM15          HSEM_ICR_ISEM15_Msk                           /*!<semaphore 15 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM16_Pos      (16U)                                         
#define HSEM_ICR_ISEM16_Msk      (0x1U << HSEM_ICR_ISEM16_Pos)                 /*!< 0x00010000 */
#define HSEM_ICR_ISEM16          HSEM_ICR_ISEM16_Msk                           /*!<semaphore 16 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM17_Pos      (17U)                                         
#define HSEM_ICR_ISEM17_Msk      (0x1U << HSEM_ICR_ISEM17_Pos)                 /*!< 0x00020000 */
#define HSEM_ICR_ISEM17          HSEM_ICR_ISEM17_Msk                           /*!<semaphore 17 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM18_Pos      (18U)                                         
#define HSEM_ICR_ISEM18_Msk      (0x1U << HSEM_ICR_ISEM18_Pos)                 /*!< 0x00040000 */
#define HSEM_ICR_ISEM18          HSEM_ICR_ISEM18_Msk                           /*!<semaphore 18 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM19_Pos      (19U)                                         
#define HSEM_ICR_ISEM19_Msk      (0x1U << HSEM_ICR_ISEM19_Pos)                 /*!< 0x00080000 */
#define HSEM_ICR_ISEM19          HSEM_ICR_ISEM19_Msk                           /*!<semaphore 19 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM20_Pos      (20U)                                         
#define HSEM_ICR_ISEM20_Msk      (0x1U << HSEM_ICR_ISEM20_Pos)                 /*!< 0x00100000 */
#define HSEM_ICR_ISEM20          HSEM_ICR_ISEM20_Msk                           /*!<semaphore 20 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM21_Pos      (21U)                                         
#define HSEM_ICR_ISEM21_Msk      (0x1U << HSEM_ICR_ISEM21_Pos)                 /*!< 0x00200000 */
#define HSEM_ICR_ISEM21          HSEM_ICR_ISEM21_Msk                           /*!<semaphore 21 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM22_Pos      (22U)                                         
#define HSEM_ICR_ISEM22_Msk      (0x1U << HSEM_ICR_ISEM22_Pos)                 /*!< 0x00400000 */
#define HSEM_ICR_ISEM22          HSEM_ICR_ISEM22_Msk                           /*!<semaphore 22 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM23_Pos      (23U)                                         
#define HSEM_ICR_ISEM23_Msk      (0x1U << HSEM_ICR_ISEM23_Pos)                 /*!< 0x00800000 */
#define HSEM_ICR_ISEM23          HSEM_ICR_ISEM23_Msk                           /*!<semaphore 23 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM24_Pos      (24U)                                         
#define HSEM_ICR_ISEM24_Msk      (0x1U << HSEM_ICR_ISEM24_Pos)                 /*!< 0x01000000 */
#define HSEM_ICR_ISEM24          HSEM_ICR_ISEM24_Msk                           /*!<semaphore 24 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM25_Pos      (25U)                                         
#define HSEM_ICR_ISEM25_Msk      (0x1U << HSEM_ICR_ISEM25_Pos)                 /*!< 0x02000000 */
#define HSEM_ICR_ISEM25          HSEM_ICR_ISEM25_Msk                           /*!<semaphore 25 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM26_Pos      (26U)                                         
#define HSEM_ICR_ISEM26_Msk      (0x1U << HSEM_ICR_ISEM26_Pos)                 /*!< 0x04000000 */
#define HSEM_ICR_ISEM26          HSEM_ICR_ISEM26_Msk                           /*!<semaphore 26 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM27_Pos      (27U)                                         
#define HSEM_ICR_ISEM27_Msk      (0x1U << HSEM_ICR_ISEM27_Pos)                 /*!< 0x08000000 */
#define HSEM_ICR_ISEM27          HSEM_ICR_ISEM27_Msk                           /*!<semaphore 27 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM28_Pos      (28U)                                         
#define HSEM_ICR_ISEM28_Msk      (0x1U << HSEM_ICR_ISEM28_Pos)                 /*!< 0x10000000 */
#define HSEM_ICR_ISEM28          HSEM_ICR_ISEM28_Msk                           /*!<semaphore 28 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM29_Pos      (29U)                                         
#define HSEM_ICR_ISEM29_Msk      (0x1U << HSEM_ICR_ISEM29_Pos)                 /*!< 0x20000000 */
#define HSEM_ICR_ISEM29          HSEM_ICR_ISEM29_Msk                           /*!<semaphore 29 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM30_Pos      (30U)                                         
#define HSEM_ICR_ISEM30_Msk      (0x1U << HSEM_ICR_ISEM30_Pos)                 /*!< 0x40000000 */
#define HSEM_ICR_ISEM30          HSEM_ICR_ISEM30_Msk                           /*!<semaphore 30 interrupt 0 clear bit. */
#define HSEM_ICR_ISEM31_Pos      (31U)                                         
#define HSEM_ICR_ISEM31_Msk      (0x1U << HSEM_ICR_ISEM31_Pos)                 /*!< 0x80000000 */
#define HSEM_ICR_ISEM31          HSEM_ICR_ISEM31_Msk                           /*!<semaphore 31 interrupt 0 clear bit. */

/********************  Bit definition for HSEM_ISR register  *****************/
#define HSEM_ISR_ISEM0_Pos       (0U)                                          
#define HSEM_ISR_ISEM0_Msk       (0x1U << HSEM_ISR_ISEM0_Pos)                  /*!< 0x00000001 */
#define HSEM_ISR_ISEM0           HSEM_ISR_ISEM0_Msk                            /*!<semaphore 0 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM1_Pos       (1U)                                          
#define HSEM_ISR_ISEM1_Msk       (0x1U << HSEM_ISR_ISEM1_Pos)                  /*!< 0x00000002 */
#define HSEM_ISR_ISEM1           HSEM_ISR_ISEM1_Msk                            /*!<semaphore 1 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM2_Pos       (2U)                                          
#define HSEM_ISR_ISEM2_Msk       (0x1U << HSEM_ISR_ISEM2_Pos)                  /*!< 0x00000004 */
#define HSEM_ISR_ISEM2           HSEM_ISR_ISEM2_Msk                            /*!<semaphore 2 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM3_Pos       (3U)                                          
#define HSEM_ISR_ISEM3_Msk       (0x1U << HSEM_ISR_ISEM3_Pos)                  /*!< 0x00000008 */
#define HSEM_ISR_ISEM3           HSEM_ISR_ISEM3_Msk                            /*!<semaphore 3 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM4_Pos       (4U)                                          
#define HSEM_ISR_ISEM4_Msk       (0x1U << HSEM_ISR_ISEM4_Pos)                  /*!< 0x00000010 */
#define HSEM_ISR_ISEM4           HSEM_ISR_ISEM4_Msk                            /*!<semaphore 4 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM5_Pos       (5U)                                          
#define HSEM_ISR_ISEM5_Msk       (0x1U << HSEM_ISR_ISEM5_Pos)                  /*!< 0x00000020 */
#define HSEM_ISR_ISEM5           HSEM_ISR_ISEM5_Msk                            /*!<semaphore 5 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM6_Pos       (6U)                                          
#define HSEM_ISR_ISEM6_Msk       (0x1U << HSEM_ISR_ISEM6_Pos)                  /*!< 0x00000040 */
#define HSEM_ISR_ISEM6           HSEM_ISR_ISEM6_Msk                            /*!<semaphore 6 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM7_Pos       (7U)                                          
#define HSEM_ISR_ISEM7_Msk       (0x1U << HSEM_ISR_ISEM7_Pos)                  /*!< 0x00000080 */
#define HSEM_ISR_ISEM7           HSEM_ISR_ISEM7_Msk                            /*!<semaphore 7 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM8_Pos       (8U)                                          
#define HSEM_ISR_ISEM8_Msk       (0x1U << HSEM_ISR_ISEM8_Pos)                  /*!< 0x00000100 */
#define HSEM_ISR_ISEM8           HSEM_ISR_ISEM8_Msk                            /*!<semaphore 8 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM9_Pos       (9U)                                          
#define HSEM_ISR_ISEM9_Msk       (0x1U << HSEM_ISR_ISEM9_Pos)                  /*!< 0x00000200 */
#define HSEM_ISR_ISEM9           HSEM_ISR_ISEM9_Msk                            /*!<semaphore 9 interrupt 0 status bit.  */
#define HSEM_ISR_ISEM10_Pos      (10U)                                         
#define HSEM_ISR_ISEM10_Msk      (0x1U << HSEM_ISR_ISEM10_Pos)                 /*!< 0x00000400 */
#define HSEM_ISR_ISEM10          HSEM_ISR_ISEM10_Msk                           /*!<semaphore 10 interrupt 0 status bit. */
#define HSEM_ISR_ISEM11_Pos      (11U)                                         
#define HSEM_ISR_ISEM11_Msk      (0x1U << HSEM_ISR_ISEM11_Pos)                 /*!< 0x00000800 */
#define HSEM_ISR_ISEM11          HSEM_ISR_ISEM11_Msk                           /*!<semaphore 11 interrupt 0 status bit. */
#define HSEM_ISR_ISEM12_Pos      (12U)                                         
#define HSEM_ISR_ISEM12_Msk      (0x1U << HSEM_ISR_ISEM12_Pos)                 /*!< 0x00001000 */
#define HSEM_ISR_ISEM12          HSEM_ISR_ISEM12_Msk                           /*!<semaphore 12 interrupt 0 status bit. */
#define HSEM_ISR_ISEM13_Pos      (13U)                                         
#define HSEM_ISR_ISEM13_Msk      (0x1U << HSEM_ISR_ISEM13_Pos)                 /*!< 0x00002000 */
#define HSEM_ISR_ISEM13          HSEM_ISR_ISEM13_Msk                           /*!<semaphore 13 interrupt 0 status bit. */
#define HSEM_ISR_ISEM14_Pos      (14U)                                         
#define HSEM_ISR_ISEM14_Msk      (0x1U << HSEM_ISR_ISEM14_Pos)                 /*!< 0x00004000 */
#define HSEM_ISR_ISEM14          HSEM_ISR_ISEM14_Msk                           /*!<semaphore 14 interrupt 0 status bit. */
#define HSEM_ISR_ISEM15_Pos      (15U)                                         
#define HSEM_ISR_ISEM15_Msk      (0x1U << HSEM_ISR_ISEM15_Pos)                 /*!< 0x00008000 */
#define HSEM_ISR_ISEM15          HSEM_ISR_ISEM15_Msk                           /*!<semaphore 15 interrupt 0 status bit. */
#define HSEM_ISR_ISEM16_Pos      (16U)                                         
#define HSEM_ISR_ISEM16_Msk      (0x1U << HSEM_ISR_ISEM16_Pos)                 /*!< 0x00010000 */
#define HSEM_ISR_ISEM16          HSEM_ISR_ISEM16_Msk                           /*!<semaphore 16 interrupt 0 status bit. */
#define HSEM_ISR_ISEM17_Pos      (17U)                                         
#define HSEM_ISR_ISEM17_Msk      (0x1U << HSEM_ISR_ISEM17_Pos)                 /*!< 0x00020000 */
#define HSEM_ISR_ISEM17          HSEM_ISR_ISEM17_Msk                           /*!<semaphore 17 interrupt 0 status bit. */
#define HSEM_ISR_ISEM18_Pos      (18U)                                         
#define HSEM_ISR_ISEM18_Msk      (0x1U << HSEM_ISR_ISEM18_Pos)                 /*!< 0x00040000 */
#define HSEM_ISR_ISEM18          HSEM_ISR_ISEM18_Msk                           /*!<semaphore 18 interrupt 0 status bit. */
#define HSEM_ISR_ISEM19_Pos      (19U)                                         
#define HSEM_ISR_ISEM19_Msk      (0x1U << HSEM_ISR_ISEM19_Pos)                 /*!< 0x00080000 */
#define HSEM_ISR_ISEM19          HSEM_ISR_ISEM19_Msk                           /*!<semaphore 19 interrupt 0 status bit. */
#define HSEM_ISR_ISEM20_Pos      (20U)                                         
#define HSEM_ISR_ISEM20_Msk      (0x1U << HSEM_ISR_ISEM20_Pos)                 /*!< 0x00100000 */
#define HSEM_ISR_ISEM20          HSEM_ISR_ISEM20_Msk                           /*!<semaphore 20 interrupt 0 status bit. */
#define HSEM_ISR_ISEM21_Pos      (21U)                                         
#define HSEM_ISR_ISEM21_Msk      (0x1U << HSEM_ISR_ISEM21_Pos)                 /*!< 0x00200000 */
#define HSEM_ISR_ISEM21          HSEM_ISR_ISEM21_Msk                           /*!<semaphore 21 interrupt 0 status bit. */
#define HSEM_ISR_ISEM22_Pos      (22U)                                         
#define HSEM_ISR_ISEM22_Msk      (0x1U << HSEM_ISR_ISEM22_Pos)                 /*!< 0x00400000 */
#define HSEM_ISR_ISEM22          HSEM_ISR_ISEM22_Msk                           /*!<semaphore 22 interrupt 0 status bit. */
#define HSEM_ISR_ISEM23_Pos      (23U)                                         
#define HSEM_ISR_ISEM23_Msk      (0x1U << HSEM_ISR_ISEM23_Pos)                 /*!< 0x00800000 */
#define HSEM_ISR_ISEM23          HSEM_ISR_ISEM23_Msk                           /*!<semaphore 23 interrupt 0 status bit. */
#define HSEM_ISR_ISEM24_Pos      (24U)                                         
#define HSEM_ISR_ISEM24_Msk      (0x1U << HSEM_ISR_ISEM24_Pos)                 /*!< 0x01000000 */
#define HSEM_ISR_ISEM24          HSEM_ISR_ISEM24_Msk                           /*!<semaphore 24 interrupt 0 status bit. */
#define HSEM_ISR_ISEM25_Pos      (25U)                                         
#define HSEM_ISR_ISEM25_Msk      (0x1U << HSEM_ISR_ISEM25_Pos)                 /*!< 0x02000000 */
#define HSEM_ISR_ISEM25          HSEM_ISR_ISEM25_Msk                           /*!<semaphore 25 interrupt 0 status bit. */
#define HSEM_ISR_ISEM26_Pos      (26U)                                         
#define HSEM_ISR_ISEM26_Msk      (0x1U << HSEM_ISR_ISEM26_Pos)                 /*!< 0x04000000 */
#define HSEM_ISR_ISEM26          HSEM_ISR_ISEM26_Msk                           /*!<semaphore 26 interrupt 0 status bit. */
#define HSEM_ISR_ISEM27_Pos      (27U)                                         
#define HSEM_ISR_ISEM27_Msk      (0x1U << HSEM_ISR_ISEM27_Pos)                 /*!< 0x08000000 */
#define HSEM_ISR_ISEM27          HSEM_ISR_ISEM27_Msk                           /*!<semaphore 27 interrupt 0 status bit. */
#define HSEM_ISR_ISEM28_Pos      (28U)                                         
#define HSEM_ISR_ISEM28_Msk      (0x1U << HSEM_ISR_ISEM28_Pos)                 /*!< 0x10000000 */
#define HSEM_ISR_ISEM28          HSEM_ISR_ISEM28_Msk                           /*!<semaphore 28 interrupt 0 status bit. */
#define HSEM_ISR_ISEM29_Pos      (29U)                                         
#define HSEM_ISR_ISEM29_Msk      (0x1U << HSEM_ISR_ISEM29_Pos)                 /*!< 0x20000000 */
#define HSEM_ISR_ISEM29          HSEM_ISR_ISEM29_Msk                           /*!<semaphore 29 interrupt 0 status bit. */
#define HSEM_ISR_ISEM30_Pos      (30U)                                         
#define HSEM_ISR_ISEM30_Msk      (0x1U << HSEM_ISR_ISEM30_Pos)                 /*!< 0x40000000 */
#define HSEM_ISR_ISEM30          HSEM_ISR_ISEM30_Msk                           /*!<semaphore 30 interrupt 0 status bit. */
#define HSEM_ISR_ISEM31_Pos      (31U)                                         
#define HSEM_ISR_ISEM31_Msk      (0x1U << HSEM_ISR_ISEM31_Pos)                 /*!< 0x80000000 */
#define HSEM_ISR_ISEM31          HSEM_ISR_ISEM31_Msk                           /*!<semaphore 31 interrupt 0 status bit. */

