bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for HSEM_MISR register  *****************/
#define HSEM_MISR_ISEM0_Pos      (0U)                                          
#define HSEM_MISR_ISEM0_Msk      (0x1U << HSEM_MISR_ISEM0_Pos)                 /*!< 0x00000001 */
#define HSEM_MISR_ISEM0          HSEM_MISR_ISEM0_Msk                           /*!<semaphore 0 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM1_Pos      (1U)                                          
#define HSEM_MISR_ISEM1_Msk      (0x1U << HSEM_MISR_ISEM1_Pos)                 /*!< 0x00000002 */
#define HSEM_MISR_ISEM1          HSEM_MISR_ISEM1_Msk                           /*!<semaphore 1 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM2_Pos      (2U)                                          
#define HSEM_MISR_ISEM2_Msk      (0x1U << HSEM_MISR_ISEM2_Pos)                 /*!< 0x00000004 */
#define HSEM_MISR_ISEM2          HSEM_MISR_ISEM2_Msk                           /*!<semaphore 2 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM3_Pos      (3U)                                          
#define HSEM_MISR_ISEM3_Msk      (0x1U << HSEM_MISR_ISEM3_Pos)                 /*!< 0x00000008 */
#define HSEM_MISR_ISEM3          HSEM_MISR_ISEM3_Msk                           /*!<semaphore 3 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM4_Pos      (4U)                                          
#define HSEM_MISR_ISEM4_Msk      (0x1U << HSEM_MISR_ISEM4_Pos)                 /*!< 0x00000010 */
#define HSEM_MISR_ISEM4          HSEM_MISR_ISEM4_Msk                           /*!<semaphore 4 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM5_Pos      (5U)                                          
#define HSEM_MISR_ISEM5_Msk      (0x1U << HSEM_MISR_ISEM5_Pos)                 /*!< 0x00000020 */
#define HSEM_MISR_ISEM5          HSEM_MISR_ISEM5_Msk                           /*!<semaphore 5 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM6_Pos      (6U)                                          
#define HSEM_MISR_ISEM6_Msk      (0x1U << HSEM_MISR_ISEM6_Pos)                 /*!< 0x00000040 */
#define HSEM_MISR_ISEM6          HSEM_MISR_ISEM6_Msk                           /*!<semaphore 6 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM7_Pos      (7U)                                          
#define HSEM_MISR_ISEM7_Msk      (0x1U << HSEM_MISR_ISEM7_Pos)                 /*!< 0x00000080 */
#define HSEM_MISR_ISEM7          HSEM_MISR_ISEM7_Msk                           /*!<semaphore 7 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM8_Pos      (8U)                                          
#define HSEM_MISR_ISEM8_Msk      (0x1U << HSEM_MISR_ISEM8_Pos)                 /*!< 0x00000100 */
#define HSEM_MISR_ISEM8          HSEM_MISR_ISEM8_Msk                           /*!<semaphore 8 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM9_Pos      (9U)                                          
#define HSEM_MISR_ISEM9_Msk      (0x1U << HSEM_MISR_ISEM9_Pos)                 /*!< 0x00000200 */
#define HSEM_MISR_ISEM9          HSEM_MISR_ISEM9_Msk                           /*!<semaphore 9 interrupt 0 masked status bit.  */
#define HSEM_MISR_ISEM10_Pos     (10U)                                         
#define HSEM_MISR_ISEM10_Msk     (0x1U << HSEM_MISR_ISEM10_Pos)                /*!< 0x00000400 */
#define HSEM_MISR_ISEM10         HSEM_MISR_ISEM10_Msk                          /*!<semaphore 10 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM11_Pos     (11U)                                         
#define HSEM_MISR_ISEM11_Msk     (0x1U << HSEM_MISR_ISEM11_Pos)                /*!< 0x00000800 */
#define HSEM_MISR_ISEM11         HSEM_MISR_ISEM11_Msk                          /*!<semaphore 11 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM12_Pos     (12U)                                         
#define HSEM_MISR_ISEM12_Msk     (0x1U << HSEM_MISR_ISEM12_Pos)                /*!< 0x00001000 */
#define HSEM_MISR_ISEM12         HSEM_MISR_ISEM12_Msk                          /*!<semaphore 12 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM13_Pos     (13U)                                         
#define HSEM_MISR_ISEM13_Msk     (0x1U << HSEM_MISR_ISEM13_Pos)                /*!< 0x00002000 */
#define HSEM_MISR_ISEM13         HSEM_MISR_ISEM13_Msk                          /*!<semaphore 13 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM14_Pos     (14U)                                         
#define HSEM_MISR_ISEM14_Msk     (0x1U << HSEM_MISR_ISEM14_Pos)                /*!< 0x00004000 */
#define HSEM_MISR_ISEM14         HSEM_MISR_ISEM14_Msk                          /*!<semaphore 14 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM15_Pos     (15U)                                         
#define HSEM_MISR_ISEM15_Msk     (0x1U << HSEM_MISR_ISEM15_Pos)                /*!< 0x00008000 */
#define HSEM_MISR_ISEM15         HSEM_MISR_ISEM15_Msk                          /*!<semaphore 15 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM16_Pos     (16U)                                         
#define HSEM_MISR_ISEM16_Msk     (0x1U << HSEM_MISR_ISEM16_Pos)                /*!< 0x00010000 */
#define HSEM_MISR_ISEM16         HSEM_MISR_ISEM16_Msk                          /*!<semaphore 16 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM17_Pos     (17U)                                         
#define HSEM_MISR_ISEM17_Msk     (0x1U << HSEM_MISR_ISEM17_Pos)                /*!< 0x00020000 */
#define HSEM_MISR_ISEM17         HSEM_MISR_ISEM17_Msk                          /*!<semaphore 17 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM18_Pos     (18U)                                         
#define HSEM_MISR_ISEM18_Msk     (0x1U << HSEM_MISR_ISEM18_Pos)                /*!< 0x00040000 */
#define HSEM_MISR_ISEM18         HSEM_MISR_ISEM18_Msk                          /*!<semaphore 18 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM19_Pos     (19U)                                         
#define HSEM_MISR_ISEM19_Msk     (0x1U << HSEM_MISR_ISEM19_Pos)                /*!< 0x00080000 */
#define HSEM_MISR_ISEM19         HSEM_MISR_ISEM19_Msk                          /*!<semaphore 19 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM20_Pos     (20U)                                         
#define HSEM_MISR_ISEM20_Msk     (0x1U << HSEM_MISR_ISEM20_Pos)                /*!< 0x00100000 */
#define HSEM_MISR_ISEM20         HSEM_MISR_ISEM20_Msk                          /*!<semaphore 20 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM21_Pos     (21U)                                         
#define HSEM_MISR_ISEM21_Msk     (0x1U << HSEM_MISR_ISEM21_Pos)                /*!< 0x00200000 */
#define HSEM_MISR_ISEM21         HSEM_MISR_ISEM21_Msk                          /*!<semaphore 21 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM22_Pos     (22U)                                         
#define HSEM_MISR_ISEM22_Msk     (0x1U << HSEM_MISR_ISEM22_Pos)                /*!< 0x00400000 */
#define HSEM_MISR_ISEM22         HSEM_MISR_ISEM22_Msk                          /*!<semaphore 22 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM23_Pos     (23U)                                         
#define HSEM_MISR_ISEM23_Msk     (0x1U << HSEM_MISR_ISEM23_Pos)                /*!< 0x00800000 */
#define HSEM_MISR_ISEM23         HSEM_MISR_ISEM23_Msk                          /*!<semaphore 23 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM24_Pos     (24U)                                         
#define HSEM_MISR_ISEM24_Msk     (0x1U << HSEM_MISR_ISEM24_Pos)                /*!< 0x01000000 */
#define HSEM_MISR_ISEM24         HSEM_MISR_ISEM24_Msk                          /*!<semaphore 24 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM25_Pos     (25U)                                         
#define HSEM_MISR_ISEM25_Msk     (0x1U << HSEM_MISR_ISEM25_Pos)                /*!< 0x02000000 */
#define HSEM_MISR_ISEM25         HSEM_MISR_ISEM25_Msk                          /*!<semaphore 25 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM26_Pos     (26U)                                         
#define HSEM_MISR_ISEM26_Msk     (0x1U << HSEM_MISR_ISEM26_Pos)                /*!< 0x04000000 */
#define HSEM_MISR_ISEM26         HSEM_MISR_ISEM26_Msk                          /*!<semaphore 26 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM27_Pos     (27U)                                         
#define HSEM_MISR_ISEM27_Msk     (0x1U << HSEM_MISR_ISEM27_Pos)                /*!< 0x08000000 */
#define HSEM_MISR_ISEM27         HSEM_MISR_ISEM27_Msk                          /*!<semaphore 27 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM28_Pos     (28U)                                         
#define HSEM_MISR_ISEM28_Msk     (0x1U << HSEM_MISR_ISEM28_Pos)                /*!< 0x10000000 */
#define HSEM_MISR_ISEM28         HSEM_MISR_ISEM28_Msk                          /*!<semaphore 28 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM29_Pos     (29U)                                         
#define HSEM_MISR_ISEM29_Msk     (0x1U << HSEM_MISR_ISEM29_Pos)                /*!< 0x20000000 */
#define HSEM_MISR_ISEM29         HSEM_MISR_ISEM29_Msk                          /*!<semaphore 29 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM30_Pos     (30U)                                         
#define HSEM_MISR_ISEM30_Msk     (0x1U << HSEM_MISR_ISEM30_Pos)                /*!< 0x40000000 */
#define HSEM_MISR_ISEM30         HSEM_MISR_ISEM30_Msk                          /*!<semaphore 30 interrupt 0 masked status bit. */
#define HSEM_MISR_ISEM31_Pos     (31U)                                         
#define HSEM_MISR_ISEM31_Msk     (0x1U << HSEM_MISR_ISEM31_Pos)                /*!< 0x80000000 */
#define HSEM_MISR_ISEM31         HSEM_MISR_ISEM31_Msk                          /*!<semaphore 31 interrupt 0 masked status bit. */

/********************  Bit definition for HSEM_CR register  *****************/
#define HSEM_CR_MASTERID_Pos     (8U)                                          
#define HSEM_CR_MASTERID_Msk     (0xFFU << HSEM_CR_MASTERID_Pos)               /*!< 0x0000FF00 */
#define HSEM_CR_MASTERID         HSEM_CR_MASTERID_Msk                          /*!<MasterID of semaphores to be cleared. */
#define HSEM_CR_KEY_Pos          (16U)                                         
#define HSEM_CR_KEY_Msk          (0xFFFFU << HSEM_CR_KEY_Pos)                  /*!< 0xFFFF0000 */
#define HSEM_CR_KEY              HSEM_CR_KEY_Msk                               /*!<semaphores clear key. */

/********************  Bit definition for HSEM_KEYR register  *****************/
#define HSEM_KEYR_KEY_Pos        (16U)                                         
#define HSEM_KEYR_KEY_Msk        (0xFFFFU << HSEM_KEYR_KEY_Pos)                /*!< 0xFFFF0000 */
#define HSEM_KEYR_KEY            HSEM_KEYR_KEY_Msk                             /*!<semaphores clear key. */

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT_Pos          (2U)                                         
#define HASH_CR_INIT_Msk          (0x1U << HASH_CR_INIT_Pos)                   /*!< 0x00000004 */
#define HASH_CR_INIT              HASH_CR_INIT_Msk                             
#define HASH_CR_DMAE_Pos          (3U)                                         
#define HASH_CR_DMAE_Msk          (0x1U << HASH_CR_DMAE_Pos)                   /*!< 0x00000008 */
#define HASH_CR_DMAE              HASH_CR_DMAE_Msk                             
#define HASH_CR_DATATYPE_Pos      (4U)                                         
#define HASH_CR_DATATYPE_Msk      (0x3U << HASH_CR_DATATYPE_Pos)               /*!< 0x00000030 */
#define HASH_CR_DATATYPE          HASH_CR_DATATYPE_Msk                         
#define HASH_CR_DATATYPE_0        (0x1U << HASH_CR_DATATYPE_Pos)               /*!< 0x00000010 */
#define HASH_CR_DATATYPE_1        (0x2U << HASH_CR_DATATYPE_Pos)               /*!< 0x00000020 */
#define HASH_CR_MODE_Pos          (6U)                                         
#define HASH_CR_MODE_Msk          (0x1U << HASH_CR_MODE_Pos)                   /*!< 0x00000040 */
#define HASH_CR_MODE              HASH_CR_MODE_Msk                             
#define HASH_CR_ALGO_Pos          (7U)                                         
#define HASH_CR_ALGO_Msk          (0x801U << HASH_CR_ALGO_Pos)                 /*!< 0x00040080 */
#define HASH_CR_ALGO              HASH_CR_ALGO_Msk                             
#define HASH_CR_ALGO_0            (0x001U << HASH_CR_ALGO_Pos)                 /*!< 0x00000080 */
#define HASH_CR_ALGO_1            (0x800U << HASH_CR_ALGO_Pos)                 /*!< 0x00040000 */
#define HASH_CR_NBW_Pos           (8U)                                         
#define HASH_CR_NBW_Msk           (0xFU << HASH_CR_NBW_Pos)                    /*!< 0x00000F00 */
#define HASH_CR_NBW               HASH_CR_NBW_Msk                              
#define HASH_CR_NBW_0             (0x1U << HASH_CR_NBW_Pos)                    /*!< 0x00000100 */
#define HASH_CR_NBW_1             (0x2U << HASH_CR_NBW_Pos)                    /*!< 0x00000200 */
#define HASH_CR_NBW_2             (0x4U << HASH_CR_NBW_Pos)                    /*!< 0x00000400 */
#define HASH_CR_NBW_3             (0x8U << HASH_CR_NBW_Pos)                    /*!< 0x00000800 */
#define HASH_CR_DINNE_Pos         (12U)                                        
#define HASH_CR_DINNE_Msk         (0x1U << HASH_CR_DINNE_Pos)                  /*!< 0x00001000 */
#define HASH_CR_DINNE             HASH_CR_DINNE_Msk                            
#define HASH_CR_MDMAT_Pos         (13U)                                        
#define HASH_CR_MDMAT_Msk         (0x1U << HASH_CR_MDMAT_Pos)                  /*!< 0x00002000 */
#define HASH_CR_MDMAT             HASH_CR_MDMAT_Msk                            
#define HASH_CR_LKEY_Pos          (16U)                                        
#define HASH_CR_LKEY_Msk          (0x1U << HASH_CR_LKEY_Pos)                   /*!< 0x00010000 */
#define HASH_CR_LKEY              HASH_CR_LKEY_Msk                             

