bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define RCC_CR_HSIDIVF_Pos                     (5U)                            
#define RCC_CR_HSIDIVF_Msk                     (0x1U << RCC_CR_HSIDIVF_Pos)    /*!< 0x00000020 */
#define RCC_CR_HSIDIVF                         RCC_CR_HSIDIVF_Msk              /*!< HSI Divider flag */
#define RCC_CR_CSION_Pos                       (7U)                            
#define RCC_CR_CSION_Msk                       (0x1U << RCC_CR_CSION_Pos)      /*!< 0x00000080 */
#define RCC_CR_CSION                           RCC_CR_CSION_Msk                /*!< The Internal RC 4MHz oscillator clock enable */
#define RCC_CR_CSIRDY_Pos                      (8U)                            
#define RCC_CR_CSIRDY_Msk                      (0x1U << RCC_CR_CSIRDY_Pos)     /*!< 0x00000100 */
#define RCC_CR_CSIRDY                          RCC_CR_CSIRDY_Msk               /*!< The Internal RC 4MHz oscillator clock ready */
#define RCC_CR_CSIKERON_Pos                    (9U)                            
#define RCC_CR_CSIKERON_Msk                    (0x1U << RCC_CR_CSIKERON_Pos)   /*!< 0x00000200 */
#define RCC_CR_CSIKERON                        RCC_CR_CSIKERON_Msk             /*!< Internal RC 4MHz oscillator clock enable for some IPs Kernel */
#define RCC_CR_HSI48ON_Pos                     (12U)                           
#define RCC_CR_HSI48ON_Msk                     (0x1U << RCC_CR_HSI48ON_Pos)    /*!< 0x00001000 */
#define RCC_CR_HSI48ON                         RCC_CR_HSI48ON_Msk              /*!< HSI48 clock enable clock enable  */
#define RCC_CR_HSI48RDY_Pos                    (13U)                           
#define RCC_CR_HSI48RDY_Msk                    (0x1U << RCC_CR_HSI48RDY_Pos)   /*!< 0x00002000 */
#define RCC_CR_HSI48RDY                        RCC_CR_HSI48RDY_Msk             /*!< HSI48 clock ready */

#define RCC_CR_D1CKRDY_Pos                     (14U)                           
#define RCC_CR_D1CKRDY_Msk                     (0x1U << RCC_CR_D1CKRDY_Pos)    /*!< 0x00004000 */
#define RCC_CR_D1CKRDY                         RCC_CR_D1CKRDY_Msk              /*!< D1 domain clocks ready flag  */
#define RCC_CR_D2CKRDY_Pos                     (15U)                           
#define RCC_CR_D2CKRDY_Msk                     (0x1U << RCC_CR_D2CKRDY_Pos)    /*!< 0x00008000 */
#define RCC_CR_D2CKRDY                         RCC_CR_D2CKRDY_Msk              /*!< D2 domain clocks ready flag */

#define RCC_CR_HSEON_Pos                       (16U)                           
#define RCC_CR_HSEON_Msk                       (0x1U << RCC_CR_HSEON_Pos)      /*!< 0x00010000 */
#define RCC_CR_HSEON                           RCC_CR_HSEON_Msk                /*!< External High Speed clock enable */
#define RCC_CR_HSERDY_Pos                      (17U)                           
#define RCC_CR_HSERDY_Msk                      (0x1U << RCC_CR_HSERDY_Pos)     /*!< 0x00020000 */
#define RCC_CR_HSERDY                          RCC_CR_HSERDY_Msk               /*!< External High Speed clock ready */
#define RCC_CR_HSEBYP_Pos                      (18U)                           
#define RCC_CR_HSEBYP_Msk                      (0x1U << RCC_CR_HSEBYP_Pos)     /*!< 0x00040000 */
#define RCC_CR_HSEBYP                          RCC_CR_HSEBYP_Msk               /*!< External High Speed clock Bypass */
#define RCC_CR_CSSHSEON_Pos                    (19U)                           
#define RCC_CR_CSSHSEON_Msk                    (0x1U << RCC_CR_CSSHSEON_Pos)   /*!< 0x00080000 */
#define RCC_CR_CSSHSEON                        RCC_CR_CSSHSEON_Msk             /*!< HSE Clock security System enable */

#define RCC_CR_PLL1ON_Pos                      (24U)                           
#define RCC_CR_PLL1ON_Msk                      (0x1U << RCC_CR_PLL1ON_Pos)     /*!< 0x01000000 */
#define RCC_CR_PLL1ON                          RCC_CR_PLL1ON_Msk               /*!< System PLL1 clock enable */
#define RCC_CR_PLL1RDY_Pos                     (25U)                           
#define RCC_CR_PLL1RDY_Msk                     (0x1U << RCC_CR_PLL1RDY_Pos)    /*!< 0x02000000 */
#define RCC_CR_PLL1RDY                         RCC_CR_PLL1RDY_Msk              /*!< System PLL1 clock ready */
#define RCC_CR_PLL2ON_Pos                      (26U)                           
#define RCC_CR_PLL2ON_Msk                      (0x1U << RCC_CR_PLL2ON_Pos)     /*!< 0x04000000 */
#define RCC_CR_PLL2ON                          RCC_CR_PLL2ON_Msk               /*!< System PLL2 clock enable */
#define RCC_CR_PLL2RDY_Pos                     (27U)                           
#define RCC_CR_PLL2RDY_Msk                     (0x1U << RCC_CR_PLL2RDY_Pos)    /*!< 0x08000000 */
#define RCC_CR_PLL2RDY                         RCC_CR_PLL2RDY_Msk              /*!< System PLL2 clock ready */
#define RCC_CR_PLL3ON_Pos                      (28U)                           
#define RCC_CR_PLL3ON_Msk                      (0x1U << RCC_CR_PLL3ON_Pos)     /*!< 0x10000000 */
#define RCC_CR_PLL3ON                          RCC_CR_PLL3ON_Msk               /*!< System PLL3 clock enable */
#define RCC_CR_PLL3RDY_Pos                     (29U)                           
#define RCC_CR_PLL3RDY_Msk                     (0x1U << RCC_CR_PLL3RDY_Pos)    /*!< 0x20000000 */
#define RCC_CR_PLL3RDY                         RCC_CR_PLL3RDY_Msk              /*!< System PLL3 clock ready */

/*Legacy */
#define RCC_CR_PLLON_Pos                       (24U)                           
#define RCC_CR_PLLON_Msk                       (0x1U << RCC_CR_PLLON_Pos)      /*!< 0x01000000 */
#define RCC_CR_PLLON                           RCC_CR_PLLON_Msk                /*!< System PLL clock enable */
#define RCC_CR_PLLRDY_Pos                      (25U)                           
#define RCC_CR_PLLRDY_Msk                      (0x1U << RCC_CR_PLLRDY_Pos)     /*!< 0x02000000 */
#define RCC_CR_PLLRDY                          RCC_CR_PLLRDY_Msk               /*!< System PLL clock ready */
/********************  Bit definition for RCC_ICSCR register  ***************/
/*!< HSICAL configuration */
#define RCC_ICSCR_HSICAL_Pos                   (0U)                            
#define RCC_ICSCR_HSICAL_Msk                   (0xFFFU << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000FFF */
#define RCC_ICSCR_HSICAL                       RCC_ICSCR_HSICAL_Msk            /*!< HSICAL[11:0] bits */
#define RCC_ICSCR_HSICAL_0                     (0x001U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000001 */
#define RCC_ICSCR_HSICAL_1                     (0x002U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000002 */
#define RCC_ICSCR_HSICAL_2                     (0x004U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000004 */
#define RCC_ICSCR_HSICAL_3                     (0x008U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000008 */
#define RCC_ICSCR_HSICAL_4                     (0x010U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000010 */
#define RCC_ICSCR_HSICAL_5                     (0x020U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000020 */
#define RCC_ICSCR_HSICAL_6                     (0x040U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000040 */
#define RCC_ICSCR_HSICAL_7                     (0x080U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000080 */
#define RCC_ICSCR_HSICAL_8                     (0x100U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000100 */
#define RCC_ICSCR_HSICAL_9                     (0x200U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000200 */
#define RCC_ICSCR_HSICAL_10                    (0x400U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000400 */
#define RCC_ICSCR_HSICAL_11                    (0x800U << RCC_ICSCR_HSICAL_Pos) /*!< 0x00000800 */

/*!< HSITRIM configuration */
#define RCC_ICSCR_HSITRIM_Pos                  (12U)                           
#define RCC_ICSCR_HSITRIM_Msk                  (0x3FU << RCC_ICSCR_HSITRIM_Pos) /*!< 0x0003F000 */
#define RCC_ICSCR_HSITRIM                      RCC_ICSCR_HSITRIM_Msk           /*!< HSITRIM[5:0] bits */
#define RCC_ICSCR_HSITRIM_0                    (0x01U << RCC_ICSCR_HSITRIM_Pos) /*!< 0x00001000 */
#define RCC_ICSCR_HSITRIM_1                    (0x02U << RCC_ICSCR_HSITRIM_Pos) /*!< 0x00002000 */
#define RCC_ICSCR_HSITRIM_2                    (0x04U << RCC_ICSCR_HSITRIM_Pos) /*!< 0x00004000 */
#define RCC_ICSCR_HSITRIM_3                    (0x08U << RCC_ICSCR_HSITRIM_Pos) /*!< 0x00008000 */
#define RCC_ICSCR_HSITRIM_4                    (0x10U << RCC_ICSCR_HSITRIM_Pos) /*!< 0x00010000 */
#define RCC_ICSCR_HSITRIM_5                    (0x20U << RCC_ICSCR_HSITRIM_Pos) /*!< 0x00020000 */


/*!< CSICAL configuration */
#define RCC_ICSCR_CSICAL_Pos                   (18U)                           
#define RCC_ICSCR_CSICAL_Msk                   (0xFFU << RCC_ICSCR_CSICAL_Pos) /*!< 0x03FC0000 */
#define RCC_ICSCR_CSICAL                       RCC_ICSCR_CSICAL_Msk            /*!< CSICAL[7:0] bits */
#define RCC_ICSCR_CSICAL_0                     (0x01U << RCC_ICSCR_CSICAL_Pos) /*!< 0x00040000 */
#define RCC_ICSCR_CSICAL_1                     (0x02U << RCC_ICSCR_CSICAL_Pos) /*!< 0x00080000 */
#define RCC_ICSCR_CSICAL_2                     (0x04U << RCC_ICSCR_CSICAL_Pos) /*!< 0x00100000 */
#define RCC_ICSCR_CSICAL_3                     (0x08U << RCC_ICSCR_CSICAL_Pos) /*!< 0x00200000 */
#define RCC_ICSCR_CSICAL_4                     (0x10U << RCC_ICSCR_CSICAL_Pos) /*!< 0x00400000 */
#define RCC_ICSCR_CSICAL_5                     (0x20U << RCC_ICSCR_CSICAL_Pos) /*!< 0x00800000 */
#define RCC_ICSCR_CSICAL_6                     (0x40U << RCC_ICSCR_CSICAL_Pos) /*!< 0x01000000 */
#define RCC_ICSCR_CSICAL_7                     (0x80U << RCC_ICSCR_CSICAL_Pos) /*!< 0x02000000 */

