bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/*!< CSITRIM configuration */
#define RCC_ICSCR_CSITRIM_Pos                  (26U)                           
#define RCC_ICSCR_CSITRIM_Msk                  (0x1FU << RCC_ICSCR_CSITRIM_Pos) /*!< 0x7C000000 */
#define RCC_ICSCR_CSITRIM                      RCC_ICSCR_CSITRIM_Msk           /*!< CSITRIM[4:0] bits */
#define RCC_ICSCR_CSITRIM_0                    (0x01U << RCC_ICSCR_CSITRIM_Pos) /*!< 0x04000000 */
#define RCC_ICSCR_CSITRIM_1                    (0x02U << RCC_ICSCR_CSITRIM_Pos) /*!< 0x08000000 */
#define RCC_ICSCR_CSITRIM_2                    (0x04U << RCC_ICSCR_CSITRIM_Pos) /*!< 0x10000000 */
#define RCC_ICSCR_CSITRIM_3                    (0x08U << RCC_ICSCR_CSITRIM_Pos) /*!< 0x20000000 */
#define RCC_ICSCR_CSITRIM_4                    (0x10U << RCC_ICSCR_CSITRIM_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_CRRCR register  *****************/

/*!< HSI48CAL configuration */
#define RCC_CRRCR_HSI48CAL_Pos                 (0U)                            
#define RCC_CRRCR_HSI48CAL_Msk                 (0x3FFU << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x000003FF */
#define RCC_CRRCR_HSI48CAL                     RCC_CRRCR_HSI48CAL_Msk          /*!< HSI48CAL[9:0] bits */
#define RCC_CRRCR_HSI48CAL_0                   (0x001U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000001 */
#define RCC_CRRCR_HSI48CAL_1                   (0x002U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000002 */
#define RCC_CRRCR_HSI48CAL_2                   (0x004U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000004 */
#define RCC_CRRCR_HSI48CAL_3                   (0x008U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000008 */
#define RCC_CRRCR_HSI48CAL_4                   (0x010U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000010 */
#define RCC_CRRCR_HSI48CAL_5                   (0x020U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000020 */
#define RCC_CRRCR_HSI48CAL_6                   (0x040U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000040 */
#define RCC_CRRCR_HSI48CAL_7                   (0x080U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_8                   (0x100U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000100 */
#define RCC_CRRCR_HSI48CAL_9                   (0x200U << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000200 */


/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define RCC_CFGR_SW                            ((uint32_t)0x00000007)          /*!< SW[2:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0                          ((uint32_t)0x00000001)          /*!<Bit 0 */
#define RCC_CFGR_SW_1                          ((uint32_t)0x00000002)          /*!<Bit 1 */
#define RCC_CFGR_SW_2                          ((uint32_t)0x00000004)          /*!<Bit 2 */

#define RCC_CFGR_SW_HSI                        ((uint32_t)0x00000000)          /*!< HSI selection as system clock */
#define RCC_CFGR_SW_CSI                        ((uint32_t)0x00000001)          /*!< CSI selection as system clock */
#define RCC_CFGR_SW_HSE                        ((uint32_t)0x00000002)          /*!< HSE selection as system clock */
#define RCC_CFGR_SW_PLL1                       ((uint32_t)0x00000003)          /*!< PLL1 selection as system clock */

/*!< SWS configuration */
#define RCC_CFGR_SWS                           ((uint32_t)0x00000038)          /*!< SWS[2:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0                         ((uint32_t)0x00000008)          /*!<Bit 0 */
#define RCC_CFGR_SWS_1                         ((uint32_t)0x00000010)          /*!<Bit 1 */
#define RCC_CFGR_SWS_2                         ((uint32_t)0x00000020)          /*!<Bit 2 */

#define RCC_CFGR_SWS_HSI                       ((uint32_t)0x00000000)          /*!< HSI used as system clock */
#define RCC_CFGR_SWS_CSI                       ((uint32_t)0x00000008)          /*!< CSI used as system clock */
#define RCC_CFGR_SWS_HSE                       ((uint32_t)0x00000010)          /*!< HSE used as system clock */
#define RCC_CFGR_SWS_PLL1                      ((uint32_t)0x00000018)          /*!< PLL1 used as system clock */

#define RCC_CFGR_STOPWUCK                      ((uint32_t)0x00000040)          /*!< Wake Up from stop and CSS backup clock selection */
#define RCC_CFGR_STOPKERWUCK                   ((uint32_t)0x00000080)          /*!< Kernel Clock Selection after a Wake Up from STOP */

/*!< RTCPRE configuration */
#define RCC_CFGR_RTCPRE                        ((uint32_t)0x00003F00)          
#define RCC_CFGR_RTCPRE_0                      ((uint32_t)0x00000100)          
#define RCC_CFGR_RTCPRE_1                      ((uint32_t)0x00000200)          
#define RCC_CFGR_RTCPRE_2                      ((uint32_t)0x00000400)          
#define RCC_CFGR_RTCPRE_3                      ((uint32_t)0x00000800)          
#define RCC_CFGR_RTCPRE_4                      ((uint32_t)0x00001000)          
#define RCC_CFGR_RTCPRE_5                      ((uint32_t)0x00002000)          

#define RCC_CFGR_HRTIMSEL                      ((uint32_t)0x00004000)          
#define RCC_CFGR_TIMPRE                        ((uint32_t)0x00008000)          


/*!< MCO1 configuration */
#define RCC_CFGR_MCO1                          ((uint32_t)0x01C00000)          
#define RCC_CFGR_MCO1_0                        ((uint32_t)0x00400000)          
#define RCC_CFGR_MCO1_1                        ((uint32_t)0x00800000)          
#define RCC_CFGR_MCO1_2                        ((uint32_t)0x01000000)          

#define RCC_CFGR_MCO1PRE                       ((uint32_t)0x003C0000)          
#define RCC_CFGR_MCO1PRE_0                     ((uint32_t)0x00040000)          
#define RCC_CFGR_MCO1PRE_1                     ((uint32_t)0x00080000)          
#define RCC_CFGR_MCO1PRE_2                     ((uint32_t)0x00100000)          
#define RCC_CFGR_MCO1PRE_3                     ((uint32_t)0x00200000)          

#define RCC_CFGR_MCO2PRE                       ((uint32_t)0x1E000000)          
#define RCC_CFGR_MCO2PRE_0                     ((uint32_t)0x02000000)          
#define RCC_CFGR_MCO2PRE_1                     ((uint32_t)0x04000000)          
#define RCC_CFGR_MCO2PRE_2                     ((uint32_t)0x08000000)          
#define RCC_CFGR_MCO2PRE_3                     ((uint32_t)0x10000000)          

#define RCC_CFGR_MCO2                          ((uint32_t)0xE0000000)          
#define RCC_CFGR_MCO2_0                        ((uint32_t)0x20000000)          
#define RCC_CFGR_MCO2_1                        ((uint32_t)0x40000000)          
#define RCC_CFGR_MCO2_2                        ((uint32_t)0x80000000)          

/********************  Bit definition for RCC_D1CFGR register  ******************/
/*!< D1HPRE configuration */
#define RCC_D1CFGR_HPRE_Pos                    (0U)                            
#define RCC_D1CFGR_HPRE_Msk                    (0xFU << RCC_D1CFGR_HPRE_Pos)   /*!< 0x0000000F */
#define RCC_D1CFGR_HPRE                        RCC_D1CFGR_HPRE_Msk             /*!< HPRE[3:0] bits (AHB3 prescaler) */
#define RCC_D1CFGR_HPRE_0                      (0x1U << RCC_D1CFGR_HPRE_Pos)   /*!< 0x00000001 */
#define RCC_D1CFGR_HPRE_1                      (0x2U << RCC_D1CFGR_HPRE_Pos)   /*!< 0x00000002 */
#define RCC_D1CFGR_HPRE_2                      (0x4U << RCC_D1CFGR_HPRE_Pos)   /*!< 0x00000004 */
#define RCC_D1CFGR_HPRE_3                      (0x8U << RCC_D1CFGR_HPRE_Pos)   /*!< 0x00000008 */


#define RCC_D1CFGR_HPRE_DIV1                   ((uint32_t)0x00000000)          /*!< AHB3 Clock not divided */
#define RCC_D1CFGR_HPRE_DIV2_Pos               (3U)                            
#define RCC_D1CFGR_HPRE_DIV2_Msk               (0x1U << RCC_D1CFGR_HPRE_DIV2_Pos) /*!< 0x00000008 */
#define RCC_D1CFGR_HPRE_DIV2                   RCC_D1CFGR_HPRE_DIV2_Msk        /*!< AHB3 Clock divided by 2 */
#define RCC_D1CFGR_HPRE_DIV4_Pos               (0U)                            
#define RCC_D1CFGR_HPRE_DIV4_Msk               (0x9U << RCC_D1CFGR_HPRE_DIV4_Pos) /*!< 0x00000009 */
#define RCC_D1CFGR_HPRE_DIV4                   RCC_D1CFGR_HPRE_DIV4_Msk        /*!< AHB3 Clock divided by 4 */
#define RCC_D1CFGR_HPRE_DIV8_Pos               (1U)                            
#define RCC_D1CFGR_HPRE_DIV8_Msk               (0x5U << RCC_D1CFGR_HPRE_DIV8_Pos) /*!< 0x0000000A */
#define RCC_D1CFGR_HPRE_DIV8                   RCC_D1CFGR_HPRE_DIV8_Msk        /*!< AHB3 Clock divided by 8 */
#define RCC_D1CFGR_HPRE_DIV16_Pos              (0U)                            
#define RCC_D1CFGR_HPRE_DIV16_Msk              (0xBU << RCC_D1CFGR_HPRE_DIV16_Pos) /*!< 0x0000000B */
#define RCC_D1CFGR_HPRE_DIV16                  RCC_D1CFGR_HPRE_DIV16_Msk       /*!< AHB3 Clock divided by 16 */
#define RCC_D1CFGR_HPRE_DIV64_Pos              (2U)                            
#define RCC_D1CFGR_HPRE_DIV64_Msk              (0x3U << RCC_D1CFGR_HPRE_DIV64_Pos) /*!< 0x0000000C */
#define RCC_D1CFGR_HPRE_DIV64                  RCC_D1CFGR_HPRE_DIV64_Msk       /*!< AHB3 Clock divided by 64 */
#define RCC_D1CFGR_HPRE_DIV128_Pos             (0U)                            
#define RCC_D1CFGR_HPRE_DIV128_Msk             (0xDU << RCC_D1CFGR_HPRE_DIV128_Pos) /*!< 0x0000000D */
#define RCC_D1CFGR_HPRE_DIV128                 RCC_D1CFGR_HPRE_DIV128_Msk      /*!< AHB3 Clock divided by 128 */
#define RCC_D1CFGR_HPRE_DIV256_Pos             (1U)                            
#define RCC_D1CFGR_HPRE_DIV256_Msk             (0x7U << RCC_D1CFGR_HPRE_DIV256_Pos) /*!< 0x0000000E */
#define RCC_D1CFGR_HPRE_DIV256                 RCC_D1CFGR_HPRE_DIV256_Msk      /*!< AHB3 Clock divided by 256 */
#define RCC_D1CFGR_HPRE_DIV512_Pos             (0U)                            
#define RCC_D1CFGR_HPRE_DIV512_Msk             (0xFU << RCC_D1CFGR_HPRE_DIV512_Pos) /*!< 0x0000000F */
#define RCC_D1CFGR_HPRE_DIV512                 RCC_D1CFGR_HPRE_DIV512_Msk      /*!< AHB3 Clock divided by 512 */

/*!< D1PPRE configuration */
#define RCC_D1CFGR_D1PPRE_Pos                  (4U)                            
#define RCC_D1CFGR_D1PPRE_Msk                  (0x7U << RCC_D1CFGR_D1PPRE_Pos) /*!< 0x00000070 */
#define RCC_D1CFGR_D1PPRE                      RCC_D1CFGR_D1PPRE_Msk           /*!< D1PRE[2:0] bits (APB3 prescaler) */
#define RCC_D1CFGR_D1PPRE_0                    (0x1U << RCC_D1CFGR_D1PPRE_Pos) /*!< 0x00000010 */
#define RCC_D1CFGR_D1PPRE_1                    (0x2U << RCC_D1CFGR_D1PPRE_Pos) /*!< 0x00000020 */
#define RCC_D1CFGR_D1PPRE_2                    (0x4U << RCC_D1CFGR_D1PPRE_Pos) /*!< 0x00000040 */

