bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for RCC_PLL2DIVR register  ***************/
#define RCC_PLL2DIVR_N2_Pos                    (0U)                            
#define RCC_PLL2DIVR_N2_Msk                    (0x1FFU << RCC_PLL2DIVR_N2_Pos) /*!< 0x000001FF */
#define RCC_PLL2DIVR_N2                        RCC_PLL2DIVR_N2_Msk             
#define RCC_PLL2DIVR_P2_Pos                    (9U)                            
#define RCC_PLL2DIVR_P2_Msk                    (0x7FU << RCC_PLL2DIVR_P2_Pos)  /*!< 0x0000FE00 */
#define RCC_PLL2DIVR_P2                        RCC_PLL2DIVR_P2_Msk             
#define RCC_PLL2DIVR_Q2_Pos                    (16U)                           
#define RCC_PLL2DIVR_Q2_Msk                    (0x7FU << RCC_PLL2DIVR_Q2_Pos)  /*!< 0x007F0000 */
#define RCC_PLL2DIVR_Q2                        RCC_PLL2DIVR_Q2_Msk             
#define RCC_PLL2DIVR_R2_Pos                    (24U)                           
#define RCC_PLL2DIVR_R2_Msk                    (0x7FU << RCC_PLL2DIVR_R2_Pos)  /*!< 0x7F000000 */
#define RCC_PLL2DIVR_R2                        RCC_PLL2DIVR_R2_Msk             

/********************  Bit definition for RCC_PLL2FRACR register  ***************/
#define RCC_PLL2FRACR_FRACN2_Pos               (3U)                            
#define RCC_PLL2FRACR_FRACN2_Msk               (0x1FFFU << RCC_PLL2FRACR_FRACN2_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL2FRACR_FRACN2                   RCC_PLL2FRACR_FRACN2_Msk        

/********************  Bit definition for RCC_PLL3DIVR register  ***************/
#define RCC_PLL3DIVR_N3_Pos                    (0U)                            
#define RCC_PLL3DIVR_N3_Msk                    (0x1FFU << RCC_PLL3DIVR_N3_Pos) /*!< 0x000001FF */
#define RCC_PLL3DIVR_N3                        RCC_PLL3DIVR_N3_Msk             
#define RCC_PLL3DIVR_P3_Pos                    (9U)                            
#define RCC_PLL3DIVR_P3_Msk                    (0x7FU << RCC_PLL3DIVR_P3_Pos)  /*!< 0x0000FE00 */
#define RCC_PLL3DIVR_P3                        RCC_PLL3DIVR_P3_Msk             
#define RCC_PLL3DIVR_Q3_Pos                    (16U)                           
#define RCC_PLL3DIVR_Q3_Msk                    (0x7FU << RCC_PLL3DIVR_Q3_Pos)  /*!< 0x007F0000 */
#define RCC_PLL3DIVR_Q3                        RCC_PLL3DIVR_Q3_Msk             
#define RCC_PLL3DIVR_R3_Pos                    (24U)                           
#define RCC_PLL3DIVR_R3_Msk                    (0x7FU << RCC_PLL3DIVR_R3_Pos)  /*!< 0x7F000000 */
#define RCC_PLL3DIVR_R3                        RCC_PLL3DIVR_R3_Msk             

/********************  Bit definition for RCC_PLL3FRACR register  ***************/
#define RCC_PLL3FRACR_FRACN3_Pos               (3U)                            
#define RCC_PLL3FRACR_FRACN3_Msk               (0x1FFFU << RCC_PLL3FRACR_FRACN3_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL3FRACR_FRACN3                   RCC_PLL3FRACR_FRACN3_Msk        

/********************  Bit definition for RCC_D1CCIPR register  ***************/
#define RCC_D1CCIPR_FMCSEL_Pos                 (0U)                            
#define RCC_D1CCIPR_FMCSEL_Msk                 (0x3U << RCC_D1CCIPR_FMCSEL_Pos) /*!< 0x00000003 */
#define RCC_D1CCIPR_FMCSEL                     RCC_D1CCIPR_FMCSEL_Msk          
#define RCC_D1CCIPR_FMCSEL_0                   (0x1U << RCC_D1CCIPR_FMCSEL_Pos) /*!< 0x00000001 */
#define RCC_D1CCIPR_FMCSEL_1                   (0x2U << RCC_D1CCIPR_FMCSEL_Pos) /*!< 0x00000002 */
#define RCC_D1CCIPR_QSPISEL_Pos                (4U)                            
#define RCC_D1CCIPR_QSPISEL_Msk                (0x3U << RCC_D1CCIPR_QSPISEL_Pos) /*!< 0x00000030 */
#define RCC_D1CCIPR_QSPISEL                    RCC_D1CCIPR_QSPISEL_Msk         
#define RCC_D1CCIPR_QSPISEL_0                  (0x1U << RCC_D1CCIPR_QSPISEL_Pos) /*!< 0x00000010 */
#define RCC_D1CCIPR_QSPISEL_1                  (0x2U << RCC_D1CCIPR_QSPISEL_Pos) /*!< 0x00000020 */
#define RCC_D1CCIPR_SDMMCSEL_Pos               (16U)                           
#define RCC_D1CCIPR_SDMMCSEL_Msk               (0x1U << RCC_D1CCIPR_SDMMCSEL_Pos) /*!< 0x00010000 */
#define RCC_D1CCIPR_SDMMCSEL                   RCC_D1CCIPR_SDMMCSEL_Msk        
#define RCC_D1CCIPR_CKPERSEL_Pos               (28U)                           
#define RCC_D1CCIPR_CKPERSEL_Msk               (0x3U << RCC_D1CCIPR_CKPERSEL_Pos) /*!< 0x30000000 */
#define RCC_D1CCIPR_CKPERSEL                   RCC_D1CCIPR_CKPERSEL_Msk        
#define RCC_D1CCIPR_CKPERSEL_0                 (0x1U << RCC_D1CCIPR_CKPERSEL_Pos) /*!< 0x10000000 */
#define RCC_D1CCIPR_CKPERSEL_1                 (0x2U << RCC_D1CCIPR_CKPERSEL_Pos) /*!< 0x20000000 */

/********************  Bit definition for RCC_D2CCIP1R register  ***************/
#define RCC_D2CCIP1R_SAI1SEL_Pos               (0U)                            
#define RCC_D2CCIP1R_SAI1SEL_Msk               (0x7U << RCC_D2CCIP1R_SAI1SEL_Pos) /*!< 0x00000007 */
#define RCC_D2CCIP1R_SAI1SEL                   RCC_D2CCIP1R_SAI1SEL_Msk        
#define RCC_D2CCIP1R_SAI1SEL_0                 (0x1U << RCC_D2CCIP1R_SAI1SEL_Pos) /*!< 0x00000001 */
#define RCC_D2CCIP1R_SAI1SEL_1                 (0x2U << RCC_D2CCIP1R_SAI1SEL_Pos) /*!< 0x00000002 */
#define RCC_D2CCIP1R_SAI1SEL_2                 (0x4U << RCC_D2CCIP1R_SAI1SEL_Pos) /*!< 0x00000004 */

#define RCC_D2CCIP1R_SAI23SEL_Pos              (6U)                            
#define RCC_D2CCIP1R_SAI23SEL_Msk              (0x7U << RCC_D2CCIP1R_SAI23SEL_Pos) /*!< 0x000001C0 */
#define RCC_D2CCIP1R_SAI23SEL                  RCC_D2CCIP1R_SAI23SEL_Msk       
#define RCC_D2CCIP1R_SAI23SEL_0                (0x1U << RCC_D2CCIP1R_SAI23SEL_Pos) /*!< 0x00000040 */
#define RCC_D2CCIP1R_SAI23SEL_1                (0x2U << RCC_D2CCIP1R_SAI23SEL_Pos) /*!< 0x00000080 */
#define RCC_D2CCIP1R_SAI23SEL_2                (0x4U << RCC_D2CCIP1R_SAI23SEL_Pos) /*!< 0x00000100 */

#define RCC_D2CCIP1R_SPI123SEL_Pos             (12U)                           
#define RCC_D2CCIP1R_SPI123SEL_Msk             (0x7U << RCC_D2CCIP1R_SPI123SEL_Pos) /*!< 0x00007000 */
#define RCC_D2CCIP1R_SPI123SEL                 RCC_D2CCIP1R_SPI123SEL_Msk      
#define RCC_D2CCIP1R_SPI123SEL_0               (0x1U << RCC_D2CCIP1R_SPI123SEL_Pos) /*!< 0x00001000 */
#define RCC_D2CCIP1R_SPI123SEL_1               (0x2U << RCC_D2CCIP1R_SPI123SEL_Pos) /*!< 0x00002000 */
#define RCC_D2CCIP1R_SPI123SEL_2               (0x4U << RCC_D2CCIP1R_SPI123SEL_Pos) /*!< 0x00004000 */

#define RCC_D2CCIP1R_SPI45SEL_Pos              (16U)                           
#define RCC_D2CCIP1R_SPI45SEL_Msk              (0x7U << RCC_D2CCIP1R_SPI45SEL_Pos) /*!< 0x00070000 */
#define RCC_D2CCIP1R_SPI45SEL                  RCC_D2CCIP1R_SPI45SEL_Msk       
#define RCC_D2CCIP1R_SPI45SEL_0                (0x1U << RCC_D2CCIP1R_SPI45SEL_Pos) /*!< 0x00010000 */
#define RCC_D2CCIP1R_SPI45SEL_1                (0x2U << RCC_D2CCIP1R_SPI45SEL_Pos) /*!< 0x00020000 */
#define RCC_D2CCIP1R_SPI45SEL_2                (0x4U << RCC_D2CCIP1R_SPI45SEL_Pos) /*!< 0x00040000 */

