bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define RCC_D3CCIPR_LPTIM2SEL_Pos              (10U)                           
#define RCC_D3CCIPR_LPTIM2SEL_Msk              (0x7U << RCC_D3CCIPR_LPTIM2SEL_Pos) /*!< 0x00001C00 */
#define RCC_D3CCIPR_LPTIM2SEL                  RCC_D3CCIPR_LPTIM2SEL_Msk       
#define RCC_D3CCIPR_LPTIM2SEL_0                (0x1U << RCC_D3CCIPR_LPTIM2SEL_Pos) /*!< 0x00000400 */
#define RCC_D3CCIPR_LPTIM2SEL_1                (0x2U << RCC_D3CCIPR_LPTIM2SEL_Pos) /*!< 0x00000800 */
#define RCC_D3CCIPR_LPTIM2SEL_2                (0x4U << RCC_D3CCIPR_LPTIM2SEL_Pos) /*!< 0x00001000 */

#define RCC_D3CCIPR_LPTIM345SEL_Pos            (13U)                           
#define RCC_D3CCIPR_LPTIM345SEL_Msk            (0x7U << RCC_D3CCIPR_LPTIM345SEL_Pos) /*!< 0x0000E000 */
#define RCC_D3CCIPR_LPTIM345SEL                RCC_D3CCIPR_LPTIM345SEL_Msk     
#define RCC_D3CCIPR_LPTIM345SEL_0              (0x1U << RCC_D3CCIPR_LPTIM345SEL_Pos) /*!< 0x00002000 */
#define RCC_D3CCIPR_LPTIM345SEL_1              (0x2U << RCC_D3CCIPR_LPTIM345SEL_Pos) /*!< 0x00004000 */
#define RCC_D3CCIPR_LPTIM345SEL_2              (0x4U << RCC_D3CCIPR_LPTIM345SEL_Pos) /*!< 0x00008000 */

#define RCC_D3CCIPR_SAI4ASEL_Pos               (21U)                           
#define RCC_D3CCIPR_SAI4ASEL_Msk               (0x7U << RCC_D3CCIPR_SAI4ASEL_Pos) /*!< 0x00E00000 */
#define RCC_D3CCIPR_SAI4ASEL                   RCC_D3CCIPR_SAI4ASEL_Msk        
#define RCC_D3CCIPR_SAI4ASEL_0                 (0x1U << RCC_D3CCIPR_SAI4ASEL_Pos) /*!< 0x00200000 */
#define RCC_D3CCIPR_SAI4ASEL_1                 (0x2U << RCC_D3CCIPR_SAI4ASEL_Pos) /*!< 0x00400000 */
#define RCC_D3CCIPR_SAI4ASEL_2                 (0x4U << RCC_D3CCIPR_SAI4ASEL_Pos) /*!< 0x00800000 */

#define RCC_D3CCIPR_SAI4BSEL_Pos               (24U)                           
#define RCC_D3CCIPR_SAI4BSEL_Msk               (0x7U << RCC_D3CCIPR_SAI4BSEL_Pos) /*!< 0x07000000 */
#define RCC_D3CCIPR_SAI4BSEL                   RCC_D3CCIPR_SAI4BSEL_Msk        
#define RCC_D3CCIPR_SAI4BSEL_0                 (0x1U << RCC_D3CCIPR_SAI4BSEL_Pos) /*!< 0x01000000 */
#define RCC_D3CCIPR_SAI4BSEL_1                 (0x2U << RCC_D3CCIPR_SAI4BSEL_Pos) /*!< 0x02000000 */
#define RCC_D3CCIPR_SAI4BSEL_2                 (0x4U << RCC_D3CCIPR_SAI4BSEL_Pos) /*!< 0x04000000 */

#define RCC_D3CCIPR_ADCSEL_Pos                 (16U)                           
#define RCC_D3CCIPR_ADCSEL_Msk                 (0x3U << RCC_D3CCIPR_ADCSEL_Pos) /*!< 0x00030000 */
#define RCC_D3CCIPR_ADCSEL                     RCC_D3CCIPR_ADCSEL_Msk          
#define RCC_D3CCIPR_ADCSEL_0                   (0x1U << RCC_D3CCIPR_ADCSEL_Pos) /*!< 0x00010000 */
#define RCC_D3CCIPR_ADCSEL_1                   (0x2U << RCC_D3CCIPR_ADCSEL_Pos) /*!< 0x00020000 */

#define RCC_D3CCIPR_SPI6SEL_Pos                (28U)                           
#define RCC_D3CCIPR_SPI6SEL_Msk                (0x7U << RCC_D3CCIPR_SPI6SEL_Pos) /*!< 0x70000000 */
#define RCC_D3CCIPR_SPI6SEL                    RCC_D3CCIPR_SPI6SEL_Msk         
#define RCC_D3CCIPR_SPI6SEL_0                  (0x1U << RCC_D3CCIPR_SPI6SEL_Pos) /*!< 0x10000000 */
#define RCC_D3CCIPR_SPI6SEL_1                  (0x2U << RCC_D3CCIPR_SPI6SEL_Pos) /*!< 0x20000000 */
#define RCC_D3CCIPR_SPI6SEL_2                  (0x4U << RCC_D3CCIPR_SPI6SEL_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_CIER register  ******************/
#define RCC_CIER_LSIRDYIE_Pos                  (0U)                            
#define RCC_CIER_LSIRDYIE_Msk                  (0x1U << RCC_CIER_LSIRDYIE_Pos) /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE                      RCC_CIER_LSIRDYIE_Msk           
#define RCC_CIER_LSERDYIE_Pos                  (1U)                            
#define RCC_CIER_LSERDYIE_Msk                  (0x1U << RCC_CIER_LSERDYIE_Pos) /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE                      RCC_CIER_LSERDYIE_Msk           
#define RCC_CIER_HSIRDYIE_Pos                  (2U)                            
#define RCC_CIER_HSIRDYIE_Msk                  (0x1U << RCC_CIER_HSIRDYIE_Pos) /*!< 0x00000004 */
#define RCC_CIER_HSIRDYIE                      RCC_CIER_HSIRDYIE_Msk           
#define RCC_CIER_HSERDYIE_Pos                  (3U)                            
#define RCC_CIER_HSERDYIE_Msk                  (0x1U << RCC_CIER_HSERDYIE_Pos) /*!< 0x00000008 */
#define RCC_CIER_HSERDYIE                      RCC_CIER_HSERDYIE_Msk           
#define RCC_CIER_CSIRDYIE_Pos                  (4U)                            
#define RCC_CIER_CSIRDYIE_Msk                  (0x1U << RCC_CIER_CSIRDYIE_Pos) /*!< 0x00000010 */
#define RCC_CIER_CSIRDYIE                      RCC_CIER_CSIRDYIE_Msk           
#define RCC_CIER_HSI48RDYIE_Pos                (5U)                            
#define RCC_CIER_HSI48RDYIE_Msk                (0x1U << RCC_CIER_HSI48RDYIE_Pos) /*!< 0x00000020 */
#define RCC_CIER_HSI48RDYIE                    RCC_CIER_HSI48RDYIE_Msk         
#define RCC_CIER_PLL1RDYIE_Pos                 (6U)                            
#define RCC_CIER_PLL1RDYIE_Msk                 (0x1U << RCC_CIER_PLL1RDYIE_Pos) /*!< 0x00000040 */
#define RCC_CIER_PLL1RDYIE                     RCC_CIER_PLL1RDYIE_Msk          
#define RCC_CIER_PLL2RDYIE_Pos                 (7U)                            
#define RCC_CIER_PLL2RDYIE_Msk                 (0x1U << RCC_CIER_PLL2RDYIE_Pos) /*!< 0x00000080 */
#define RCC_CIER_PLL2RDYIE                     RCC_CIER_PLL2RDYIE_Msk          
#define RCC_CIER_PLL3RDYIE_Pos                 (8U)                            
#define RCC_CIER_PLL3RDYIE_Msk                 (0x1U << RCC_CIER_PLL3RDYIE_Pos) /*!< 0x00000100 */
#define RCC_CIER_PLL3RDYIE                     RCC_CIER_PLL3RDYIE_Msk          
#define RCC_CIER_LSECSSIE_Pos                  (9U)                            
#define RCC_CIER_LSECSSIE_Msk                  (0x1U << RCC_CIER_LSECSSIE_Pos) /*!< 0x00000200 */
#define RCC_CIER_LSECSSIE                      RCC_CIER_LSECSSIE_Msk           

/********************  Bit definition for RCC_CIFR register  ******************/
#define RCC_CIFR_LSIRDYF_Pos                   (0U)                            
#define RCC_CIFR_LSIRDYF_Msk                   (0x1U << RCC_CIFR_LSIRDYF_Pos)  /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF                       RCC_CIFR_LSIRDYF_Msk            
#define RCC_CIFR_LSERDYF_Pos                   (1U)                            
#define RCC_CIFR_LSERDYF_Msk                   (0x1U << RCC_CIFR_LSERDYF_Pos)  /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF                       RCC_CIFR_LSERDYF_Msk            
#define RCC_CIFR_HSIRDYF_Pos                   (2U)                            
#define RCC_CIFR_HSIRDYF_Msk                   (0x1U << RCC_CIFR_HSIRDYF_Pos)  /*!< 0x00000004 */
#define RCC_CIFR_HSIRDYF                       RCC_CIFR_HSIRDYF_Msk            
#define RCC_CIFR_HSERDYF_Pos                   (3U)                            
#define RCC_CIFR_HSERDYF_Msk                   (0x1U << RCC_CIFR_HSERDYF_Pos)  /*!< 0x00000008 */
#define RCC_CIFR_HSERDYF                       RCC_CIFR_HSERDYF_Msk            
#define RCC_CIFR_CSIRDYF_Pos                   (4U)                            
#define RCC_CIFR_CSIRDYF_Msk                   (0x1U << RCC_CIFR_CSIRDYF_Pos)  /*!< 0x00000010 */
#define RCC_CIFR_CSIRDYF                       RCC_CIFR_CSIRDYF_Msk            
#define RCC_CIFR_HSI48RDYF_Pos                 (5U)                            
#define RCC_CIFR_HSI48RDYF_Msk                 (0x1U << RCC_CIFR_HSI48RDYF_Pos) /*!< 0x00000020 */
#define RCC_CIFR_HSI48RDYF                     RCC_CIFR_HSI48RDYF_Msk          
#define RCC_CIFR_PLLRDYF_Pos                   (6U)                            
#define RCC_CIFR_PLLRDYF_Msk                   (0x1U << RCC_CIFR_PLLRDYF_Pos)  /*!< 0x00000040 */
#define RCC_CIFR_PLLRDYF                       RCC_CIFR_PLLRDYF_Msk            
#define RCC_CIFR_PLL2RDYF_Pos                  (7U)                            
#define RCC_CIFR_PLL2RDYF_Msk                  (0x1U << RCC_CIFR_PLL2RDYF_Pos) /*!< 0x00000080 */
#define RCC_CIFR_PLL2RDYF                      RCC_CIFR_PLL2RDYF_Msk           
#define RCC_CIFR_PLL3RDYF_Pos                  (8U)                            
#define RCC_CIFR_PLL3RDYF_Msk                  (0x1U << RCC_CIFR_PLL3RDYF_Pos) /*!< 0x00000100 */
#define RCC_CIFR_PLL3RDYF                      RCC_CIFR_PLL3RDYF_Msk           
#define RCC_CIFR_LSECSSF_Pos                   (9U)                            
#define RCC_CIFR_LSECSSF_Msk                   (0x1U << RCC_CIFR_LSECSSF_Pos)  /*!< 0x00000200 */
#define RCC_CIFR_LSECSSF                       RCC_CIFR_LSECSSF_Msk            
#define RCC_CIFR_HSECSSF_Pos                   (10U)                           
#define RCC_CIFR_HSECSSF_Msk                   (0x1U << RCC_CIFR_HSECSSF_Pos)  /*!< 0x00000400 */
#define RCC_CIFR_HSECSSF                       RCC_CIFR_HSECSSF_Msk            

/********************  Bit definition for RCC_CICR register  ******************/
#define RCC_CICR_LSIRDYC_Pos                   (0U)                            
#define RCC_CICR_LSIRDYC_Msk                   (0x1U << RCC_CICR_LSIRDYC_Pos)  /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC                       RCC_CICR_LSIRDYC_Msk            
#define RCC_CICR_LSERDYC_Pos                   (1U)                            
#define RCC_CICR_LSERDYC_Msk                   (0x1U << RCC_CICR_LSERDYC_Pos)  /*!< 0x00000002 */
#define RCC_CICR_LSERDYC                       RCC_CICR_LSERDYC_Msk            
#define RCC_CICR_HSIRDYC_Pos                   (2U)                            
#define RCC_CICR_HSIRDYC_Msk                   (0x1U << RCC_CICR_HSIRDYC_Pos)  /*!< 0x00000004 */
#define RCC_CICR_HSIRDYC                       RCC_CICR_HSIRDYC_Msk            
#define RCC_CICR_HSERDYC_Pos                   (3U)                            
#define RCC_CICR_HSERDYC_Msk                   (0x1U << RCC_CICR_HSERDYC_Pos)  /*!< 0x00000008 */
#define RCC_CICR_HSERDYC                       RCC_CICR_HSERDYC_Msk            
#define RCC_CICR_CSIRDYC_Pos                   (4U)                            
#define RCC_CICR_CSIRDYC_Msk                   (0x1U << RCC_CICR_CSIRDYC_Pos)  /*!< 0x00000010 */
#define RCC_CICR_CSIRDYC                       RCC_CICR_CSIRDYC_Msk            
#define RCC_CICR_HSI48RDYC_Pos                 (5U)                            
#define RCC_CICR_HSI48RDYC_Msk                 (0x1U << RCC_CICR_HSI48RDYC_Pos) /*!< 0x00000020 */
#define RCC_CICR_HSI48RDYC                     RCC_CICR_HSI48RDYC_Msk          
#define RCC_CICR_PLLRDYC_Pos                   (6U)                            
#define RCC_CICR_PLLRDYC_Msk                   (0x1U << RCC_CICR_PLLRDYC_Pos)  /*!< 0x00000040 */
#define RCC_CICR_PLLRDYC                       RCC_CICR_PLLRDYC_Msk            
#define RCC_CICR_PLL2RDYC_Pos                  (7U)                            
#define RCC_CICR_PLL2RDYC_Msk                  (0x1U << RCC_CICR_PLL2RDYC_Pos) /*!< 0x00000080 */
#define RCC_CICR_PLL2RDYC                      RCC_CICR_PLL2RDYC_Msk           
#define RCC_CICR_PLL3RDYC_Pos                  (8U)                            
#define RCC_CICR_PLL3RDYC_Msk                  (0x1U << RCC_CICR_PLL3RDYC_Pos) /*!< 0x00000100 */
#define RCC_CICR_PLL3RDYC                      RCC_CICR_PLL3RDYC_Msk           
#define RCC_CICR_LSECSSC_Pos                   (9U)                            
#define RCC_CICR_LSECSSC_Msk                   (0x1U << RCC_CICR_LSECSSC_Pos)  /*!< 0x00000200 */
#define RCC_CICR_LSECSSC                       RCC_CICR_LSECSSC_Msk            
#define RCC_CICR_HSECSSC_Pos                   (10U)                           
#define RCC_CICR_HSECSSC_Msk                   (0x1U << RCC_CICR_HSECSSC_Pos)  /*!< 0x00000400 */
#define RCC_CICR_HSECSSC                       RCC_CICR_HSECSSC_Msk            

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos                     (0U)                            
#define RCC_BDCR_LSEON_Msk                     (0x1U << RCC_BDCR_LSEON_Pos)    /*!< 0x00000001 */
#define RCC_BDCR_LSEON                         RCC_BDCR_LSEON_Msk              
#define RCC_BDCR_LSERDY_Pos                    (1U)                            
#define RCC_BDCR_LSERDY_Msk                    (0x1U << RCC_BDCR_LSERDY_Pos)   /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                        RCC_BDCR_LSERDY_Msk             
#define RCC_BDCR_LSEBYP_Pos                    (2U)                            
#define RCC_BDCR_LSEBYP_Msk                    (0x1U << RCC_BDCR_LSEBYP_Pos)   /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                        RCC_BDCR_LSEBYP_Msk             

#define RCC_BDCR_LSEDRV_Pos                    (3U)                            
#define RCC_BDCR_LSEDRV_Msk                    (0x3U << RCC_BDCR_LSEDRV_Pos)   /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV                        RCC_BDCR_LSEDRV_Msk             
#define RCC_BDCR_LSEDRV_0                      (0x1U << RCC_BDCR_LSEDRV_Pos)   /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1                      (0x2U << RCC_BDCR_LSEDRV_Pos)   /*!< 0x00000010 */

#define RCC_BDCR_LSECSSON_Pos                  (5U)                            
#define RCC_BDCR_LSECSSON_Msk                  (0x1U << RCC_BDCR_LSECSSON_Pos) /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON                      RCC_BDCR_LSECSSON_Msk           
#define RCC_BDCR_LSECSSD_Pos                   (6U)                            
#define RCC_BDCR_LSECSSD_Msk                   (0x1U << RCC_BDCR_LSECSSD_Pos)  /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                       RCC_BDCR_LSECSSD_Msk            

#define RCC_BDCR_RTCSEL_Pos                    (8U)                            
#define RCC_BDCR_RTCSEL_Msk                    (0x3U << RCC_BDCR_RTCSEL_Pos)   /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                        RCC_BDCR_RTCSEL_Msk             
#define RCC_BDCR_RTCSEL_0                      (0x1U << RCC_BDCR_RTCSEL_Pos)   /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                      (0x2U << RCC_BDCR_RTCSEL_Pos)   /*!< 0x00000200 */

