bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define RCC_BDCR_RTCEN_Pos                     (15U)                           
#define RCC_BDCR_RTCEN_Msk                     (0x1U << RCC_BDCR_RTCEN_Pos)    /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                         RCC_BDCR_RTCEN_Msk              
#define RCC_BDCR_BDRST_Pos                     (16U)                           
#define RCC_BDCR_BDRST_Msk                     (0x1U << RCC_BDCR_BDRST_Pos)    /*!< 0x00010000 */
#define RCC_BDCR_BDRST                         RCC_BDCR_BDRST_Msk              
/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                      (0U)                            
#define RCC_CSR_LSION_Msk                      (0x1U << RCC_CSR_LSION_Pos)     /*!< 0x00000001 */
#define RCC_CSR_LSION                          RCC_CSR_LSION_Msk               
#define RCC_CSR_LSIRDY_Pos                     (1U)                            
#define RCC_CSR_LSIRDY_Msk                     (0x1U << RCC_CSR_LSIRDY_Pos)    /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                         RCC_CSR_LSIRDY_Msk              


/********************  Bit definition for RCC_AHB3ENR register  **************/
#define RCC_AHB3ENR_MDMAEN_Pos                 (0U)                            
#define RCC_AHB3ENR_MDMAEN_Msk                 (0x1U << RCC_AHB3ENR_MDMAEN_Pos) /*!< 0x00000001 */
#define RCC_AHB3ENR_MDMAEN                     RCC_AHB3ENR_MDMAEN_Msk          
#define RCC_AHB3ENR_DMA2DEN_Pos                (4U)                            
#define RCC_AHB3ENR_DMA2DEN_Msk                (0x1U << RCC_AHB3ENR_DMA2DEN_Pos) /*!< 0x00000010 */
#define RCC_AHB3ENR_DMA2DEN                    RCC_AHB3ENR_DMA2DEN_Msk         
#define RCC_AHB3ENR_JPGDECEN_Pos               (5U)                            
#define RCC_AHB3ENR_JPGDECEN_Msk               (0x1U << RCC_AHB3ENR_JPGDECEN_Pos) /*!< 0x00000020 */
#define RCC_AHB3ENR_JPGDECEN                   RCC_AHB3ENR_JPGDECEN_Msk        
#define RCC_AHB3ENR_FMCEN_Pos                  (12U)                           
#define RCC_AHB3ENR_FMCEN_Msk                  (0x1U << RCC_AHB3ENR_FMCEN_Pos) /*!< 0x00001000 */
#define RCC_AHB3ENR_FMCEN                      RCC_AHB3ENR_FMCEN_Msk           
#define RCC_AHB3ENR_QSPIEN_Pos                 (14U)                           
#define RCC_AHB3ENR_QSPIEN_Msk                 (0x1U << RCC_AHB3ENR_QSPIEN_Pos) /*!< 0x00004000 */
#define RCC_AHB3ENR_QSPIEN                     RCC_AHB3ENR_QSPIEN_Msk          
#define RCC_AHB3ENR_SDMMC1EN_Pos               (16U)                           
#define RCC_AHB3ENR_SDMMC1EN_Msk               (0x1U << RCC_AHB3ENR_SDMMC1EN_Pos) /*!< 0x00010000 */
#define RCC_AHB3ENR_SDMMC1EN                   RCC_AHB3ENR_SDMMC1EN_Msk        

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define RCC_AHB1ENR_DMA1EN_Pos                 (0U)                            
#define RCC_AHB1ENR_DMA1EN_Msk                 (0x1U << RCC_AHB1ENR_DMA1EN_Pos) /*!< 0x00000001 */
#define RCC_AHB1ENR_DMA1EN                     RCC_AHB1ENR_DMA1EN_Msk          
#define RCC_AHB1ENR_DMA2EN_Pos                 (1U)                            
#define RCC_AHB1ENR_DMA2EN_Msk                 (0x1U << RCC_AHB1ENR_DMA2EN_Pos) /*!< 0x00000002 */
#define RCC_AHB1ENR_DMA2EN                     RCC_AHB1ENR_DMA2EN_Msk          
#define RCC_AHB1ENR_ADC12EN_Pos                (5U)                            
#define RCC_AHB1ENR_ADC12EN_Msk                (0x1U << RCC_AHB1ENR_ADC12EN_Pos) /*!< 0x00000020 */
#define RCC_AHB1ENR_ADC12EN                    RCC_AHB1ENR_ADC12EN_Msk         
#define RCC_AHB1ENR_ETH1MACEN_Pos              (15U)                           
#define RCC_AHB1ENR_ETH1MACEN_Msk              (0x1U << RCC_AHB1ENR_ETH1MACEN_Pos) /*!< 0x00008000 */
#define RCC_AHB1ENR_ETH1MACEN                  RCC_AHB1ENR_ETH1MACEN_Msk       
#define RCC_AHB1ENR_ETH1TXEN_Pos               (16U)                           
#define RCC_AHB1ENR_ETH1TXEN_Msk               (0x1U << RCC_AHB1ENR_ETH1TXEN_Pos) /*!< 0x00010000 */
#define RCC_AHB1ENR_ETH1TXEN                   RCC_AHB1ENR_ETH1TXEN_Msk        
#define RCC_AHB1ENR_ETH1RXEN_Pos               (17U)                           
#define RCC_AHB1ENR_ETH1RXEN_Msk               (0x1U << RCC_AHB1ENR_ETH1RXEN_Pos) /*!< 0x00020000 */
#define RCC_AHB1ENR_ETH1RXEN                   RCC_AHB1ENR_ETH1RXEN_Msk        
#define RCC_AHB1ENR_USB1OTGHSEN_Pos            (25U)                           
#define RCC_AHB1ENR_USB1OTGHSEN_Msk            (0x1U << RCC_AHB1ENR_USB1OTGHSEN_Pos) /*!< 0x02000000 */
#define RCC_AHB1ENR_USB1OTGHSEN                RCC_AHB1ENR_USB1OTGHSEN_Msk     
#define RCC_AHB1ENR_USB1OTGHSULPIEN_Pos        (26U)                           
#define RCC_AHB1ENR_USB1OTGHSULPIEN_Msk        (0x1U << RCC_AHB1ENR_USB1OTGHSULPIEN_Pos) /*!< 0x04000000 */
#define RCC_AHB1ENR_USB1OTGHSULPIEN            RCC_AHB1ENR_USB1OTGHSULPIEN_Msk 
#define RCC_AHB1ENR_USB2OTGHSEN_Pos            (27U)                           
#define RCC_AHB1ENR_USB2OTGHSEN_Msk            (0x1U << RCC_AHB1ENR_USB2OTGHSEN_Pos) /*!< 0x08000000 */
#define RCC_AHB1ENR_USB2OTGHSEN                RCC_AHB1ENR_USB2OTGHSEN_Msk     
#define RCC_AHB1ENR_USB2OTGHSULPIEN_Pos        (28U)                           
#define RCC_AHB1ENR_USB2OTGHSULPIEN_Msk        (0x1U << RCC_AHB1ENR_USB2OTGHSULPIEN_Pos) /*!< 0x10000000 */
#define RCC_AHB1ENR_USB2OTGHSULPIEN            RCC_AHB1ENR_USB2OTGHSULPIEN_Msk 

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define RCC_AHB2ENR_DCMIEN_Pos                 (0U)                            
#define RCC_AHB2ENR_DCMIEN_Msk                 (0x1U << RCC_AHB2ENR_DCMIEN_Pos) /*!< 0x00000001 */
#define RCC_AHB2ENR_DCMIEN                     RCC_AHB2ENR_DCMIEN_Msk          
#define RCC_AHB2ENR_CRYPEN_Pos                 (4U)                            
#define RCC_AHB2ENR_CRYPEN_Msk                 (0x1U << RCC_AHB2ENR_CRYPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB2ENR_CRYPEN                     RCC_AHB2ENR_CRYPEN_Msk          
#define RCC_AHB2ENR_HASHEN_Pos                 (5U)                            
#define RCC_AHB2ENR_HASHEN_Msk                 (0x1U << RCC_AHB2ENR_HASHEN_Pos) /*!< 0x00000020 */
#define RCC_AHB2ENR_HASHEN                     RCC_AHB2ENR_HASHEN_Msk          
#define RCC_AHB2ENR_RNGEN_Pos                  (6U)                            
#define RCC_AHB2ENR_RNGEN_Msk                  (0x1U << RCC_AHB2ENR_RNGEN_Pos) /*!< 0x00000040 */
#define RCC_AHB2ENR_RNGEN                      RCC_AHB2ENR_RNGEN_Msk           
#define RCC_AHB2ENR_SDMMC2EN_Pos               (9U)                            
#define RCC_AHB2ENR_SDMMC2EN_Msk               (0x1U << RCC_AHB2ENR_SDMMC2EN_Pos) /*!< 0x00000200 */
#define RCC_AHB2ENR_SDMMC2EN                   RCC_AHB2ENR_SDMMC2EN_Msk        
#define RCC_AHB2ENR_D2SRAM1EN_Pos              (29U)                           
#define RCC_AHB2ENR_D2SRAM1EN_Msk              (0x1U << RCC_AHB2ENR_D2SRAM1EN_Pos) /*!< 0x20000000 */
#define RCC_AHB2ENR_D2SRAM1EN                  RCC_AHB2ENR_D2SRAM1EN_Msk       
#define RCC_AHB2ENR_D2SRAM2EN_Pos              (30U)                           
#define RCC_AHB2ENR_D2SRAM2EN_Msk              (0x1U << RCC_AHB2ENR_D2SRAM2EN_Pos) /*!< 0x40000000 */
#define RCC_AHB2ENR_D2SRAM2EN                  RCC_AHB2ENR_D2SRAM2EN_Msk       
#define RCC_AHB2ENR_D2SRAM3EN_Pos              (31U)                           
#define RCC_AHB2ENR_D2SRAM3EN_Msk              (0x1U << RCC_AHB2ENR_D2SRAM3EN_Pos) /*!< 0x80000000 */
#define RCC_AHB2ENR_D2SRAM3EN                  RCC_AHB2ENR_D2SRAM3EN_Msk       


/********************  Bit definition for RCC_AHB4ENR register  ******************/
#define RCC_AHB4ENR_GPIOAEN_Pos                (0U)                            
#define RCC_AHB4ENR_GPIOAEN_Msk                (0x1U << RCC_AHB4ENR_GPIOAEN_Pos) /*!< 0x00000001 */
#define RCC_AHB4ENR_GPIOAEN                    RCC_AHB4ENR_GPIOAEN_Msk         
#define RCC_AHB4ENR_GPIOBEN_Pos                (1U)                            
#define RCC_AHB4ENR_GPIOBEN_Msk                (0x1U << RCC_AHB4ENR_GPIOBEN_Pos) /*!< 0x00000002 */
#define RCC_AHB4ENR_GPIOBEN                    RCC_AHB4ENR_GPIOBEN_Msk         
#define RCC_AHB4ENR_GPIOCEN_Pos                (2U)                            
#define RCC_AHB4ENR_GPIOCEN_Msk                (0x1U << RCC_AHB4ENR_GPIOCEN_Pos) /*!< 0x00000004 */
#define RCC_AHB4ENR_GPIOCEN                    RCC_AHB4ENR_GPIOCEN_Msk         
#define RCC_AHB4ENR_GPIODEN_Pos                (3U)                            
#define RCC_AHB4ENR_GPIODEN_Msk                (0x1U << RCC_AHB4ENR_GPIODEN_Pos) /*!< 0x00000008 */
#define RCC_AHB4ENR_GPIODEN                    RCC_AHB4ENR_GPIODEN_Msk         
#define RCC_AHB4ENR_GPIOEEN_Pos                (4U)                            
#define RCC_AHB4ENR_GPIOEEN_Msk                (0x1U << RCC_AHB4ENR_GPIOEEN_Pos) /*!< 0x00000010 */
#define RCC_AHB4ENR_GPIOEEN                    RCC_AHB4ENR_GPIOEEN_Msk         
#define RCC_AHB4ENR_GPIOFEN_Pos                (5U)                            
#define RCC_AHB4ENR_GPIOFEN_Msk                (0x1U << RCC_AHB4ENR_GPIOFEN_Pos) /*!< 0x00000020 */
#define RCC_AHB4ENR_GPIOFEN                    RCC_AHB4ENR_GPIOFEN_Msk         
#define RCC_AHB4ENR_GPIOGEN_Pos                (6U)                            
#define RCC_AHB4ENR_GPIOGEN_Msk                (0x1U << RCC_AHB4ENR_GPIOGEN_Pos) /*!< 0x00000040 */
#define RCC_AHB4ENR_GPIOGEN                    RCC_AHB4ENR_GPIOGEN_Msk         
#define RCC_AHB4ENR_GPIOHEN_Pos                (7U)                            
#define RCC_AHB4ENR_GPIOHEN_Msk                (0x1U << RCC_AHB4ENR_GPIOHEN_Pos) /*!< 0x00000080 */
#define RCC_AHB4ENR_GPIOHEN                    RCC_AHB4ENR_GPIOHEN_Msk         
#define RCC_AHB4ENR_GPIOIEN_Pos                (8U)                            
#define RCC_AHB4ENR_GPIOIEN_Msk                (0x1U << RCC_AHB4ENR_GPIOIEN_Pos) /*!< 0x00000100 */
#define RCC_AHB4ENR_GPIOIEN                    RCC_AHB4ENR_GPIOIEN_Msk         
#define RCC_AHB4ENR_GPIOJEN_Pos                (9U)                            
#define RCC_AHB4ENR_GPIOJEN_Msk                (0x1U << RCC_AHB4ENR_GPIOJEN_Pos) /*!< 0x00000200 */
#define RCC_AHB4ENR_GPIOJEN                    RCC_AHB4ENR_GPIOJEN_Msk         
#define RCC_AHB4ENR_GPIOKEN_Pos                (10U)                           
#define RCC_AHB4ENR_GPIOKEN_Msk                (0x1U << RCC_AHB4ENR_GPIOKEN_Pos) /*!< 0x00000400 */
#define RCC_AHB4ENR_GPIOKEN                    RCC_AHB4ENR_GPIOKEN_Msk         
#define RCC_AHB4ENR_CRCEN_Pos                  (19U)                           
#define RCC_AHB4ENR_CRCEN_Msk                  (0x1U << RCC_AHB4ENR_CRCEN_Pos) /*!< 0x00080000 */
#define RCC_AHB4ENR_CRCEN                      RCC_AHB4ENR_CRCEN_Msk           
#define RCC_AHB4ENR_BDMAEN_Pos                 (21U)                           
#define RCC_AHB4ENR_BDMAEN_Msk                 (0x1U << RCC_AHB4ENR_BDMAEN_Pos) /*!< 0x00200000 */
#define RCC_AHB4ENR_BDMAEN                     RCC_AHB4ENR_BDMAEN_Msk          
#define RCC_AHB4ENR_ADC3EN_Pos                 (24U)                           
#define RCC_AHB4ENR_ADC3EN_Msk                 (0x1U << RCC_AHB4ENR_ADC3EN_Pos) /*!< 0x01000000 */
#define RCC_AHB4ENR_ADC3EN                     RCC_AHB4ENR_ADC3EN_Msk          
#define RCC_AHB4ENR_HSEMEN_Pos                 (25U)                           
#define RCC_AHB4ENR_HSEMEN_Msk                 (0x1U << RCC_AHB4ENR_HSEMEN_Pos) /*!< 0x02000000 */
#define RCC_AHB4ENR_HSEMEN                     RCC_AHB4ENR_HSEMEN_Msk          
#define RCC_AHB4ENR_BKPRAMEN_Pos               (28U)                           
#define RCC_AHB4ENR_BKPRAMEN_Msk               (0x1U << RCC_AHB4ENR_BKPRAMEN_Pos) /*!< 0x10000000 */
#define RCC_AHB4ENR_BKPRAMEN                   RCC_AHB4ENR_BKPRAMEN_Msk        
#define RCC_AHB4ENR_D3SRAM1EN_Pos              (29U)                           
#define RCC_AHB4ENR_D3SRAM1EN_Msk              (0x1U << RCC_AHB4ENR_D3SRAM1EN_Pos) /*!< 0x20000000 */
#define RCC_AHB4ENR_D3SRAM1EN                  RCC_AHB4ENR_D3SRAM1EN_Msk       

/********************  Bit definition for RCC_APB3ENR register  ******************/

#define RCC_APB3ENR_LTDCEN_Pos                 (3U)                            
#define RCC_APB3ENR_LTDCEN_Msk                 (0x1U << RCC_APB3ENR_LTDCEN_Pos) /*!< 0x00000008 */
#define RCC_APB3ENR_LTDCEN                     RCC_APB3ENR_LTDCEN_Msk          
#define RCC_APB3ENR_WWDG1EN_Pos                (6U)                            
#define RCC_APB3ENR_WWDG1EN_Msk                (0x1U << RCC_APB3ENR_WWDG1EN_Pos) /*!< 0x00000040 */
#define RCC_APB3ENR_WWDG1EN                    RCC_APB3ENR_WWDG1EN_Msk         

/********************  Bit definition for RCC_APB1LENR register  ******************/

