bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define RCC_APB1LENR_TIM2EN_Pos                (0U)                            
#define RCC_APB1LENR_TIM2EN_Msk                (0x1U << RCC_APB1LENR_TIM2EN_Pos) /*!< 0x00000001 */
#define RCC_APB1LENR_TIM2EN                    RCC_APB1LENR_TIM2EN_Msk         
#define RCC_APB1LENR_TIM3EN_Pos                (1U)                            
#define RCC_APB1LENR_TIM3EN_Msk                (0x1U << RCC_APB1LENR_TIM3EN_Pos) /*!< 0x00000002 */
#define RCC_APB1LENR_TIM3EN                    RCC_APB1LENR_TIM3EN_Msk         
#define RCC_APB1LENR_TIM4EN_Pos                (2U)                            
#define RCC_APB1LENR_TIM4EN_Msk                (0x1U << RCC_APB1LENR_TIM4EN_Pos) /*!< 0x00000004 */
#define RCC_APB1LENR_TIM4EN                    RCC_APB1LENR_TIM4EN_Msk         
#define RCC_APB1LENR_TIM5EN_Pos                (3U)                            
#define RCC_APB1LENR_TIM5EN_Msk                (0x1U << RCC_APB1LENR_TIM5EN_Pos) /*!< 0x00000008 */
#define RCC_APB1LENR_TIM5EN                    RCC_APB1LENR_TIM5EN_Msk         
#define RCC_APB1LENR_TIM6EN_Pos                (4U)                            
#define RCC_APB1LENR_TIM6EN_Msk                (0x1U << RCC_APB1LENR_TIM6EN_Pos) /*!< 0x00000010 */
#define RCC_APB1LENR_TIM6EN                    RCC_APB1LENR_TIM6EN_Msk         
#define RCC_APB1LENR_TIM7EN_Pos                (5U)                            
#define RCC_APB1LENR_TIM7EN_Msk                (0x1U << RCC_APB1LENR_TIM7EN_Pos) /*!< 0x00000020 */
#define RCC_APB1LENR_TIM7EN                    RCC_APB1LENR_TIM7EN_Msk         
#define RCC_APB1LENR_TIM12EN_Pos               (6U)                            
#define RCC_APB1LENR_TIM12EN_Msk               (0x1U << RCC_APB1LENR_TIM12EN_Pos) /*!< 0x00000040 */
#define RCC_APB1LENR_TIM12EN                   RCC_APB1LENR_TIM12EN_Msk        
#define RCC_APB1LENR_TIM13EN_Pos               (7U)                            
#define RCC_APB1LENR_TIM13EN_Msk               (0x1U << RCC_APB1LENR_TIM13EN_Pos) /*!< 0x00000080 */
#define RCC_APB1LENR_TIM13EN                   RCC_APB1LENR_TIM13EN_Msk        
#define RCC_APB1LENR_TIM14EN_Pos               (8U)                            
#define RCC_APB1LENR_TIM14EN_Msk               (0x1U << RCC_APB1LENR_TIM14EN_Pos) /*!< 0x00000100 */
#define RCC_APB1LENR_TIM14EN                   RCC_APB1LENR_TIM14EN_Msk        
#define RCC_APB1LENR_LPTIM1EN_Pos              (9U)                            
#define RCC_APB1LENR_LPTIM1EN_Msk              (0x1U << RCC_APB1LENR_LPTIM1EN_Pos) /*!< 0x00000200 */
#define RCC_APB1LENR_LPTIM1EN                  RCC_APB1LENR_LPTIM1EN_Msk       


#define RCC_APB1LENR_SPI2EN_Pos                (14U)                           
#define RCC_APB1LENR_SPI2EN_Msk                (0x1U << RCC_APB1LENR_SPI2EN_Pos) /*!< 0x00004000 */
#define RCC_APB1LENR_SPI2EN                    RCC_APB1LENR_SPI2EN_Msk         
#define RCC_APB1LENR_SPI3EN_Pos                (15U)                           
#define RCC_APB1LENR_SPI3EN_Msk                (0x1U << RCC_APB1LENR_SPI3EN_Pos) /*!< 0x00008000 */
#define RCC_APB1LENR_SPI3EN                    RCC_APB1LENR_SPI3EN_Msk         
#define RCC_APB1LENR_SPDIFRXEN_Pos             (16U)                           
#define RCC_APB1LENR_SPDIFRXEN_Msk             (0x1U << RCC_APB1LENR_SPDIFRXEN_Pos) /*!< 0x00010000 */
#define RCC_APB1LENR_SPDIFRXEN                 RCC_APB1LENR_SPDIFRXEN_Msk      
#define RCC_APB1LENR_USART2EN_Pos              (17U)                           
#define RCC_APB1LENR_USART2EN_Msk              (0x1U << RCC_APB1LENR_USART2EN_Pos) /*!< 0x00020000 */
#define RCC_APB1LENR_USART2EN                  RCC_APB1LENR_USART2EN_Msk       
#define RCC_APB1LENR_USART3EN_Pos              (18U)                           
#define RCC_APB1LENR_USART3EN_Msk              (0x1U << RCC_APB1LENR_USART3EN_Pos) /*!< 0x00040000 */
#define RCC_APB1LENR_USART3EN                  RCC_APB1LENR_USART3EN_Msk       
#define RCC_APB1LENR_UART4EN_Pos               (19U)                           
#define RCC_APB1LENR_UART4EN_Msk               (0x1U << RCC_APB1LENR_UART4EN_Pos) /*!< 0x00080000 */
#define RCC_APB1LENR_UART4EN                   RCC_APB1LENR_UART4EN_Msk        
#define RCC_APB1LENR_UART5EN_Pos               (20U)                           
#define RCC_APB1LENR_UART5EN_Msk               (0x1U << RCC_APB1LENR_UART5EN_Pos) /*!< 0x00100000 */
#define RCC_APB1LENR_UART5EN                   RCC_APB1LENR_UART5EN_Msk        
#define RCC_APB1LENR_I2C1EN_Pos                (21U)                           
#define RCC_APB1LENR_I2C1EN_Msk                (0x1U << RCC_APB1LENR_I2C1EN_Pos) /*!< 0x00200000 */
#define RCC_APB1LENR_I2C1EN                    RCC_APB1LENR_I2C1EN_Msk         
#define RCC_APB1LENR_I2C2EN_Pos                (22U)                           
#define RCC_APB1LENR_I2C2EN_Msk                (0x1U << RCC_APB1LENR_I2C2EN_Pos) /*!< 0x00400000 */
#define RCC_APB1LENR_I2C2EN                    RCC_APB1LENR_I2C2EN_Msk         
#define RCC_APB1LENR_I2C3EN_Pos                (23U)                           
#define RCC_APB1LENR_I2C3EN_Msk                (0x1U << RCC_APB1LENR_I2C3EN_Pos) /*!< 0x00800000 */
#define RCC_APB1LENR_I2C3EN                    RCC_APB1LENR_I2C3EN_Msk         
#define RCC_APB1LENR_CECEN_Pos                 (27U)                           
#define RCC_APB1LENR_CECEN_Msk                 (0x1U << RCC_APB1LENR_CECEN_Pos) /*!< 0x08000000 */
#define RCC_APB1LENR_CECEN                     RCC_APB1LENR_CECEN_Msk          
#define RCC_APB1LENR_DAC12EN_Pos               (29U)                           
#define RCC_APB1LENR_DAC12EN_Msk               (0x1U << RCC_APB1LENR_DAC12EN_Pos) /*!< 0x20000000 */
#define RCC_APB1LENR_DAC12EN                   RCC_APB1LENR_DAC12EN_Msk        
#define RCC_APB1LENR_UART7EN_Pos               (30U)                           
#define RCC_APB1LENR_UART7EN_Msk               (0x1U << RCC_APB1LENR_UART7EN_Pos) /*!< 0x40000000 */
#define RCC_APB1LENR_UART7EN                   RCC_APB1LENR_UART7EN_Msk        
#define RCC_APB1LENR_UART8EN_Pos               (31U)                           
#define RCC_APB1LENR_UART8EN_Msk               (0x1U << RCC_APB1LENR_UART8EN_Pos) /*!< 0x80000000 */
#define RCC_APB1LENR_UART8EN                   RCC_APB1LENR_UART8EN_Msk        

/********************  Bit definition for RCC_APB1HENR register  ******************/
#define RCC_APB1HENR_CRSEN_Pos                 (1U)                            
#define RCC_APB1HENR_CRSEN_Msk                 (0x1U << RCC_APB1HENR_CRSEN_Pos) /*!< 0x00000002 */
#define RCC_APB1HENR_CRSEN                     RCC_APB1HENR_CRSEN_Msk          
#define RCC_APB1HENR_SWPMIEN_Pos               (2U)                            
#define RCC_APB1HENR_SWPMIEN_Msk               (0x1U << RCC_APB1HENR_SWPMIEN_Pos) /*!< 0x00000004 */
#define RCC_APB1HENR_SWPMIEN                   RCC_APB1HENR_SWPMIEN_Msk        
#define RCC_APB1HENR_OPAMPEN_Pos               (4U)                            
#define RCC_APB1HENR_OPAMPEN_Msk               (0x1U << RCC_APB1HENR_OPAMPEN_Pos) /*!< 0x00000010 */
#define RCC_APB1HENR_OPAMPEN                   RCC_APB1HENR_OPAMPEN_Msk        
#define RCC_APB1HENR_MDIOSEN_Pos               (5U)                            
#define RCC_APB1HENR_MDIOSEN_Msk               (0x1U << RCC_APB1HENR_MDIOSEN_Pos) /*!< 0x00000020 */
#define RCC_APB1HENR_MDIOSEN                   RCC_APB1HENR_MDIOSEN_Msk        
#define RCC_APB1HENR_FDCANEN_Pos               (8U)                            
#define RCC_APB1HENR_FDCANEN_Msk               (0x1U << RCC_APB1HENR_FDCANEN_Pos) /*!< 0x00000100 */
#define RCC_APB1HENR_FDCANEN                   RCC_APB1HENR_FDCANEN_Msk        

/********************  Bit definition for RCC_APB2ENR register  ******************/
#define RCC_APB2ENR_TIM1EN_Pos                 (0U)                            
#define RCC_APB2ENR_TIM1EN_Msk                 (0x1U << RCC_APB2ENR_TIM1EN_Pos) /*!< 0x00000001 */
#define RCC_APB2ENR_TIM1EN                     RCC_APB2ENR_TIM1EN_Msk          
#define RCC_APB2ENR_TIM8EN_Pos                 (1U)                            
#define RCC_APB2ENR_TIM8EN_Msk                 (0x1U << RCC_APB2ENR_TIM8EN_Pos) /*!< 0x00000002 */
#define RCC_APB2ENR_TIM8EN                     RCC_APB2ENR_TIM8EN_Msk          
#define RCC_APB2ENR_USART1EN_Pos               (4U)                            
#define RCC_APB2ENR_USART1EN_Msk               (0x1U << RCC_APB2ENR_USART1EN_Pos) /*!< 0x00000010 */
#define RCC_APB2ENR_USART1EN                   RCC_APB2ENR_USART1EN_Msk        
#define RCC_APB2ENR_USART6EN_Pos               (5U)                            
#define RCC_APB2ENR_USART6EN_Msk               (0x1U << RCC_APB2ENR_USART6EN_Pos) /*!< 0x00000020 */
#define RCC_APB2ENR_USART6EN                   RCC_APB2ENR_USART6EN_Msk        
#define RCC_APB2ENR_SPI1EN_Pos                 (12U)                           
#define RCC_APB2ENR_SPI1EN_Msk                 (0x1U << RCC_APB2ENR_SPI1EN_Pos) /*!< 0x00001000 */
#define RCC_APB2ENR_SPI1EN                     RCC_APB2ENR_SPI1EN_Msk          
#define RCC_APB2ENR_SPI4EN_Pos                 (13U)                           
#define RCC_APB2ENR_SPI4EN_Msk                 (0x1U << RCC_APB2ENR_SPI4EN_Pos) /*!< 0x00002000 */
#define RCC_APB2ENR_SPI4EN                     RCC_APB2ENR_SPI4EN_Msk          
#define RCC_APB2ENR_TIM15EN_Pos                (16U)                           
#define RCC_APB2ENR_TIM15EN_Msk                (0x1U << RCC_APB2ENR_TIM15EN_Pos) /*!< 0x00010000 */
#define RCC_APB2ENR_TIM15EN                    RCC_APB2ENR_TIM15EN_Msk         
#define RCC_APB2ENR_TIM16EN_Pos                (17U)                           
#define RCC_APB2ENR_TIM16EN_Msk                (0x1U << RCC_APB2ENR_TIM16EN_Pos) /*!< 0x00020000 */
#define RCC_APB2ENR_TIM16EN                    RCC_APB2ENR_TIM16EN_Msk         
#define RCC_APB2ENR_TIM17EN_Pos                (18U)                           
#define RCC_APB2ENR_TIM17EN_Msk                (0x1U << RCC_APB2ENR_TIM17EN_Pos) /*!< 0x00040000 */
#define RCC_APB2ENR_TIM17EN                    RCC_APB2ENR_TIM17EN_Msk         
#define RCC_APB2ENR_SPI5EN_Pos                 (20U)                           
#define RCC_APB2ENR_SPI5EN_Msk                 (0x1U << RCC_APB2ENR_SPI5EN_Pos) /*!< 0x00100000 */
#define RCC_APB2ENR_SPI5EN                     RCC_APB2ENR_SPI5EN_Msk          
#define RCC_APB2ENR_SAI1EN_Pos                 (22U)                           
#define RCC_APB2ENR_SAI1EN_Msk                 (0x1U << RCC_APB2ENR_SAI1EN_Pos) /*!< 0x00400000 */
#define RCC_APB2ENR_SAI1EN                     RCC_APB2ENR_SAI1EN_Msk          
#define RCC_APB2ENR_SAI2EN_Pos                 (23U)                           
#define RCC_APB2ENR_SAI2EN_Msk                 (0x1U << RCC_APB2ENR_SAI2EN_Pos) /*!< 0x00800000 */
#define RCC_APB2ENR_SAI2EN                     RCC_APB2ENR_SAI2EN_Msk          
#define RCC_APB2ENR_SAI3EN_Pos                 (24U)                           
#define RCC_APB2ENR_SAI3EN_Msk                 (0x1U << RCC_APB2ENR_SAI3EN_Pos) /*!< 0x01000000 */
#define RCC_APB2ENR_SAI3EN                     RCC_APB2ENR_SAI3EN_Msk          
#define RCC_APB2ENR_DFSDM1EN_Pos               (28U)                           
#define RCC_APB2ENR_DFSDM1EN_Msk               (0x1U << RCC_APB2ENR_DFSDM1EN_Pos) /*!< 0x10000000 */
#define RCC_APB2ENR_DFSDM1EN                   RCC_APB2ENR_DFSDM1EN_Msk        
#define RCC_APB2ENR_HRTIMEN_Pos                (29U)                           
#define RCC_APB2ENR_HRTIMEN_Msk                (0x1U << RCC_APB2ENR_HRTIMEN_Pos) /*!< 0x20000000 */
#define RCC_APB2ENR_HRTIMEN                    RCC_APB2ENR_HRTIMEN_Msk         

/********************  Bit definition for RCC_APB4ENR register  ******************/
#define RCC_APB4ENR_SYSCFGEN_Pos               (1U)                            
#define RCC_APB4ENR_SYSCFGEN_Msk               (0x1U << RCC_APB4ENR_SYSCFGEN_Pos) /*!< 0x00000002 */
#define RCC_APB4ENR_SYSCFGEN                   RCC_APB4ENR_SYSCFGEN_Msk        
#define RCC_APB4ENR_LPUART1EN_Pos              (3U)                            
#define RCC_APB4ENR_LPUART1EN_Msk              (0x1U << RCC_APB4ENR_LPUART1EN_Pos) /*!< 0x00000008 */
#define RCC_APB4ENR_LPUART1EN                  RCC_APB4ENR_LPUART1EN_Msk       
#define RCC_APB4ENR_SPI6EN_Pos                 (5U)                            
#define RCC_APB4ENR_SPI6EN_Msk                 (0x1U << RCC_APB4ENR_SPI6EN_Pos) /*!< 0x00000020 */
#define RCC_APB4ENR_SPI6EN                     RCC_APB4ENR_SPI6EN_Msk          
#define RCC_APB4ENR_I2C4EN_Pos                 (7U)                            
#define RCC_APB4ENR_I2C4EN_Msk                 (0x1U << RCC_APB4ENR_I2C4EN_Pos) /*!< 0x00000080 */
#define RCC_APB4ENR_I2C4EN                     RCC_APB4ENR_I2C4EN_Msk          
#define RCC_APB4ENR_LPTIM2EN_Pos               (9U)                            
#define RCC_APB4ENR_LPTIM2EN_Msk               (0x1U << RCC_APB4ENR_LPTIM2EN_Pos) /*!< 0x00000200 */
#define RCC_APB4ENR_LPTIM2EN                   RCC_APB4ENR_LPTIM2EN_Msk        
#define RCC_APB4ENR_LPTIM3EN_Pos               (10U)                           
#define RCC_APB4ENR_LPTIM3EN_Msk               (0x1U << RCC_APB4ENR_LPTIM3EN_Pos) /*!< 0x00000400 */
#define RCC_APB4ENR_LPTIM3EN                   RCC_APB4ENR_LPTIM3EN_Msk        
#define RCC_APB4ENR_LPTIM4EN_Pos               (11U)                           
#define RCC_APB4ENR_LPTIM4EN_Msk               (0x1U << RCC_APB4ENR_LPTIM4EN_Pos) /*!< 0x00000800 */
#define RCC_APB4ENR_LPTIM4EN                   RCC_APB4ENR_LPTIM4EN_Msk        
#define RCC_APB4ENR_LPTIM5EN_Pos               (12U)                           
#define RCC_APB4ENR_LPTIM5EN_Msk               (0x1U << RCC_APB4ENR_LPTIM5EN_Pos) /*!< 0x00001000 */
#define RCC_APB4ENR_LPTIM5EN                   RCC_APB4ENR_LPTIM5EN_Msk        
#define RCC_APB4ENR_COMP12EN_Pos               (14U)                           
#define RCC_APB4ENR_COMP12EN_Msk               (0x1U << RCC_APB4ENR_COMP12EN_Pos) /*!< 0x00004000 */
#define RCC_APB4ENR_COMP12EN                   RCC_APB4ENR_COMP12EN_Msk        
#define RCC_APB4ENR_VREFEN_Pos                 (15U)                           
#define RCC_APB4ENR_VREFEN_Msk                 (0x1U << RCC_APB4ENR_VREFEN_Pos) /*!< 0x00008000 */
#define RCC_APB4ENR_VREFEN                     RCC_APB4ENR_VREFEN_Msk          
#define RCC_APB4ENR_RTCAPBEN_Pos               (16U)                           
#define RCC_APB4ENR_RTCAPBEN_Msk               (0x1U << RCC_APB4ENR_RTCAPBEN_Pos) /*!< 0x00010000 */
#define RCC_APB4ENR_RTCAPBEN                   RCC_APB4ENR_RTCAPBEN_Msk        
#define RCC_APB4ENR_SAI4EN_Pos                 (21U)                           
#define RCC_APB4ENR_SAI4EN_Msk                 (0x1U << RCC_APB4ENR_SAI4EN_Pos) /*!< 0x00200000 */
#define RCC_APB4ENR_SAI4EN                     RCC_APB4ENR_SAI4EN_Msk          


/********************  Bit definition for RCC_AHB3RSTR register  ***************/
#define RCC_AHB3RSTR_MDMARST_Pos               (0U)                            
#define RCC_AHB3RSTR_MDMARST_Msk               (0x1U << RCC_AHB3RSTR_MDMARST_Pos) /*!< 0x00000001 */
#define RCC_AHB3RSTR_MDMARST                   RCC_AHB3RSTR_MDMARST_Msk        
#define RCC_AHB3RSTR_DMA2DRST_Pos              (4U)                            
#define RCC_AHB3RSTR_DMA2DRST_Msk              (0x1U << RCC_AHB3RSTR_DMA2DRST_Pos) /*!< 0x00000010 */
#define RCC_AHB3RSTR_DMA2DRST                  RCC_AHB3RSTR_DMA2DRST_Msk       
#define RCC_AHB3RSTR_JPGDECRST_Pos             (5U)                            
#define RCC_AHB3RSTR_JPGDECRST_Msk             (0x1U << RCC_AHB3RSTR_JPGDECRST_Pos) /*!< 0x00000020 */
#define RCC_AHB3RSTR_JPGDECRST                 RCC_AHB3RSTR_JPGDECRST_Msk      
#define RCC_AHB3RSTR_FMCRST_Pos                (12U)                           
#define RCC_AHB3RSTR_FMCRST_Msk                (0x1U << RCC_AHB3RSTR_FMCRST_Pos) /*!< 0x00001000 */
#define RCC_AHB3RSTR_FMCRST                    RCC_AHB3RSTR_FMCRST_Msk         
#define RCC_AHB3RSTR_QSPIRST_Pos               (14U)                           
#define RCC_AHB3RSTR_QSPIRST_Msk               (0x1U << RCC_AHB3RSTR_QSPIRST_Pos) /*!< 0x00004000 */
#define RCC_AHB3RSTR_QSPIRST                   RCC_AHB3RSTR_QSPIRST_Msk        
#define RCC_AHB3RSTR_SDMMC1RST_Pos             (16U)                           
#define RCC_AHB3RSTR_SDMMC1RST_Msk             (0x1U << RCC_AHB3RSTR_SDMMC1RST_Pos) /*!< 0x00010000 */
#define RCC_AHB3RSTR_SDMMC1RST                 RCC_AHB3RSTR_SDMMC1RST_Msk      
#define RCC_AHB3RSTR_CPURST_Pos                (31U)                           
#define RCC_AHB3RSTR_CPURST_Msk                (0x1U << RCC_AHB3RSTR_CPURST_Pos) /*!< 0x80000000 */
#define RCC_AHB3RSTR_CPURST                    RCC_AHB3RSTR_CPURST_Msk         


/********************  Bit definition for RCC_AHB1RSTR register  ***************/
#define RCC_AHB1RSTR_DMA1RST_Pos               (0U)                            
#define RCC_AHB1RSTR_DMA1RST_Msk               (0x1U << RCC_AHB1RSTR_DMA1RST_Pos) /*!< 0x00000001 */
#define RCC_AHB1RSTR_DMA1RST                   RCC_AHB1RSTR_DMA1RST_Msk        
#define RCC_AHB1RSTR_DMA2RST_Pos               (1U)                            
#define RCC_AHB1RSTR_DMA2RST_Msk               (0x1U << RCC_AHB1RSTR_DMA2RST_Pos) /*!< 0x00000002 */
#define RCC_AHB1RSTR_DMA2RST                   RCC_AHB1RSTR_DMA2RST_Msk        
#define RCC_AHB1RSTR_ADC12RST_Pos              (5U)                            
#define RCC_AHB1RSTR_ADC12RST_Msk              (0x1U << RCC_AHB1RSTR_ADC12RST_Pos) /*!< 0x00000020 */
#define RCC_AHB1RSTR_ADC12RST                  RCC_AHB1RSTR_ADC12RST_Msk       
#define RCC_AHB1RSTR_ETH1MACRST_Pos            (15U)                           
#define RCC_AHB1RSTR_ETH1MACRST_Msk            (0x1U << RCC_AHB1RSTR_ETH1MACRST_Pos) /*!< 0x00008000 */
#define RCC_AHB1RSTR_ETH1MACRST                RCC_AHB1RSTR_ETH1MACRST_Msk     
#define RCC_AHB1RSTR_USB1OTGHSRST_Pos          (25U)                           
#define RCC_AHB1RSTR_USB1OTGHSRST_Msk          (0x1U << RCC_AHB1RSTR_USB1OTGHSRST_Pos) /*!< 0x02000000 */
#define RCC_AHB1RSTR_USB1OTGHSRST              RCC_AHB1RSTR_USB1OTGHSRST_Msk   
#define RCC_AHB1RSTR_USB2OTGHSRST_Pos          (27U)                           
#define RCC_AHB1RSTR_USB2OTGHSRST_Msk          (0x1U << RCC_AHB1RSTR_USB2OTGHSRST_Pos) /*!< 0x08000000 */
#define RCC_AHB1RSTR_USB2OTGHSRST              RCC_AHB1RSTR_USB2OTGHSRST_Msk   
/********************  Bit definition for RCC_AHB2RSTR register  ***************/
#define RCC_AHB2RSTR_DCMIRST_Pos               (0U)                            
#define RCC_AHB2RSTR_DCMIRST_Msk               (0x1U << RCC_AHB2RSTR_DCMIRST_Pos) /*!< 0x00000001 */
#define RCC_AHB2RSTR_DCMIRST                   RCC_AHB2RSTR_DCMIRST_Msk        
#define RCC_AHB2RSTR_CRYPRST_Pos               (4U)                            
#define RCC_AHB2RSTR_CRYPRST_Msk               (0x1U << RCC_AHB2RSTR_CRYPRST_Pos) /*!< 0x00000010 */
#define RCC_AHB2RSTR_CRYPRST                   RCC_AHB2RSTR_CRYPRST_Msk        
#define RCC_AHB2RSTR_HASHRST_Pos               (5U)                            
#define RCC_AHB2RSTR_HASHRST_Msk               (0x1U << RCC_AHB2RSTR_HASHRST_Pos) /*!< 0x00000020 */
#define RCC_AHB2RSTR_HASHRST                   RCC_AHB2RSTR_HASHRST_Msk        
#define RCC_AHB2RSTR_RNGRST_Pos                (6U)                            
#define RCC_AHB2RSTR_RNGRST_Msk                (0x1U << RCC_AHB2RSTR_RNGRST_Pos) /*!< 0x00000040 */
#define RCC_AHB2RSTR_RNGRST                    RCC_AHB2RSTR_RNGRST_Msk         
#define RCC_AHB2RSTR_SDMMC2RST_Pos             (9U)                            
#define RCC_AHB2RSTR_SDMMC2RST_Msk             (0x1U << RCC_AHB2RSTR_SDMMC2RST_Pos) /*!< 0x00000200 */
#define RCC_AHB2RSTR_SDMMC2RST                 RCC_AHB2RSTR_SDMMC2RST_Msk      

/********************  Bit definition for RCC_AHB4RSTR register  ******************/
#define RCC_AHB4RSTR_GPIOARST_Pos              (0U)                            
#define RCC_AHB4RSTR_GPIOARST_Msk              (0x1U << RCC_AHB4RSTR_GPIOARST_Pos) /*!< 0x00000001 */
#define RCC_AHB4RSTR_GPIOARST                  RCC_AHB4RSTR_GPIOARST_Msk       
#define RCC_AHB4RSTR_GPIOBRST_Pos              (1U)                            
#define RCC_AHB4RSTR_GPIOBRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOBRST_Pos) /*!< 0x00000002 */
#define RCC_AHB4RSTR_GPIOBRST                  RCC_AHB4RSTR_GPIOBRST_Msk       
#define RCC_AHB4RSTR_GPIOCRST_Pos              (2U)                            
#define RCC_AHB4RSTR_GPIOCRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOCRST_Pos) /*!< 0x00000004 */
#define RCC_AHB4RSTR_GPIOCRST                  RCC_AHB4RSTR_GPIOCRST_Msk       
#define RCC_AHB4RSTR_GPIODRST_Pos              (3U)                            
#define RCC_AHB4RSTR_GPIODRST_Msk              (0x1U << RCC_AHB4RSTR_GPIODRST_Pos) /*!< 0x00000008 */
#define RCC_AHB4RSTR_GPIODRST                  RCC_AHB4RSTR_GPIODRST_Msk       
#define RCC_AHB4RSTR_GPIOERST_Pos              (4U)                            
#define RCC_AHB4RSTR_GPIOERST_Msk              (0x1U << RCC_AHB4RSTR_GPIOERST_Pos) /*!< 0x00000010 */
#define RCC_AHB4RSTR_GPIOERST                  RCC_AHB4RSTR_GPIOERST_Msk       
#define RCC_AHB4RSTR_GPIOFRST_Pos              (5U)                            
#define RCC_AHB4RSTR_GPIOFRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOFRST_Pos) /*!< 0x00000020 */
#define RCC_AHB4RSTR_GPIOFRST                  RCC_AHB4RSTR_GPIOFRST_Msk       
#define RCC_AHB4RSTR_GPIOGRST_Pos              (6U)                            
#define RCC_AHB4RSTR_GPIOGRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOGRST_Pos) /*!< 0x00000040 */
#define RCC_AHB4RSTR_GPIOGRST                  RCC_AHB4RSTR_GPIOGRST_Msk       
#define RCC_AHB4RSTR_GPIOHRST_Pos              (7U)                            
#define RCC_AHB4RSTR_GPIOHRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOHRST_Pos) /*!< 0x00000080 */
#define RCC_AHB4RSTR_GPIOHRST                  RCC_AHB4RSTR_GPIOHRST_Msk       
#define RCC_AHB4RSTR_GPIOIRST_Pos              (8U)                            
#define RCC_AHB4RSTR_GPIOIRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOIRST_Pos) /*!< 0x00000100 */
#define RCC_AHB4RSTR_GPIOIRST                  RCC_AHB4RSTR_GPIOIRST_Msk       
#define RCC_AHB4RSTR_GPIOJRST_Pos              (9U)                            
#define RCC_AHB4RSTR_GPIOJRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOJRST_Pos) /*!< 0x00000200 */
#define RCC_AHB4RSTR_GPIOJRST                  RCC_AHB4RSTR_GPIOJRST_Msk       
#define RCC_AHB4RSTR_GPIOKRST_Pos              (10U)                           
#define RCC_AHB4RSTR_GPIOKRST_Msk              (0x1U << RCC_AHB4RSTR_GPIOKRST_Pos) /*!< 0x00000400 */
#define RCC_AHB4RSTR_GPIOKRST                  RCC_AHB4RSTR_GPIOKRST_Msk       
#define RCC_AHB4RSTR_CRCRST_Pos                (19U)                           
#define RCC_AHB4RSTR_CRCRST_Msk                (0x1U << RCC_AHB4RSTR_CRCRST_Pos) /*!< 0x00080000 */
#define RCC_AHB4RSTR_CRCRST                    RCC_AHB4RSTR_CRCRST_Msk         
#define RCC_AHB4RSTR_BDMARST_Pos               (21U)                           
#define RCC_AHB4RSTR_BDMARST_Msk               (0x1U << RCC_AHB4RSTR_BDMARST_Pos) /*!< 0x00200000 */
#define RCC_AHB4RSTR_BDMARST                   RCC_AHB4RSTR_BDMARST_Msk        
#define RCC_AHB4RSTR_ADC3RST_Pos               (24U)                           
#define RCC_AHB4RSTR_ADC3RST_Msk               (0x1U << RCC_AHB4RSTR_ADC3RST_Pos) /*!< 0x01000000 */
#define RCC_AHB4RSTR_ADC3RST                   RCC_AHB4RSTR_ADC3RST_Msk        
#define RCC_AHB4RSTR_HSEMRST_Pos               (25U)                           
#define RCC_AHB4RSTR_HSEMRST_Msk               (0x1U << RCC_AHB4RSTR_HSEMRST_Pos) /*!< 0x02000000 */
#define RCC_AHB4RSTR_HSEMRST                   RCC_AHB4RSTR_HSEMRST_Msk        


/********************  Bit definition for RCC_APB3RSTR register  ******************/

