bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define RCC_APB3RSTR_LTDCRST_Pos               (3U)                            
#define RCC_APB3RSTR_LTDCRST_Msk               (0x1U << RCC_APB3RSTR_LTDCRST_Pos) /*!< 0x00000008 */
#define RCC_APB3RSTR_LTDCRST                   RCC_APB3RSTR_LTDCRST_Msk        
/********************  Bit definition for RCC_APB1LRSTR register  ******************/

#define RCC_APB1LRSTR_TIM2RST_Pos              (0U)                            
#define RCC_APB1LRSTR_TIM2RST_Msk              (0x1U << RCC_APB1LRSTR_TIM2RST_Pos) /*!< 0x00000001 */
#define RCC_APB1LRSTR_TIM2RST                  RCC_APB1LRSTR_TIM2RST_Msk       
#define RCC_APB1LRSTR_TIM3RST_Pos              (1U)                            
#define RCC_APB1LRSTR_TIM3RST_Msk              (0x1U << RCC_APB1LRSTR_TIM3RST_Pos) /*!< 0x00000002 */
#define RCC_APB1LRSTR_TIM3RST                  RCC_APB1LRSTR_TIM3RST_Msk       
#define RCC_APB1LRSTR_TIM4RST_Pos              (2U)                            
#define RCC_APB1LRSTR_TIM4RST_Msk              (0x1U << RCC_APB1LRSTR_TIM4RST_Pos) /*!< 0x00000004 */
#define RCC_APB1LRSTR_TIM4RST                  RCC_APB1LRSTR_TIM4RST_Msk       
#define RCC_APB1LRSTR_TIM5RST_Pos              (3U)                            
#define RCC_APB1LRSTR_TIM5RST_Msk              (0x1U << RCC_APB1LRSTR_TIM5RST_Pos) /*!< 0x00000008 */
#define RCC_APB1LRSTR_TIM5RST                  RCC_APB1LRSTR_TIM5RST_Msk       
#define RCC_APB1LRSTR_TIM6RST_Pos              (4U)                            
#define RCC_APB1LRSTR_TIM6RST_Msk              (0x1U << RCC_APB1LRSTR_TIM6RST_Pos) /*!< 0x00000010 */
#define RCC_APB1LRSTR_TIM6RST                  RCC_APB1LRSTR_TIM6RST_Msk       
#define RCC_APB1LRSTR_TIM7RST_Pos              (5U)                            
#define RCC_APB1LRSTR_TIM7RST_Msk              (0x1U << RCC_APB1LRSTR_TIM7RST_Pos) /*!< 0x00000020 */
#define RCC_APB1LRSTR_TIM7RST                  RCC_APB1LRSTR_TIM7RST_Msk       
#define RCC_APB1LRSTR_TIM12RST_Pos             (6U)                            
#define RCC_APB1LRSTR_TIM12RST_Msk             (0x1U << RCC_APB1LRSTR_TIM12RST_Pos) /*!< 0x00000040 */
#define RCC_APB1LRSTR_TIM12RST                 RCC_APB1LRSTR_TIM12RST_Msk      
#define RCC_APB1LRSTR_TIM13RST_Pos             (7U)                            
#define RCC_APB1LRSTR_TIM13RST_Msk             (0x1U << RCC_APB1LRSTR_TIM13RST_Pos) /*!< 0x00000080 */
#define RCC_APB1LRSTR_TIM13RST                 RCC_APB1LRSTR_TIM13RST_Msk      
#define RCC_APB1LRSTR_TIM14RST_Pos             (8U)                            
#define RCC_APB1LRSTR_TIM14RST_Msk             (0x1U << RCC_APB1LRSTR_TIM14RST_Pos) /*!< 0x00000100 */
#define RCC_APB1LRSTR_TIM14RST                 RCC_APB1LRSTR_TIM14RST_Msk      
#define RCC_APB1LRSTR_LPTIM1RST_Pos            (9U)                            
#define RCC_APB1LRSTR_LPTIM1RST_Msk            (0x1U << RCC_APB1LRSTR_LPTIM1RST_Pos) /*!< 0x00000200 */
#define RCC_APB1LRSTR_LPTIM1RST                RCC_APB1LRSTR_LPTIM1RST_Msk     
#define RCC_APB1LRSTR_SPI2RST_Pos              (14U)                           
#define RCC_APB1LRSTR_SPI2RST_Msk              (0x1U << RCC_APB1LRSTR_SPI2RST_Pos) /*!< 0x00004000 */
#define RCC_APB1LRSTR_SPI2RST                  RCC_APB1LRSTR_SPI2RST_Msk       
#define RCC_APB1LRSTR_SPI3RST_Pos              (15U)                           
#define RCC_APB1LRSTR_SPI3RST_Msk              (0x1U << RCC_APB1LRSTR_SPI3RST_Pos) /*!< 0x00008000 */
#define RCC_APB1LRSTR_SPI3RST                  RCC_APB1LRSTR_SPI3RST_Msk       
#define RCC_APB1LRSTR_SPDIFRXRST_Pos           (16U)                           
#define RCC_APB1LRSTR_SPDIFRXRST_Msk           (0x1U << RCC_APB1LRSTR_SPDIFRXRST_Pos) /*!< 0x00010000 */
#define RCC_APB1LRSTR_SPDIFRXRST               RCC_APB1LRSTR_SPDIFRXRST_Msk    
#define RCC_APB1LRSTR_USART2RST_Pos            (17U)                           
#define RCC_APB1LRSTR_USART2RST_Msk            (0x1U << RCC_APB1LRSTR_USART2RST_Pos) /*!< 0x00020000 */
#define RCC_APB1LRSTR_USART2RST                RCC_APB1LRSTR_USART2RST_Msk     
#define RCC_APB1LRSTR_USART3RST_Pos            (18U)                           
#define RCC_APB1LRSTR_USART3RST_Msk            (0x1U << RCC_APB1LRSTR_USART3RST_Pos) /*!< 0x00040000 */
#define RCC_APB1LRSTR_USART3RST                RCC_APB1LRSTR_USART3RST_Msk     
#define RCC_APB1LRSTR_UART4RST_Pos             (19U)                           
#define RCC_APB1LRSTR_UART4RST_Msk             (0x1U << RCC_APB1LRSTR_UART4RST_Pos) /*!< 0x00080000 */
#define RCC_APB1LRSTR_UART4RST                 RCC_APB1LRSTR_UART4RST_Msk      
#define RCC_APB1LRSTR_UART5RST_Pos             (20U)                           
#define RCC_APB1LRSTR_UART5RST_Msk             (0x1U << RCC_APB1LRSTR_UART5RST_Pos) /*!< 0x00100000 */
#define RCC_APB1LRSTR_UART5RST                 RCC_APB1LRSTR_UART5RST_Msk      
#define RCC_APB1LRSTR_I2C1RST_Pos              (21U)                           
#define RCC_APB1LRSTR_I2C1RST_Msk              (0x1U << RCC_APB1LRSTR_I2C1RST_Pos) /*!< 0x00200000 */
#define RCC_APB1LRSTR_I2C1RST                  RCC_APB1LRSTR_I2C1RST_Msk       
#define RCC_APB1LRSTR_I2C2RST_Pos              (22U)                           
#define RCC_APB1LRSTR_I2C2RST_Msk              (0x1U << RCC_APB1LRSTR_I2C2RST_Pos) /*!< 0x00400000 */
#define RCC_APB1LRSTR_I2C2RST                  RCC_APB1LRSTR_I2C2RST_Msk       
#define RCC_APB1LRSTR_I2C3RST_Pos              (23U)                           
#define RCC_APB1LRSTR_I2C3RST_Msk              (0x1U << RCC_APB1LRSTR_I2C3RST_Pos) /*!< 0x00800000 */
#define RCC_APB1LRSTR_I2C3RST                  RCC_APB1LRSTR_I2C3RST_Msk       
#define RCC_APB1LRSTR_CECRST_Pos               (27U)                           
#define RCC_APB1LRSTR_CECRST_Msk               (0x1U << RCC_APB1LRSTR_CECRST_Pos) /*!< 0x08000000 */
#define RCC_APB1LRSTR_CECRST                   RCC_APB1LRSTR_CECRST_Msk        
#define RCC_APB1LRSTR_DAC12RST_Pos             (29U)                           
#define RCC_APB1LRSTR_DAC12RST_Msk             (0x1U << RCC_APB1LRSTR_DAC12RST_Pos) /*!< 0x20000000 */
#define RCC_APB1LRSTR_DAC12RST                 RCC_APB1LRSTR_DAC12RST_Msk      
#define RCC_APB1LRSTR_UART7RST_Pos             (30U)                           
#define RCC_APB1LRSTR_UART7RST_Msk             (0x1U << RCC_APB1LRSTR_UART7RST_Pos) /*!< 0x40000000 */
#define RCC_APB1LRSTR_UART7RST                 RCC_APB1LRSTR_UART7RST_Msk      
#define RCC_APB1LRSTR_UART8RST_Pos             (31U)                           
#define RCC_APB1LRSTR_UART8RST_Msk             (0x1U << RCC_APB1LRSTR_UART8RST_Pos) /*!< 0x80000000 */
#define RCC_APB1LRSTR_UART8RST                 RCC_APB1LRSTR_UART8RST_Msk      

/********************  Bit definition for RCC_APB1HRSTR register  ******************/
#define RCC_APB1HRSTR_CRSRST_Pos               (1U)                            
#define RCC_APB1HRSTR_CRSRST_Msk               (0x1U << RCC_APB1HRSTR_CRSRST_Pos) /*!< 0x00000002 */
#define RCC_APB1HRSTR_CRSRST                   RCC_APB1HRSTR_CRSRST_Msk        
#define RCC_APB1HRSTR_SWPMIRST_Pos             (2U)                            
#define RCC_APB1HRSTR_SWPMIRST_Msk             (0x1U << RCC_APB1HRSTR_SWPMIRST_Pos) /*!< 0x00000004 */
#define RCC_APB1HRSTR_SWPMIRST                 RCC_APB1HRSTR_SWPMIRST_Msk      
#define RCC_APB1HRSTR_OPAMPRST_Pos             (4U)                            
#define RCC_APB1HRSTR_OPAMPRST_Msk             (0x1U << RCC_APB1HRSTR_OPAMPRST_Pos) /*!< 0x00000010 */
#define RCC_APB1HRSTR_OPAMPRST                 RCC_APB1HRSTR_OPAMPRST_Msk      
#define RCC_APB1HRSTR_MDIOSRST_Pos             (5U)                            
#define RCC_APB1HRSTR_MDIOSRST_Msk             (0x1U << RCC_APB1HRSTR_MDIOSRST_Pos) /*!< 0x00000020 */
#define RCC_APB1HRSTR_MDIOSRST                 RCC_APB1HRSTR_MDIOSRST_Msk      
#define RCC_APB1HRSTR_FDCANRST_Pos             (8U)                            
#define RCC_APB1HRSTR_FDCANRST_Msk             (0x1U << RCC_APB1HRSTR_FDCANRST_Pos) /*!< 0x00000100 */
#define RCC_APB1HRSTR_FDCANRST                 RCC_APB1HRSTR_FDCANRST_Msk      

/********************  Bit definition for RCC_APB2RSTR register  ******************/
#define RCC_APB2RSTR_TIM1RST_Pos               (0U)                            
#define RCC_APB2RSTR_TIM1RST_Msk               (0x1U << RCC_APB2RSTR_TIM1RST_Pos) /*!< 0x00000001 */
#define RCC_APB2RSTR_TIM1RST                   RCC_APB2RSTR_TIM1RST_Msk        
#define RCC_APB2RSTR_TIM8RST_Pos               (1U)                            
#define RCC_APB2RSTR_TIM8RST_Msk               (0x1U << RCC_APB2RSTR_TIM8RST_Pos) /*!< 0x00000002 */
#define RCC_APB2RSTR_TIM8RST                   RCC_APB2RSTR_TIM8RST_Msk        
#define RCC_APB2RSTR_USART1RST_Pos             (4U)                            
#define RCC_APB2RSTR_USART1RST_Msk             (0x1U << RCC_APB2RSTR_USART1RST_Pos) /*!< 0x00000010 */
#define RCC_APB2RSTR_USART1RST                 RCC_APB2RSTR_USART1RST_Msk      
#define RCC_APB2RSTR_USART6RST_Pos             (5U)                            
#define RCC_APB2RSTR_USART6RST_Msk             (0x1U << RCC_APB2RSTR_USART6RST_Pos) /*!< 0x00000020 */
#define RCC_APB2RSTR_USART6RST                 RCC_APB2RSTR_USART6RST_Msk      
#define RCC_APB2RSTR_SPI1RST_Pos               (12U)                           
#define RCC_APB2RSTR_SPI1RST_Msk               (0x1U << RCC_APB2RSTR_SPI1RST_Pos) /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST                   RCC_APB2RSTR_SPI1RST_Msk        
#define RCC_APB2RSTR_SPI4RST_Pos               (13U)                           
#define RCC_APB2RSTR_SPI4RST_Msk               (0x1U << RCC_APB2RSTR_SPI4RST_Pos) /*!< 0x00002000 */
#define RCC_APB2RSTR_SPI4RST                   RCC_APB2RSTR_SPI4RST_Msk        
#define RCC_APB2RSTR_TIM15RST_Pos              (16U)                           
#define RCC_APB2RSTR_TIM15RST_Msk              (0x1U << RCC_APB2RSTR_TIM15RST_Pos) /*!< 0x00010000 */
#define RCC_APB2RSTR_TIM15RST                  RCC_APB2RSTR_TIM15RST_Msk       
#define RCC_APB2RSTR_TIM16RST_Pos              (17U)                           
#define RCC_APB2RSTR_TIM16RST_Msk              (0x1U << RCC_APB2RSTR_TIM16RST_Pos) /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST                  RCC_APB2RSTR_TIM16RST_Msk       
#define RCC_APB2RSTR_TIM17RST_Pos              (18U)                           
#define RCC_APB2RSTR_TIM17RST_Msk              (0x1U << RCC_APB2RSTR_TIM17RST_Pos) /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST                  RCC_APB2RSTR_TIM17RST_Msk       
#define RCC_APB2RSTR_SPI5RST_Pos               (20U)                           
#define RCC_APB2RSTR_SPI5RST_Msk               (0x1U << RCC_APB2RSTR_SPI5RST_Pos) /*!< 0x00100000 */
#define RCC_APB2RSTR_SPI5RST                   RCC_APB2RSTR_SPI5RST_Msk        
#define RCC_APB2RSTR_SAI1RST_Pos               (22U)                           
#define RCC_APB2RSTR_SAI1RST_Msk               (0x1U << RCC_APB2RSTR_SAI1RST_Pos) /*!< 0x00400000 */
#define RCC_APB2RSTR_SAI1RST                   RCC_APB2RSTR_SAI1RST_Msk        
#define RCC_APB2RSTR_SAI2RST_Pos               (23U)                           
#define RCC_APB2RSTR_SAI2RST_Msk               (0x1U << RCC_APB2RSTR_SAI2RST_Pos) /*!< 0x00800000 */
#define RCC_APB2RSTR_SAI2RST                   RCC_APB2RSTR_SAI2RST_Msk        
#define RCC_APB2RSTR_SAI3RST_Pos               (24U)                           
#define RCC_APB2RSTR_SAI3RST_Msk               (0x1U << RCC_APB2RSTR_SAI3RST_Pos) /*!< 0x01000000 */
#define RCC_APB2RSTR_SAI3RST                   RCC_APB2RSTR_SAI3RST_Msk        
#define RCC_APB2RSTR_DFSDM1RST_Pos             (28U)                           
#define RCC_APB2RSTR_DFSDM1RST_Msk             (0x1U << RCC_APB2RSTR_DFSDM1RST_Pos) /*!< 0x10000000 */
#define RCC_APB2RSTR_DFSDM1RST                 RCC_APB2RSTR_DFSDM1RST_Msk      
#define RCC_APB2RSTR_HRTIMRST_Pos              (29U)                           
#define RCC_APB2RSTR_HRTIMRST_Msk              (0x1U << RCC_APB2RSTR_HRTIMRST_Pos) /*!< 0x20000000 */
#define RCC_APB2RSTR_HRTIMRST                  RCC_APB2RSTR_HRTIMRST_Msk       

/********************  Bit definition for RCC_APB4RSTR register  ******************/
#define RCC_APB4RSTR_SYSCFGRST_Pos             (1U)                            
#define RCC_APB4RSTR_SYSCFGRST_Msk             (0x1U << RCC_APB4RSTR_SYSCFGRST_Pos) /*!< 0x00000002 */
#define RCC_APB4RSTR_SYSCFGRST                 RCC_APB4RSTR_SYSCFGRST_Msk      
#define RCC_APB4RSTR_LPUART1RST_Pos            (3U)                            
#define RCC_APB4RSTR_LPUART1RST_Msk            (0x1U << RCC_APB4RSTR_LPUART1RST_Pos) /*!< 0x00000008 */
#define RCC_APB4RSTR_LPUART1RST                RCC_APB4RSTR_LPUART1RST_Msk     
#define RCC_APB4RSTR_SPI6RST_Pos               (5U)                            
#define RCC_APB4RSTR_SPI6RST_Msk               (0x1U << RCC_APB4RSTR_SPI6RST_Pos) /*!< 0x00000020 */
#define RCC_APB4RSTR_SPI6RST                   RCC_APB4RSTR_SPI6RST_Msk        
#define RCC_APB4RSTR_I2C4RST_Pos               (7U)                            
#define RCC_APB4RSTR_I2C4RST_Msk               (0x1U << RCC_APB4RSTR_I2C4RST_Pos) /*!< 0x00000080 */
#define RCC_APB4RSTR_I2C4RST                   RCC_APB4RSTR_I2C4RST_Msk        
#define RCC_APB4RSTR_LPTIM2RST_Pos             (9U)                            
#define RCC_APB4RSTR_LPTIM2RST_Msk             (0x1U << RCC_APB4RSTR_LPTIM2RST_Pos) /*!< 0x00000200 */
#define RCC_APB4RSTR_LPTIM2RST                 RCC_APB4RSTR_LPTIM2RST_Msk      
#define RCC_APB4RSTR_LPTIM3RST_Pos             (10U)                           
#define RCC_APB4RSTR_LPTIM3RST_Msk             (0x1U << RCC_APB4RSTR_LPTIM3RST_Pos) /*!< 0x00000400 */
#define RCC_APB4RSTR_LPTIM3RST                 RCC_APB4RSTR_LPTIM3RST_Msk      
#define RCC_APB4RSTR_LPTIM4RST_Pos             (11U)                           
#define RCC_APB4RSTR_LPTIM4RST_Msk             (0x1U << RCC_APB4RSTR_LPTIM4RST_Pos) /*!< 0x00000800 */
#define RCC_APB4RSTR_LPTIM4RST                 RCC_APB4RSTR_LPTIM4RST_Msk      
#define RCC_APB4RSTR_LPTIM5RST_Pos             (12U)                           
#define RCC_APB4RSTR_LPTIM5RST_Msk             (0x1U << RCC_APB4RSTR_LPTIM5RST_Pos) /*!< 0x00001000 */
#define RCC_APB4RSTR_LPTIM5RST                 RCC_APB4RSTR_LPTIM5RST_Msk      
#define RCC_APB4RSTR_COMP12RST_Pos             (14U)                           
#define RCC_APB4RSTR_COMP12RST_Msk             (0x1U << RCC_APB4RSTR_COMP12RST_Pos) /*!< 0x00004000 */
#define RCC_APB4RSTR_COMP12RST                 RCC_APB4RSTR_COMP12RST_Msk      
#define RCC_APB4RSTR_VREFRST_Pos               (15U)                           
#define RCC_APB4RSTR_VREFRST_Msk               (0x1U << RCC_APB4RSTR_VREFRST_Pos) /*!< 0x00008000 */
#define RCC_APB4RSTR_VREFRST                   RCC_APB4RSTR_VREFRST_Msk        
#define RCC_APB4RSTR_SAI4RST_Pos               (21U)                           
#define RCC_APB4RSTR_SAI4RST_Msk               (0x1U << RCC_APB4RSTR_SAI4RST_Pos) /*!< 0x00200000 */
#define RCC_APB4RSTR_SAI4RST                   RCC_APB4RSTR_SAI4RST_Msk        


/********************  Bit definition for RCC_GCR register  ********************/
#define RCC_GCR_WW1RSC_Pos                     (0U)                            
#define RCC_GCR_WW1RSC_Msk                     (0x1U << RCC_GCR_WW1RSC_Pos)    /*!< 0x00000001 */
#define RCC_GCR_WW1RSC                         RCC_GCR_WW1RSC_Msk              

