bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for RCC_D3AMR register  ********************/
#define RCC_D3AMR_BDMAAMEN_Pos                 (0U)                            
#define RCC_D3AMR_BDMAAMEN_Msk                 (0x1U << RCC_D3AMR_BDMAAMEN_Pos) /*!< 0x00000001 */
#define RCC_D3AMR_BDMAAMEN                     RCC_D3AMR_BDMAAMEN_Msk          
#define RCC_D3AMR_LPUART1AMEN_Pos              (3U)                            
#define RCC_D3AMR_LPUART1AMEN_Msk              (0x1U << RCC_D3AMR_LPUART1AMEN_Pos) /*!< 0x00000008 */
#define RCC_D3AMR_LPUART1AMEN                  RCC_D3AMR_LPUART1AMEN_Msk       
#define RCC_D3AMR_SPI6AMEN_Pos                 (5U)                            
#define RCC_D3AMR_SPI6AMEN_Msk                 (0x1U << RCC_D3AMR_SPI6AMEN_Pos) /*!< 0x00000020 */
#define RCC_D3AMR_SPI6AMEN                     RCC_D3AMR_SPI6AMEN_Msk          
#define RCC_D3AMR_I2C4AMEN_Pos                 (7U)                            
#define RCC_D3AMR_I2C4AMEN_Msk                 (0x1U << RCC_D3AMR_I2C4AMEN_Pos) /*!< 0x00000080 */
#define RCC_D3AMR_I2C4AMEN                     RCC_D3AMR_I2C4AMEN_Msk          
#define RCC_D3AMR_LPTIM2AMEN_Pos               (9U)                            
#define RCC_D3AMR_LPTIM2AMEN_Msk               (0x1U << RCC_D3AMR_LPTIM2AMEN_Pos) /*!< 0x00000200 */
#define RCC_D3AMR_LPTIM2AMEN                   RCC_D3AMR_LPTIM2AMEN_Msk        
#define RCC_D3AMR_LPTIM3AMEN_Pos               (10U)                           
#define RCC_D3AMR_LPTIM3AMEN_Msk               (0x1U << RCC_D3AMR_LPTIM3AMEN_Pos) /*!< 0x00000400 */
#define RCC_D3AMR_LPTIM3AMEN                   RCC_D3AMR_LPTIM3AMEN_Msk        
#define RCC_D3AMR_LPTIM4AMEN_Pos               (11U)                           
#define RCC_D3AMR_LPTIM4AMEN_Msk               (0x1U << RCC_D3AMR_LPTIM4AMEN_Pos) /*!< 0x00000800 */
#define RCC_D3AMR_LPTIM4AMEN                   RCC_D3AMR_LPTIM4AMEN_Msk        
#define RCC_D3AMR_LPTIM5AMEN_Pos               (12U)                           
#define RCC_D3AMR_LPTIM5AMEN_Msk               (0x1U << RCC_D3AMR_LPTIM5AMEN_Pos) /*!< 0x00001000 */
#define RCC_D3AMR_LPTIM5AMEN                   RCC_D3AMR_LPTIM5AMEN_Msk        
#define RCC_D3AMR_COMP12AMEN_Pos               (14U)                           
#define RCC_D3AMR_COMP12AMEN_Msk               (0x1U << RCC_D3AMR_COMP12AMEN_Pos) /*!< 0x00004000 */
#define RCC_D3AMR_COMP12AMEN                   RCC_D3AMR_COMP12AMEN_Msk        
#define RCC_D3AMR_VREFAMEN_Pos                 (15U)                           
#define RCC_D3AMR_VREFAMEN_Msk                 (0x1U << RCC_D3AMR_VREFAMEN_Pos) /*!< 0x00008000 */
#define RCC_D3AMR_VREFAMEN                     RCC_D3AMR_VREFAMEN_Msk          
#define RCC_D3AMR_RTCAMEN_Pos                  (16U)                           
#define RCC_D3AMR_RTCAMEN_Msk                  (0x1U << RCC_D3AMR_RTCAMEN_Pos) /*!< 0x00010000 */
#define RCC_D3AMR_RTCAMEN                      RCC_D3AMR_RTCAMEN_Msk           
#define RCC_D3AMR_CRCAMEN_Pos                  (19U)                           
#define RCC_D3AMR_CRCAMEN_Msk                  (0x1U << RCC_D3AMR_CRCAMEN_Pos) /*!< 0x00080000 */
#define RCC_D3AMR_CRCAMEN                      RCC_D3AMR_CRCAMEN_Msk           
#define RCC_D3AMR_SAI4AMEN_Pos                 (21U)                           
#define RCC_D3AMR_SAI4AMEN_Msk                 (0x1U << RCC_D3AMR_SAI4AMEN_Pos) /*!< 0x00200000 */
#define RCC_D3AMR_SAI4AMEN                     RCC_D3AMR_SAI4AMEN_Msk          
#define RCC_D3AMR_ADC3AMEN_Pos                 (24U)                           
#define RCC_D3AMR_ADC3AMEN_Msk                 (0x1U << RCC_D3AMR_ADC3AMEN_Pos) /*!< 0x01000000 */
#define RCC_D3AMR_ADC3AMEN                     RCC_D3AMR_ADC3AMEN_Msk          

#define RCC_D3AMR_BKPRAMAMEN_Pos               (28U)                           
#define RCC_D3AMR_BKPRAMAMEN_Msk               (0x1U << RCC_D3AMR_BKPRAMAMEN_Pos) /*!< 0x10000000 */
#define RCC_D3AMR_BKPRAMAMEN                   RCC_D3AMR_BKPRAMAMEN_Msk        
#define RCC_D3AMR_SRAM4AMEN_Pos                (29U)                           
#define RCC_D3AMR_SRAM4AMEN_Msk                (0x1U << RCC_D3AMR_SRAM4AMEN_Pos) /*!< 0x20000000 */
#define RCC_D3AMR_SRAM4AMEN                    RCC_D3AMR_SRAM4AMEN_Msk         
/********************  Bit definition for RCC_AHB3LPENR register  **************/
#define RCC_AHB3LPENR_MDMALPEN_Pos             (0U)                            
#define RCC_AHB3LPENR_MDMALPEN_Msk             (0x1U << RCC_AHB3LPENR_MDMALPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB3LPENR_MDMALPEN                 RCC_AHB3LPENR_MDMALPEN_Msk      
#define RCC_AHB3LPENR_DMA2DLPEN_Pos            (4U)                            
#define RCC_AHB3LPENR_DMA2DLPEN_Msk            (0x1U << RCC_AHB3LPENR_DMA2DLPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB3LPENR_DMA2DLPEN                RCC_AHB3LPENR_DMA2DLPEN_Msk     
#define RCC_AHB3LPENR_JPGDECLPEN_Pos           (5U)                            
#define RCC_AHB3LPENR_JPGDECLPEN_Msk           (0x1U << RCC_AHB3LPENR_JPGDECLPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB3LPENR_JPGDECLPEN               RCC_AHB3LPENR_JPGDECLPEN_Msk    
#define RCC_AHB3LPENR_FLASHLPEN_Pos            (8U)                            
#define RCC_AHB3LPENR_FLASHLPEN_Msk            (0x1U << RCC_AHB3LPENR_FLASHLPEN_Pos) /*!< 0x00000100 */
#define RCC_AHB3LPENR_FLASHLPEN                RCC_AHB3LPENR_FLASHLPEN_Msk     
#define RCC_AHB3LPENR_FMCLPEN_Pos              (12U)                           
#define RCC_AHB3LPENR_FMCLPEN_Msk              (0x1U << RCC_AHB3LPENR_FMCLPEN_Pos) /*!< 0x00001000 */
#define RCC_AHB3LPENR_FMCLPEN                  RCC_AHB3LPENR_FMCLPEN_Msk       
#define RCC_AHB3LPENR_QSPILPEN_Pos             (14U)                           
#define RCC_AHB3LPENR_QSPILPEN_Msk             (0x1U << RCC_AHB3LPENR_QSPILPEN_Pos) /*!< 0x00004000 */
#define RCC_AHB3LPENR_QSPILPEN                 RCC_AHB3LPENR_QSPILPEN_Msk      
#define RCC_AHB3LPENR_SDMMC1LPEN_Pos           (16U)                           
#define RCC_AHB3LPENR_SDMMC1LPEN_Msk           (0x1U << RCC_AHB3LPENR_SDMMC1LPEN_Pos) /*!< 0x00010000 */
#define RCC_AHB3LPENR_SDMMC1LPEN               RCC_AHB3LPENR_SDMMC1LPEN_Msk    
#define RCC_AHB3LPENR_DTCM1LPEN_Pos            (28U)                           
#define RCC_AHB3LPENR_DTCM1LPEN_Msk            (0x1U << RCC_AHB3LPENR_DTCM1LPEN_Pos) /*!< 0x10000000 */
#define RCC_AHB3LPENR_DTCM1LPEN                RCC_AHB3LPENR_DTCM1LPEN_Msk     
#define RCC_AHB3LPENR_DTCM2LPEN_Pos            (29U)                           
#define RCC_AHB3LPENR_DTCM2LPEN_Msk            (0x1U << RCC_AHB3LPENR_DTCM2LPEN_Pos) /*!< 0x20000000 */
#define RCC_AHB3LPENR_DTCM2LPEN                RCC_AHB3LPENR_DTCM2LPEN_Msk     
#define RCC_AHB3LPENR_ITCMLPEN_Pos             (30U)                           
#define RCC_AHB3LPENR_ITCMLPEN_Msk             (0x1U << RCC_AHB3LPENR_ITCMLPEN_Pos) /*!< 0x40000000 */
#define RCC_AHB3LPENR_ITCMLPEN                 RCC_AHB3LPENR_ITCMLPEN_Msk      
#define RCC_AHB3LPENR_AXISRAMLPEN_Pos          (31U)                           
#define RCC_AHB3LPENR_AXISRAMLPEN_Msk          (0x1U << RCC_AHB3LPENR_AXISRAMLPEN_Pos) /*!< 0x80000000 */
#define RCC_AHB3LPENR_AXISRAMLPEN              RCC_AHB3LPENR_AXISRAMLPEN_Msk   


