bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for RCC_AHB1LPENR register  ***************/
#define RCC_AHB1LPENR_DMA1LPEN_Pos             (0U)                            
#define RCC_AHB1LPENR_DMA1LPEN_Msk             (0x1U << RCC_AHB1LPENR_DMA1LPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB1LPENR_DMA1LPEN                 RCC_AHB1LPENR_DMA1LPEN_Msk      
#define RCC_AHB1LPENR_DMA2LPEN_Pos             (1U)                            
#define RCC_AHB1LPENR_DMA2LPEN_Msk             (0x1U << RCC_AHB1LPENR_DMA2LPEN_Pos) /*!< 0x00000002 */
#define RCC_AHB1LPENR_DMA2LPEN                 RCC_AHB1LPENR_DMA2LPEN_Msk      
#define RCC_AHB1LPENR_ADC12LPEN_Pos            (5U)                            
#define RCC_AHB1LPENR_ADC12LPEN_Msk            (0x1U << RCC_AHB1LPENR_ADC12LPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB1LPENR_ADC12LPEN                RCC_AHB1LPENR_ADC12LPEN_Msk     
#define RCC_AHB1LPENR_ETH1MACLPEN_Pos          (15U)                           
#define RCC_AHB1LPENR_ETH1MACLPEN_Msk          (0x1U << RCC_AHB1LPENR_ETH1MACLPEN_Pos) /*!< 0x00008000 */
#define RCC_AHB1LPENR_ETH1MACLPEN              RCC_AHB1LPENR_ETH1MACLPEN_Msk   
#define RCC_AHB1LPENR_ETH1TXLPEN_Pos           (16U)                           
#define RCC_AHB1LPENR_ETH1TXLPEN_Msk           (0x1U << RCC_AHB1LPENR_ETH1TXLPEN_Pos) /*!< 0x00010000 */
#define RCC_AHB1LPENR_ETH1TXLPEN               RCC_AHB1LPENR_ETH1TXLPEN_Msk    
#define RCC_AHB1LPENR_ETH1RXLPEN_Pos           (17U)                           
#define RCC_AHB1LPENR_ETH1RXLPEN_Msk           (0x1U << RCC_AHB1LPENR_ETH1RXLPEN_Pos) /*!< 0x00020000 */
#define RCC_AHB1LPENR_ETH1RXLPEN               RCC_AHB1LPENR_ETH1RXLPEN_Msk    
#define RCC_AHB1LPENR_USB1OTGHSLPEN_Pos        (25U)                           
#define RCC_AHB1LPENR_USB1OTGHSLPEN_Msk        (0x1U << RCC_AHB1LPENR_USB1OTGHSLPEN_Pos) /*!< 0x02000000 */
#define RCC_AHB1LPENR_USB1OTGHSLPEN            RCC_AHB1LPENR_USB1OTGHSLPEN_Msk 
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN_Pos    (26U)                           
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN_Msk    (0x1U << RCC_AHB1LPENR_USB1OTGHSULPILPEN_Pos) /*!< 0x04000000 */
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN        RCC_AHB1LPENR_USB1OTGHSULPILPEN_Msk 
#define RCC_AHB1LPENR_USB2OTGHSLPEN_Pos        (27U)                           
#define RCC_AHB1LPENR_USB2OTGHSLPEN_Msk        (0x1U << RCC_AHB1LPENR_USB2OTGHSLPEN_Pos) /*!< 0x08000000 */
#define RCC_AHB1LPENR_USB2OTGHSLPEN            RCC_AHB1LPENR_USB2OTGHSLPEN_Msk 
#define RCC_AHB1LPENR_USB2OTGHSULPILPEN_Pos    (28U)                           
#define RCC_AHB1LPENR_USB2OTGHSULPILPEN_Msk    (0x1U << RCC_AHB1LPENR_USB2OTGHSULPILPEN_Pos) /*!< 0x10000000 */
#define RCC_AHB1LPENR_USB2OTGHSULPILPEN        RCC_AHB1LPENR_USB2OTGHSULPILPEN_Msk 

/********************  Bit definition for RCC_AHB2LPENR register  ***************/
#define RCC_AHB2LPENR_DCMILPEN_Pos             (0U)                            
#define RCC_AHB2LPENR_DCMILPEN_Msk             (0x1U << RCC_AHB2LPENR_DCMILPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB2LPENR_DCMILPEN                 RCC_AHB2LPENR_DCMILPEN_Msk      
#define RCC_AHB2LPENR_CRYPLPEN_Pos             (4U)                            
#define RCC_AHB2LPENR_CRYPLPEN_Msk             (0x1U << RCC_AHB2LPENR_CRYPLPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB2LPENR_CRYPLPEN                 RCC_AHB2LPENR_CRYPLPEN_Msk      
#define RCC_AHB2LPENR_HASHLPEN_Pos             (5U)                            
#define RCC_AHB2LPENR_HASHLPEN_Msk             (0x1U << RCC_AHB2LPENR_HASHLPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB2LPENR_HASHLPEN                 RCC_AHB2LPENR_HASHLPEN_Msk      
#define RCC_AHB2LPENR_RNGLPEN_Pos              (6U)                            
#define RCC_AHB2LPENR_RNGLPEN_Msk              (0x1U << RCC_AHB2LPENR_RNGLPEN_Pos) /*!< 0x00000040 */
#define RCC_AHB2LPENR_RNGLPEN                  RCC_AHB2LPENR_RNGLPEN_Msk       
#define RCC_AHB2LPENR_SDMMC2LPEN_Pos           (9U)                            
#define RCC_AHB2LPENR_SDMMC2LPEN_Msk           (0x1U << RCC_AHB2LPENR_SDMMC2LPEN_Pos) /*!< 0x00000200 */
#define RCC_AHB2LPENR_SDMMC2LPEN               RCC_AHB2LPENR_SDMMC2LPEN_Msk    
#define RCC_AHB2LPENR_D2SRAM1LPEN_Pos          (30U)                           
#define RCC_AHB2LPENR_D2SRAM1LPEN_Msk          (0x1U << RCC_AHB2LPENR_D2SRAM1LPEN_Pos) /*!< 0x40000000 */
#define RCC_AHB2LPENR_D2SRAM1LPEN              RCC_AHB2LPENR_D2SRAM1LPEN_Msk   
#define RCC_AHB2LPENR_D2SRAM2LPEN_Pos          (30U)                           
#define RCC_AHB2LPENR_D2SRAM2LPEN_Msk          (0x1U << RCC_AHB2LPENR_D2SRAM2LPEN_Pos) /*!< 0x40000000 */
#define RCC_AHB2LPENR_D2SRAM2LPEN              RCC_AHB2LPENR_D2SRAM2LPEN_Msk   
#define RCC_AHB2LPENR_D2SRAM3LPEN_Pos          (31U)                           
#define RCC_AHB2LPENR_D2SRAM3LPEN_Msk          (0x1U << RCC_AHB2LPENR_D2SRAM3LPEN_Pos) /*!< 0x80000000 */
#define RCC_AHB2LPENR_D2SRAM3LPEN              RCC_AHB2LPENR_D2SRAM3LPEN_Msk   


/********************  Bit definition for RCC_AHB4LPENR register  ******************/
#define RCC_AHB4LPENR_GPIOALPEN_Pos            (0U)                            
#define RCC_AHB4LPENR_GPIOALPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOALPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB4LPENR_GPIOALPEN                RCC_AHB4LPENR_GPIOALPEN_Msk     
#define RCC_AHB4LPENR_GPIOBLPEN_Pos            (1U)                            
#define RCC_AHB4LPENR_GPIOBLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOBLPEN_Pos) /*!< 0x00000002 */
#define RCC_AHB4LPENR_GPIOBLPEN                RCC_AHB4LPENR_GPIOBLPEN_Msk     
#define RCC_AHB4LPENR_GPIOCLPEN_Pos            (2U)                            
#define RCC_AHB4LPENR_GPIOCLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOCLPEN_Pos) /*!< 0x00000004 */
#define RCC_AHB4LPENR_GPIOCLPEN                RCC_AHB4LPENR_GPIOCLPEN_Msk     
#define RCC_AHB4LPENR_GPIODLPEN_Pos            (3U)                            
#define RCC_AHB4LPENR_GPIODLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIODLPEN_Pos) /*!< 0x00000008 */
#define RCC_AHB4LPENR_GPIODLPEN                RCC_AHB4LPENR_GPIODLPEN_Msk     
#define RCC_AHB4LPENR_GPIOELPEN_Pos            (4U)                            
#define RCC_AHB4LPENR_GPIOELPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOELPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB4LPENR_GPIOELPEN                RCC_AHB4LPENR_GPIOELPEN_Msk     
#define RCC_AHB4LPENR_GPIOFLPEN_Pos            (5U)                            
#define RCC_AHB4LPENR_GPIOFLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOFLPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB4LPENR_GPIOFLPEN                RCC_AHB4LPENR_GPIOFLPEN_Msk     
#define RCC_AHB4LPENR_GPIOGLPEN_Pos            (6U)                            
#define RCC_AHB4LPENR_GPIOGLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOGLPEN_Pos) /*!< 0x00000040 */
#define RCC_AHB4LPENR_GPIOGLPEN                RCC_AHB4LPENR_GPIOGLPEN_Msk     
#define RCC_AHB4LPENR_GPIOHLPEN_Pos            (7U)                            
#define RCC_AHB4LPENR_GPIOHLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOHLPEN_Pos) /*!< 0x00000080 */
#define RCC_AHB4LPENR_GPIOHLPEN                RCC_AHB4LPENR_GPIOHLPEN_Msk     
#define RCC_AHB4LPENR_GPIOILPEN_Pos            (8U)                            
#define RCC_AHB4LPENR_GPIOILPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOILPEN_Pos) /*!< 0x00000100 */
#define RCC_AHB4LPENR_GPIOILPEN                RCC_AHB4LPENR_GPIOILPEN_Msk     
#define RCC_AHB4LPENR_GPIOJLPEN_Pos            (9U)                            
#define RCC_AHB4LPENR_GPIOJLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOJLPEN_Pos) /*!< 0x00000200 */
#define RCC_AHB4LPENR_GPIOJLPEN                RCC_AHB4LPENR_GPIOJLPEN_Msk     
#define RCC_AHB4LPENR_GPIOKLPEN_Pos            (10U)                           
#define RCC_AHB4LPENR_GPIOKLPEN_Msk            (0x1U << RCC_AHB4LPENR_GPIOKLPEN_Pos) /*!< 0x00000400 */
#define RCC_AHB4LPENR_GPIOKLPEN                RCC_AHB4LPENR_GPIOKLPEN_Msk     
#define RCC_AHB4LPENR_CRCLPEN_Pos              (19U)                           
#define RCC_AHB4LPENR_CRCLPEN_Msk              (0x1U << RCC_AHB4LPENR_CRCLPEN_Pos) /*!< 0x00080000 */
#define RCC_AHB4LPENR_CRCLPEN                  RCC_AHB4LPENR_CRCLPEN_Msk       
#define RCC_AHB4LPENR_BDMALPEN_Pos             (21U)                           
#define RCC_AHB4LPENR_BDMALPEN_Msk             (0x1U << RCC_AHB4LPENR_BDMALPEN_Pos) /*!< 0x00200000 */
#define RCC_AHB4LPENR_BDMALPEN                 RCC_AHB4LPENR_BDMALPEN_Msk      
#define RCC_AHB4LPENR_ADC3LPEN_Pos             (24U)                           
#define RCC_AHB4LPENR_ADC3LPEN_Msk             (0x1U << RCC_AHB4LPENR_ADC3LPEN_Pos) /*!< 0x01000000 */
#define RCC_AHB4LPENR_ADC3LPEN                 RCC_AHB4LPENR_ADC3LPEN_Msk      
#define RCC_AHB4LPENR_BKPRAMLPEN_Pos           (28U)                           
#define RCC_AHB4LPENR_BKPRAMLPEN_Msk           (0x1U << RCC_AHB4LPENR_BKPRAMLPEN_Pos) /*!< 0x10000000 */
#define RCC_AHB4LPENR_BKPRAMLPEN               RCC_AHB4LPENR_BKPRAMLPEN_Msk    
#define RCC_AHB4LPENR_D3SRAM1LPEN_Pos          (29U)                           
#define RCC_AHB4LPENR_D3SRAM1LPEN_Msk          (0x1U << RCC_AHB4LPENR_D3SRAM1LPEN_Pos) /*!< 0x20000000 */
#define RCC_AHB4LPENR_D3SRAM1LPEN              RCC_AHB4LPENR_D3SRAM1LPEN_Msk   

/********************  Bit definition for RCC_APB3LPENR register  ******************/

#define RCC_APB3LPENR_LTDCLPEN_Pos             (3U)                            
#define RCC_APB3LPENR_LTDCLPEN_Msk             (0x1U << RCC_APB3LPENR_LTDCLPEN_Pos) /*!< 0x00000008 */
#define RCC_APB3LPENR_LTDCLPEN                 RCC_APB3LPENR_LTDCLPEN_Msk      
#define RCC_APB3LPENR_WWDG1LPEN_Pos            (6U)                            
#define RCC_APB3LPENR_WWDG1LPEN_Msk            (0x1U << RCC_APB3LPENR_WWDG1LPEN_Pos) /*!< 0x00000040 */
#define RCC_APB3LPENR_WWDG1LPEN                RCC_APB3LPENR_WWDG1LPEN_Msk     

/********************  Bit definition for RCC_APB1LLPENR register  ******************/

#define RCC_APB1LLPENR_TIM2LPEN_Pos            (0U)                            
#define RCC_APB1LLPENR_TIM2LPEN_Msk            (0x1U << RCC_APB1LLPENR_TIM2LPEN_Pos) /*!< 0x00000001 */
#define RCC_APB1LLPENR_TIM2LPEN                RCC_APB1LLPENR_TIM2LPEN_Msk     
#define RCC_APB1LLPENR_TIM3LPEN_Pos            (1U)                            
#define RCC_APB1LLPENR_TIM3LPEN_Msk            (0x1U << RCC_APB1LLPENR_TIM3LPEN_Pos) /*!< 0x00000002 */
#define RCC_APB1LLPENR_TIM3LPEN                RCC_APB1LLPENR_TIM3LPEN_Msk     
#define RCC_APB1LLPENR_TIM4LPEN_Pos            (2U)                            
#define RCC_APB1LLPENR_TIM4LPEN_Msk            (0x1U << RCC_APB1LLPENR_TIM4LPEN_Pos) /*!< 0x00000004 */
#define RCC_APB1LLPENR_TIM4LPEN                RCC_APB1LLPENR_TIM4LPEN_Msk     
#define RCC_APB1LLPENR_TIM5LPEN_Pos            (3U)                            
#define RCC_APB1LLPENR_TIM5LPEN_Msk            (0x1U << RCC_APB1LLPENR_TIM5LPEN_Pos) /*!< 0x00000008 */
#define RCC_APB1LLPENR_TIM5LPEN                RCC_APB1LLPENR_TIM5LPEN_Msk     
#define RCC_APB1LLPENR_TIM6LPEN_Pos            (4U)                            
#define RCC_APB1LLPENR_TIM6LPEN_Msk            (0x1U << RCC_APB1LLPENR_TIM6LPEN_Pos) /*!< 0x00000010 */
#define RCC_APB1LLPENR_TIM6LPEN                RCC_APB1LLPENR_TIM6LPEN_Msk     
#define RCC_APB1LLPENR_TIM7LPEN_Pos            (5U)                            
#define RCC_APB1LLPENR_TIM7LPEN_Msk            (0x1U << RCC_APB1LLPENR_TIM7LPEN_Pos) /*!< 0x00000020 */
#define RCC_APB1LLPENR_TIM7LPEN                RCC_APB1LLPENR_TIM7LPEN_Msk     
#define RCC_APB1LLPENR_TIM12LPEN_Pos           (6U)                            
#define RCC_APB1LLPENR_TIM12LPEN_Msk           (0x1U << RCC_APB1LLPENR_TIM12LPEN_Pos) /*!< 0x00000040 */
#define RCC_APB1LLPENR_TIM12LPEN               RCC_APB1LLPENR_TIM12LPEN_Msk    
#define RCC_APB1LLPENR_TIM13LPEN_Pos           (7U)                            
#define RCC_APB1LLPENR_TIM13LPEN_Msk           (0x1U << RCC_APB1LLPENR_TIM13LPEN_Pos) /*!< 0x00000080 */
#define RCC_APB1LLPENR_TIM13LPEN               RCC_APB1LLPENR_TIM13LPEN_Msk    
#define RCC_APB1LLPENR_TIM14LPEN_Pos           (8U)                            
#define RCC_APB1LLPENR_TIM14LPEN_Msk           (0x1U << RCC_APB1LLPENR_TIM14LPEN_Pos) /*!< 0x00000100 */
#define RCC_APB1LLPENR_TIM14LPEN               RCC_APB1LLPENR_TIM14LPEN_Msk    
#define RCC_APB1LLPENR_LPTIM1LPEN_Pos          (9U)                            
#define RCC_APB1LLPENR_LPTIM1LPEN_Msk          (0x1U << RCC_APB1LLPENR_LPTIM1LPEN_Pos) /*!< 0x00000200 */
#define RCC_APB1LLPENR_LPTIM1LPEN              RCC_APB1LLPENR_LPTIM1LPEN_Msk   


#define RCC_APB1LLPENR_SPI2LPEN_Pos            (14U)                           
#define RCC_APB1LLPENR_SPI2LPEN_Msk            (0x1U << RCC_APB1LLPENR_SPI2LPEN_Pos) /*!< 0x00004000 */
#define RCC_APB1LLPENR_SPI2LPEN                RCC_APB1LLPENR_SPI2LPEN_Msk     
#define RCC_APB1LLPENR_SPI3LPEN_Pos            (15U)                           
#define RCC_APB1LLPENR_SPI3LPEN_Msk            (0x1U << RCC_APB1LLPENR_SPI3LPEN_Pos) /*!< 0x00008000 */
#define RCC_APB1LLPENR_SPI3LPEN                RCC_APB1LLPENR_SPI3LPEN_Msk     
#define RCC_APB1LLPENR_SPDIFRXLPEN_Pos         (16U)                           
#define RCC_APB1LLPENR_SPDIFRXLPEN_Msk         (0x1U << RCC_APB1LLPENR_SPDIFRXLPEN_Pos) /*!< 0x00010000 */
#define RCC_APB1LLPENR_SPDIFRXLPEN             RCC_APB1LLPENR_SPDIFRXLPEN_Msk  
#define RCC_APB1LLPENR_USART2LPEN_Pos          (17U)                           
#define RCC_APB1LLPENR_USART2LPEN_Msk          (0x1U << RCC_APB1LLPENR_USART2LPEN_Pos) /*!< 0x00020000 */
#define RCC_APB1LLPENR_USART2LPEN              RCC_APB1LLPENR_USART2LPEN_Msk   
#define RCC_APB1LLPENR_USART3LPEN_Pos          (18U)                           
#define RCC_APB1LLPENR_USART3LPEN_Msk          (0x1U << RCC_APB1LLPENR_USART3LPEN_Pos) /*!< 0x00040000 */
#define RCC_APB1LLPENR_USART3LPEN              RCC_APB1LLPENR_USART3LPEN_Msk   
#define RCC_APB1LLPENR_UART4LPEN_Pos           (19U)                           
#define RCC_APB1LLPENR_UART4LPEN_Msk           (0x1U << RCC_APB1LLPENR_UART4LPEN_Pos) /*!< 0x00080000 */
#define RCC_APB1LLPENR_UART4LPEN               RCC_APB1LLPENR_UART4LPEN_Msk    
#define RCC_APB1LLPENR_UART5LPEN_Pos           (20U)                           
#define RCC_APB1LLPENR_UART5LPEN_Msk           (0x1U << RCC_APB1LLPENR_UART5LPEN_Pos) /*!< 0x00100000 */
#define RCC_APB1LLPENR_UART5LPEN               RCC_APB1LLPENR_UART5LPEN_Msk    
#define RCC_APB1LLPENR_I2C1LPEN_Pos            (21U)                           
#define RCC_APB1LLPENR_I2C1LPEN_Msk            (0x1U << RCC_APB1LLPENR_I2C1LPEN_Pos) /*!< 0x00200000 */
#define RCC_APB1LLPENR_I2C1LPEN                RCC_APB1LLPENR_I2C1LPEN_Msk     
#define RCC_APB1LLPENR_I2C2LPEN_Pos            (22U)                           
#define RCC_APB1LLPENR_I2C2LPEN_Msk            (0x1U << RCC_APB1LLPENR_I2C2LPEN_Pos) /*!< 0x00400000 */
#define RCC_APB1LLPENR_I2C2LPEN                RCC_APB1LLPENR_I2C2LPEN_Msk     
#define RCC_APB1LLPENR_I2C3LPEN_Pos            (23U)                           
#define RCC_APB1LLPENR_I2C3LPEN_Msk            (0x1U << RCC_APB1LLPENR_I2C3LPEN_Pos) /*!< 0x00800000 */
#define RCC_APB1LLPENR_I2C3LPEN                RCC_APB1LLPENR_I2C3LPEN_Msk     
#define RCC_APB1LLPENR_CECLPEN_Pos             (27U)                           
#define RCC_APB1LLPENR_CECLPEN_Msk             (0x1U << RCC_APB1LLPENR_CECLPEN_Pos) /*!< 0x08000000 */
#define RCC_APB1LLPENR_CECLPEN                 RCC_APB1LLPENR_CECLPEN_Msk      
#define RCC_APB1LLPENR_DAC12LPEN_Pos           (29U)                           
#define RCC_APB1LLPENR_DAC12LPEN_Msk           (0x1U << RCC_APB1LLPENR_DAC12LPEN_Pos) /*!< 0x20000000 */
#define RCC_APB1LLPENR_DAC12LPEN               RCC_APB1LLPENR_DAC12LPEN_Msk    
#define RCC_APB1LLPENR_UART7LPEN_Pos           (30U)                           
#define RCC_APB1LLPENR_UART7LPEN_Msk           (0x1U << RCC_APB1LLPENR_UART7LPEN_Pos) /*!< 0x40000000 */
#define RCC_APB1LLPENR_UART7LPEN               RCC_APB1LLPENR_UART7LPEN_Msk    
#define RCC_APB1LLPENR_UART8LPEN_Pos           (31U)                           
#define RCC_APB1LLPENR_UART8LPEN_Msk           (0x1U << RCC_APB1LLPENR_UART8LPEN_Pos) /*!< 0x80000000 */
#define RCC_APB1LLPENR_UART8LPEN               RCC_APB1LLPENR_UART8LPEN_Msk    

/********************  Bit definition for RCC_APB1HLPENR register  ******************/
#define RCC_APB1HLPENR_CRSLPEN_Pos             (1U)                            
#define RCC_APB1HLPENR_CRSLPEN_Msk             (0x1U << RCC_APB1HLPENR_CRSLPEN_Pos) /*!< 0x00000002 */
#define RCC_APB1HLPENR_CRSLPEN                 RCC_APB1HLPENR_CRSLPEN_Msk      
#define RCC_APB1HLPENR_SWPMILPEN_Pos           (2U)                            
#define RCC_APB1HLPENR_SWPMILPEN_Msk           (0x1U << RCC_APB1HLPENR_SWPMILPEN_Pos) /*!< 0x00000004 */
#define RCC_APB1HLPENR_SWPMILPEN               RCC_APB1HLPENR_SWPMILPEN_Msk    
#define RCC_APB1HLPENR_OPAMPLPEN_Pos           (4U)                            
#define RCC_APB1HLPENR_OPAMPLPEN_Msk           (0x1U << RCC_APB1HLPENR_OPAMPLPEN_Pos) /*!< 0x00000010 */
#define RCC_APB1HLPENR_OPAMPLPEN               RCC_APB1HLPENR_OPAMPLPEN_Msk    
#define RCC_APB1HLPENR_MDIOSLPEN_Pos           (5U)                            
#define RCC_APB1HLPENR_MDIOSLPEN_Msk           (0x1U << RCC_APB1HLPENR_MDIOSLPEN_Pos) /*!< 0x00000020 */
#define RCC_APB1HLPENR_MDIOSLPEN               RCC_APB1HLPENR_MDIOSLPEN_Msk    
#define RCC_APB1HLPENR_FDCANLPEN_Pos           (8U)                            
#define RCC_APB1HLPENR_FDCANLPEN_Msk           (0x1U << RCC_APB1HLPENR_FDCANLPEN_Pos) /*!< 0x00000100 */
#define RCC_APB1HLPENR_FDCANLPEN               RCC_APB1HLPENR_FDCANLPEN_Msk    

/********************  Bit definition for RCC_APB2LPENR register  ******************/
#define RCC_APB2LPENR_TIM1LPEN_Pos             (0U)                            
#define RCC_APB2LPENR_TIM1LPEN_Msk             (0x1U << RCC_APB2LPENR_TIM1LPEN_Pos) /*!< 0x00000001 */
#define RCC_APB2LPENR_TIM1LPEN                 RCC_APB2LPENR_TIM1LPEN_Msk      
#define RCC_APB2LPENR_TIM8LPEN_Pos             (1U)                            
#define RCC_APB2LPENR_TIM8LPEN_Msk             (0x1U << RCC_APB2LPENR_TIM8LPEN_Pos) /*!< 0x00000002 */
#define RCC_APB2LPENR_TIM8LPEN                 RCC_APB2LPENR_TIM8LPEN_Msk      
#define RCC_APB2LPENR_USART1LPEN_Pos           (4U)                            
#define RCC_APB2LPENR_USART1LPEN_Msk           (0x1U << RCC_APB2LPENR_USART1LPEN_Pos) /*!< 0x00000010 */
#define RCC_APB2LPENR_USART1LPEN               RCC_APB2LPENR_USART1LPEN_Msk    
#define RCC_APB2LPENR_USART6LPEN_Pos           (5U)                            
#define RCC_APB2LPENR_USART6LPEN_Msk           (0x1U << RCC_APB2LPENR_USART6LPEN_Pos) /*!< 0x00000020 */
#define RCC_APB2LPENR_USART6LPEN               RCC_APB2LPENR_USART6LPEN_Msk    
#define RCC_APB2LPENR_SPI1LPEN_Pos             (12U)                           
#define RCC_APB2LPENR_SPI1LPEN_Msk             (0x1U << RCC_APB2LPENR_SPI1LPEN_Pos) /*!< 0x00001000 */
#define RCC_APB2LPENR_SPI1LPEN                 RCC_APB2LPENR_SPI1LPEN_Msk      
#define RCC_APB2LPENR_SPI4LPEN_Pos             (13U)                           
#define RCC_APB2LPENR_SPI4LPEN_Msk             (0x1U << RCC_APB2LPENR_SPI4LPEN_Pos) /*!< 0x00002000 */
#define RCC_APB2LPENR_SPI4LPEN                 RCC_APB2LPENR_SPI4LPEN_Msk      
#define RCC_APB2LPENR_TIM15LPEN_Pos            (16U)                           
#define RCC_APB2LPENR_TIM15LPEN_Msk            (0x1U << RCC_APB2LPENR_TIM15LPEN_Pos) /*!< 0x00010000 */
#define RCC_APB2LPENR_TIM15LPEN                RCC_APB2LPENR_TIM15LPEN_Msk     
#define RCC_APB2LPENR_TIM16LPEN_Pos            (17U)                           
#define RCC_APB2LPENR_TIM16LPEN_Msk            (0x1U << RCC_APB2LPENR_TIM16LPEN_Pos) /*!< 0x00020000 */
#define RCC_APB2LPENR_TIM16LPEN                RCC_APB2LPENR_TIM16LPEN_Msk     
#define RCC_APB2LPENR_TIM17LPEN_Pos            (18U)                           
#define RCC_APB2LPENR_TIM17LPEN_Msk            (0x1U << RCC_APB2LPENR_TIM17LPEN_Pos) /*!< 0x00040000 */
#define RCC_APB2LPENR_TIM17LPEN                RCC_APB2LPENR_TIM17LPEN_Msk     
#define RCC_APB2LPENR_SPI5LPEN_Pos             (20U)                           
#define RCC_APB2LPENR_SPI5LPEN_Msk             (0x1U << RCC_APB2LPENR_SPI5LPEN_Pos) /*!< 0x00100000 */
#define RCC_APB2LPENR_SPI5LPEN                 RCC_APB2LPENR_SPI5LPEN_Msk      
#define RCC_APB2LPENR_SAI1LPEN_Pos             (22U)                           
#define RCC_APB2LPENR_SAI1LPEN_Msk             (0x1U << RCC_APB2LPENR_SAI1LPEN_Pos) /*!< 0x00400000 */
#define RCC_APB2LPENR_SAI1LPEN                 RCC_APB2LPENR_SAI1LPEN_Msk      
#define RCC_APB2LPENR_SAI2LPEN_Pos             (23U)                           
#define RCC_APB2LPENR_SAI2LPEN_Msk             (0x1U << RCC_APB2LPENR_SAI2LPEN_Pos) /*!< 0x00800000 */
#define RCC_APB2LPENR_SAI2LPEN                 RCC_APB2LPENR_SAI2LPEN_Msk      
#define RCC_APB2LPENR_SAI3LPEN_Pos             (24U)                           
#define RCC_APB2LPENR_SAI3LPEN_Msk             (0x1U << RCC_APB2LPENR_SAI3LPEN_Pos) /*!< 0x01000000 */
#define RCC_APB2LPENR_SAI3LPEN                 RCC_APB2LPENR_SAI3LPEN_Msk      
#define RCC_APB2LPENR_DFSDM1LPEN_Pos           (28U)                           
#define RCC_APB2LPENR_DFSDM1LPEN_Msk           (0x1U << RCC_APB2LPENR_DFSDM1LPEN_Pos) /*!< 0x10000000 */
#define RCC_APB2LPENR_DFSDM1LPEN               RCC_APB2LPENR_DFSDM1LPEN_Msk    
#define RCC_APB2LPENR_HRTIMLPEN_Pos            (29U)                           
#define RCC_APB2LPENR_HRTIMLPEN_Msk            (0x1U << RCC_APB2LPENR_HRTIMLPEN_Pos) /*!< 0x20000000 */
#define RCC_APB2LPENR_HRTIMLPEN                RCC_APB2LPENR_HRTIMLPEN_Msk     

