bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/********************  Bit definition for RCC_APB4LPENR register  ******************/
#define RCC_APB4LPENR_SYSCFGLPEN_Pos           (1U)                            
#define RCC_APB4LPENR_SYSCFGLPEN_Msk           (0x1U << RCC_APB4LPENR_SYSCFGLPEN_Pos) /*!< 0x00000002 */
#define RCC_APB4LPENR_SYSCFGLPEN               RCC_APB4LPENR_SYSCFGLPEN_Msk    
#define RCC_APB4LPENR_LPUART1LPEN_Pos          (3U)                            
#define RCC_APB4LPENR_LPUART1LPEN_Msk          (0x1U << RCC_APB4LPENR_LPUART1LPEN_Pos) /*!< 0x00000008 */
#define RCC_APB4LPENR_LPUART1LPEN              RCC_APB4LPENR_LPUART1LPEN_Msk   
#define RCC_APB4LPENR_SPI6LPEN_Pos             (5U)                            
#define RCC_APB4LPENR_SPI6LPEN_Msk             (0x1U << RCC_APB4LPENR_SPI6LPEN_Pos) /*!< 0x00000020 */
#define RCC_APB4LPENR_SPI6LPEN                 RCC_APB4LPENR_SPI6LPEN_Msk      
#define RCC_APB4LPENR_I2C4LPEN_Pos             (7U)                            
#define RCC_APB4LPENR_I2C4LPEN_Msk             (0x1U << RCC_APB4LPENR_I2C4LPEN_Pos) /*!< 0x00000080 */
#define RCC_APB4LPENR_I2C4LPEN                 RCC_APB4LPENR_I2C4LPEN_Msk      
#define RCC_APB4LPENR_LPTIM2LPEN_Pos           (9U)                            
#define RCC_APB4LPENR_LPTIM2LPEN_Msk           (0x1U << RCC_APB4LPENR_LPTIM2LPEN_Pos) /*!< 0x00000200 */
#define RCC_APB4LPENR_LPTIM2LPEN               RCC_APB4LPENR_LPTIM2LPEN_Msk    
#define RCC_APB4LPENR_LPTIM3LPEN_Pos           (10U)                           
#define RCC_APB4LPENR_LPTIM3LPEN_Msk           (0x1U << RCC_APB4LPENR_LPTIM3LPEN_Pos) /*!< 0x00000400 */
#define RCC_APB4LPENR_LPTIM3LPEN               RCC_APB4LPENR_LPTIM3LPEN_Msk    
#define RCC_APB4LPENR_LPTIM4LPEN_Pos           (11U)                           
#define RCC_APB4LPENR_LPTIM4LPEN_Msk           (0x1U << RCC_APB4LPENR_LPTIM4LPEN_Pos) /*!< 0x00000800 */
#define RCC_APB4LPENR_LPTIM4LPEN               RCC_APB4LPENR_LPTIM4LPEN_Msk    
#define RCC_APB4LPENR_LPTIM5LPEN_Pos           (12U)                           
#define RCC_APB4LPENR_LPTIM5LPEN_Msk           (0x1U << RCC_APB4LPENR_LPTIM5LPEN_Pos) /*!< 0x00001000 */
#define RCC_APB4LPENR_LPTIM5LPEN               RCC_APB4LPENR_LPTIM5LPEN_Msk    
#define RCC_APB4LPENR_COMP12LPEN_Pos           (14U)                           
#define RCC_APB4LPENR_COMP12LPEN_Msk           (0x1U << RCC_APB4LPENR_COMP12LPEN_Pos) /*!< 0x00004000 */
#define RCC_APB4LPENR_COMP12LPEN               RCC_APB4LPENR_COMP12LPEN_Msk    
#define RCC_APB4LPENR_VREFLPEN_Pos             (15U)                           
#define RCC_APB4LPENR_VREFLPEN_Msk             (0x1U << RCC_APB4LPENR_VREFLPEN_Pos) /*!< 0x00008000 */
#define RCC_APB4LPENR_VREFLPEN                 RCC_APB4LPENR_VREFLPEN_Msk      
#define RCC_APB4LPENR_RTCAPBLPEN_Pos           (16U)                           
#define RCC_APB4LPENR_RTCAPBLPEN_Msk           (0x1U << RCC_APB4LPENR_RTCAPBLPEN_Pos) /*!< 0x00010000 */
#define RCC_APB4LPENR_RTCAPBLPEN               RCC_APB4LPENR_RTCAPBLPEN_Msk    
#define RCC_APB4LPENR_SAI4LPEN_Pos             (21U)                           
#define RCC_APB4LPENR_SAI4LPEN_Msk             (0x1U << RCC_APB4LPENR_SAI4LPEN_Pos) /*!< 0x00200000 */
#define RCC_APB4LPENR_SAI4LPEN                 RCC_APB4LPENR_SAI4LPEN_Msk      

/********************  Bit definition for RCC_RSR register  *******************/
#define RCC_RSR_RMVF_Pos                       (16U)                           
#define RCC_RSR_RMVF_Msk                       (0x1U << RCC_RSR_RMVF_Pos)      /*!< 0x00010000 */
#define RCC_RSR_RMVF                           RCC_RSR_RMVF_Msk                
#define RCC_RSR_CPURSTF_Pos                    (17U)                           
#define RCC_RSR_CPURSTF_Msk                    (0x1U << RCC_RSR_CPURSTF_Pos)   /*!< 0x00020000 */
#define RCC_RSR_CPURSTF                        RCC_RSR_CPURSTF_Msk             
#define RCC_RSR_D1RSTF_Pos                     (19U)                           
#define RCC_RSR_D1RSTF_Msk                     (0x1U << RCC_RSR_D1RSTF_Pos)    /*!< 0x00080000 */
#define RCC_RSR_D1RSTF                         RCC_RSR_D1RSTF_Msk              
#define RCC_RSR_D2RSTF_Pos                     (20U)                           
#define RCC_RSR_D2RSTF_Msk                     (0x1U << RCC_RSR_D2RSTF_Pos)    /*!< 0x00100000 */
#define RCC_RSR_D2RSTF                         RCC_RSR_D2RSTF_Msk              
#define RCC_RSR_BORRSTF_Pos                    (21U)                           
#define RCC_RSR_BORRSTF_Msk                    (0x1U << RCC_RSR_BORRSTF_Pos)   /*!< 0x00200000 */
#define RCC_RSR_BORRSTF                        RCC_RSR_BORRSTF_Msk             
#define RCC_RSR_PINRSTF_Pos                    (22U)                           
#define RCC_RSR_PINRSTF_Msk                    (0x1U << RCC_RSR_PINRSTF_Pos)   /*!< 0x00400000 */
#define RCC_RSR_PINRSTF                        RCC_RSR_PINRSTF_Msk             
#define RCC_RSR_PORRSTF_Pos                    (23U)                           
#define RCC_RSR_PORRSTF_Msk                    (0x1U << RCC_RSR_PORRSTF_Pos)   /*!< 0x00800000 */
#define RCC_RSR_PORRSTF                        RCC_RSR_PORRSTF_Msk             
#define RCC_RSR_SFTRSTF_Pos                    (24U)                           
#define RCC_RSR_SFTRSTF_Msk                    (0x1U << RCC_RSR_SFTRSTF_Pos)   /*!< 0x01000000 */
#define RCC_RSR_SFTRSTF                        RCC_RSR_SFTRSTF_Msk             
#define RCC_RSR_IWDG1RSTF_Pos                  (26U)                           
#define RCC_RSR_IWDG1RSTF_Msk                  (0x1U << RCC_RSR_IWDG1RSTF_Pos) /*!< 0x04000000 */
#define RCC_RSR_IWDG1RSTF                      RCC_RSR_IWDG1RSTF_Msk           
#define RCC_RSR_WWDG1RSTF_Pos                  (28U)                           
#define RCC_RSR_WWDG1RSTF_Msk                  (0x1U << RCC_RSR_WWDG1RSTF_Pos) /*!< 0x10000000 */
#define RCC_RSR_WWDG1RSTF                      RCC_RSR_WWDG1RSTF_Msk           
#define RCC_RSR_LPWRRSTF_Pos                   (30U)                           
#define RCC_RSR_LPWRRSTF_Msk                   (0x1U << RCC_RSR_LPWRRSTF_Pos)  /*!< 0x40000000 */
#define RCC_RSR_LPWRRSTF                       RCC_RSR_LPWRRSTF_Msk            

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)                                               
#define RNG_CR_RNGEN_Msk    (0x1U << RNG_CR_RNGEN_Pos)                         /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk                                   
#define RNG_CR_IE_Pos       (3U)                                               
#define RNG_CR_IE_Msk       (0x1U << RNG_CR_IE_Pos)                            /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk                                      
#define RNG_CR_CED_Pos      (5U)                                               
#define RNG_CR_CED_Msk      (0x1U << RNG_CR_CED_Pos)                           /*!< 0x00000020 */
#define RNG_CR_CED          RNG_CR_CED_Msk                                     

