bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/******************  Bit definition for SAI_xCLRFR register  ******************/
#define  SAI_xCLRFR_COVRUDR                  0x00000001U        /*!<Clear Overrun underrun                               */
#define  SAI_xCLRFR_CMUTEDET                 0x00000002U        /*!<Clear Mute detection                                 */
#define  SAI_xCLRFR_CWCKCFG                  0x00000004U        /*!<Clear Wrong Clock Configuration                      */
#define  SAI_xCLRFR_CFREQ                    0x00000008U        /*!<Clear FIFO request                                   */
#define  SAI_xCLRFR_CCNRDY                   0x00000010U        /*!<Clear Codec not ready                                */
#define  SAI_xCLRFR_CAFSDET                  0x00000020U        /*!<Clear Anticipated frame synchronization detection    */
#define  SAI_xCLRFR_CLFSDET                  0x00000040U        /*!<Clear Late frame synchronization detection           */

/******************  Bit definition for SAI_xDR register  *********************/
#define  SAI_xDR_DATA                        0xFFFFFFFFU        

/*******************  Bit definition for SAI_PDMCR register  ******************/
#define  SAI_PDMCR_PDMEN                  0x00000001U           /*!<PDM Enable                                          */

#define  SAI_PDMCR_MICNBR                 0x00000030U           /*!<Number of microphones                               */
#define  SAI_PDMCR_MICNBR_0               0x00000010U           /*!<Bit 0 */
#define  SAI_PDMCR_MICNBR_1               0x00000020U           /*!<Bit 1 */

#define  SAI_PDMCR_CKEN1                  0x00000100U           /*!<Clock enable of bitstream clock number 1            */
#define  SAI_PDMCR_CKEN2                  0x00000200U           /*!<Clock enable of bitstream clock number 2            */
#define  SAI_PDMCR_CKEN3                  0x00000400U           /*!<Clock enable of bitstream clock number 3            */
#define  SAI_PDMCR_CKEN4                  0x00000800U           /*!<Clock enable of bitstream clock number 4            */

/******************  Bit definition for SAI_PDMDLY register  ******************/
#define  SAI_PDMDLY_DLYM1L                0x00000007U           /*!<DLYM1L[2:0] (Delay line adjust for left microphone of pair 1) */
#define  SAI_PDMDLY_DLYM1L_0              0x00000001U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM1L_1              0x00000002U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM1L_2              0x00000004U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM1R                0x00000070U           /*!<DLYM1R[2:0] (Delay line adjust for right microphone of pair 1) */
#define  SAI_PDMDLY_DLYM1R_0              0x00000010U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM1R_1              0x00000020U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM1R_2              0x00000040U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM2L                0x00000700U           /*!<DLYM2L[2:0] (Delay line adjust for left microphone of pair 2) */
#define  SAI_PDMDLY_DLYM2L_0              0x00000100U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM2L_1              0x00000200U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM2L_2              0x00000400U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM2R                0x00007000U           /*!<DLYM2R[2:0] (Delay line adjust for right microphone of pair 2)*/
#define  SAI_PDMDLY_DLYM2R_0              0x00001000U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM2R_1              0x00002000U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM2R_2              0x00004000U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM3L                0x00070000U           /*!<DLYM3L[2:0] (Delay line adjust for left microphone of pair 3)*/
#define  SAI_PDMDLY_DLYM3L_0              0x00010000U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM3L_1              0x00020000U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM3L_2              0x00040000U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM3R                0x00700000U           /*!<DLYM3R[2:0] (Delay line adjust for right microphone of pair 3)*/
#define  SAI_PDMDLY_DLYM3R_0              0x00100000U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM3R_1              0x00200000U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM3R_2              0x00400000U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM4L                0x07000000U           /*!<DLYM4L[2:0] (Delay line adjust for left microphone of pair 4)*/
#define  SAI_PDMDLY_DLYM4L_0              0x01000000U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM4L_1              0x02000000U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM4L_2              0x04000000U           /*!<Bit 2 */

#define  SAI_PDMDLY_DLYM4R                0x70000000U           /*!<DLYM4R[2:0] (Delay line adjust for right microphone of pair 4)*/
#define  SAI_PDMDLY_DLYM4R_0              0x10000000U           /*!<Bit 0 */
#define  SAI_PDMDLY_DLYM4R_1              0x20000000U           /*!<Bit 1 */
#define  SAI_PDMDLY_DLYM4R_2              0x40000000U           /*!<Bit 2 */

/******************************************************************************/
/*                                                                            */
/*                           SDMMC Interface                                  */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SDMMC_POWER register  ******************/
#define SDMMC_POWER_PWRCTRL_Pos          (0U)                                  
#define SDMMC_POWER_PWRCTRL_Msk          (0x3U << SDMMC_POWER_PWRCTRL_Pos)     /*!< 0x00000003 */
#define SDMMC_POWER_PWRCTRL              SDMMC_POWER_PWRCTRL_Msk               /*!<PWRCTRL[1:0] bits (Power supply control bits) */
#define SDMMC_POWER_PWRCTRL_0            (0x1U << SDMMC_POWER_PWRCTRL_Pos)     /*!< 0x00000001 */
#define SDMMC_POWER_PWRCTRL_1            (0x2U << SDMMC_POWER_PWRCTRL_Pos)     /*!< 0x00000002 */
#define SDMMC_POWER_VSWITCH_Pos          (2U)                                  
#define SDMMC_POWER_VSWITCH_Msk          (0x1U << SDMMC_POWER_VSWITCH_Pos)     /*!< 0x00000004 */
#define SDMMC_POWER_VSWITCH              SDMMC_POWER_VSWITCH_Msk               /*!<Voltage switch sequence start */
#define SDMMC_POWER_VSWITCHEN_Pos        (3U)                                  
#define SDMMC_POWER_VSWITCHEN_Msk        (0x1U << SDMMC_POWER_VSWITCHEN_Pos)   /*!< 0x00000008 */
#define SDMMC_POWER_VSWITCHEN            SDMMC_POWER_VSWITCHEN_Msk             /*!<Voltage switch procedure enable */
#define SDMMC_POWER_DIRPOL_Pos           (4U)                                  
#define SDMMC_POWER_DIRPOL_Msk           (0x1U << SDMMC_POWER_DIRPOL_Pos)      /*!< 0x00000010 */
#define SDMMC_POWER_DIRPOL               SDMMC_POWER_DIRPOL_Msk                /*!<Data and Command direction signals polarity selection */

/******************  Bit definition for SDMMC_CLKCR register  ******************/
#define SDMMC_CLKCR_CLKDIV_Pos           (0U)                                  
#define SDMMC_CLKCR_CLKDIV_Msk           (0x3FFU << SDMMC_CLKCR_CLKDIV_Pos)    /*!< 0x000003FF */
#define SDMMC_CLKCR_CLKDIV               SDMMC_CLKCR_CLKDIV_Msk                /*!<Clock divide factor             */
#define SDMMC_CLKCR_PWRSAV_Pos           (12U)                                 
#define SDMMC_CLKCR_PWRSAV_Msk           (0x1U << SDMMC_CLKCR_PWRSAV_Pos)      /*!< 0x00001000 */
#define SDMMC_CLKCR_PWRSAV               SDMMC_CLKCR_PWRSAV_Msk                /*!<Power saving configuration bit  */

#define SDMMC_CLKCR_WIDBUS_Pos           (14U)                                 
#define SDMMC_CLKCR_WIDBUS_Msk           (0x3U << SDMMC_CLKCR_WIDBUS_Pos)      /*!< 0x0000C000 */
#define SDMMC_CLKCR_WIDBUS               SDMMC_CLKCR_WIDBUS_Msk                /*!<WIDBUS[1:0] bits (Wide bus mode enable bit) */
#define SDMMC_CLKCR_WIDBUS_0             (0x1U << SDMMC_CLKCR_WIDBUS_Pos)      /*!< 0x00004000 */
#define SDMMC_CLKCR_WIDBUS_1             (0x2U << SDMMC_CLKCR_WIDBUS_Pos)      /*!< 0x00008000 */

