bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/******************  Bit definition for SYSCFG_UR9 register  *******************/
#define SYSCFG_UR9_WRPN_BANK2_Pos       (0U)                                   
#define SYSCFG_UR9_WRPN_BANK2_Msk       (0xFFU << SYSCFG_UR9_WRPN_BANK2_Pos)   /*!< 0x000000FF */
#define SYSCFG_UR9_WRPN_BANK2           SYSCFG_UR9_WRPN_BANK2_Msk              /*!< Write protection for flash bank 2 */
#define SYSCFG_UR9_PABEG_BANK2_Pos      (16U)                                  
#define SYSCFG_UR9_PABEG_BANK2_Msk      (0xFFFU << SYSCFG_UR9_PABEG_BANK2_Pos) /*!< 0x0FFF0000 */
#define SYSCFG_UR9_PABEG_BANK2          SYSCFG_UR9_PABEG_BANK2_Msk             /*!< Protected area start address for bank 2 */

/******************  Bit definition for SYSCFG_UR10 register  *******************/
#define SYSCFG_UR10_PAEND_BANK2_Pos     (0U)                                   
#define SYSCFG_UR10_PAEND_BANK2_Msk     (0xFFFU << SYSCFG_UR10_PAEND_BANK2_Pos) /*!< 0x00000FFF */
#define SYSCFG_UR10_PAEND_BANK2         SYSCFG_UR10_PAEND_BANK2_Msk            /*!< Protected area end address for bank 2 */
#define SYSCFG_UR10_SABEG_BANK2_Pos     (16U)                                  
#define SYSCFG_UR10_SABEG_BANK2_Msk     (0xFFFU << SYSCFG_UR10_SABEG_BANK2_Pos) /*!< 0x0FFF0000 */
#define SYSCFG_UR10_SABEG_BANK2         SYSCFG_UR10_SABEG_BANK2_Msk            /*!< Secured area start address for bank 2 */

/******************  Bit definition for SYSCFG_UR11 register  *******************/
#define SYSCFG_UR11_SAEND_BANK2_Pos     (0U)                                   
#define SYSCFG_UR11_SAEND_BANK2_Msk     (0xFFFU << SYSCFG_UR11_SAEND_BANK2_Pos) /*!< 0x00000FFF */
#define SYSCFG_UR11_SAEND_BANK2         SYSCFG_UR11_SAEND_BANK2_Msk            /*!< Secured area end address for bank 2 */
#define SYSCFG_UR11_IWDG1M_Pos          (16U)                                  
#define SYSCFG_UR11_IWDG1M_Msk          (0x1U << SYSCFG_UR11_IWDG1M_Pos)       /*!< 0x00010000 */
#define SYSCFG_UR11_IWDG1M              SYSCFG_UR11_IWDG1M_Msk                 /*!< Independent Watchdog 1 mode (SW or HW) */

/******************  Bit definition for SYSCFG_UR12 register  *******************/

#define SYSCFG_UR12_SECURE_Pos          (16U)                                  
#define SYSCFG_UR12_SECURE_Msk          (0x1U << SYSCFG_UR12_SECURE_Pos)       /*!< 0x00010000 */
#define SYSCFG_UR12_SECURE              SYSCFG_UR12_SECURE_Msk                 /*!< Secure mode status */

/******************  Bit definition for SYSCFG_UR13 register  *******************/
#define SYSCFG_UR13_SDRS_Pos            (0U)                                   
#define SYSCFG_UR13_SDRS_Msk            (0x3U << SYSCFG_UR13_SDRS_Pos)         /*!< 0x00000003 */
#define SYSCFG_UR13_SDRS                SYSCFG_UR13_SDRS_Msk                   /*!< Secured DTCM RAM Size */
#define SYSCFG_UR13_D1SBRST_Pos         (16U)                                  
#define SYSCFG_UR13_D1SBRST_Msk         (0x1U << SYSCFG_UR13_D1SBRST_Pos)      /*!< 0x00010000 */
#define SYSCFG_UR13_D1SBRST             SYSCFG_UR13_D1SBRST_Msk                /*!< D1 Standby reset */

/******************  Bit definition for SYSCFG_UR14 register  *******************/
#define SYSCFG_UR14_D1STPRST_Pos        (0U)                                   
#define SYSCFG_UR14_D1STPRST_Msk        (0x1U << SYSCFG_UR14_D1STPRST_Pos)     /*!< 0x00000001 */
#define SYSCFG_UR14_D1STPRST            SYSCFG_UR14_D1STPRST_Msk               /*!< D1 Stop Reset */

/******************  Bit definition for SYSCFG_UR15 register  *******************/
#define SYSCFG_UR15_FZIWDGSTB_Pos       (16U)                                  
#define SYSCFG_UR15_FZIWDGSTB_Msk       (0x1U << SYSCFG_UR15_FZIWDGSTB_Pos)    /*!< 0x00010000 */
#define SYSCFG_UR15_FZIWDGSTB           SYSCFG_UR15_FZIWDGSTB_Msk              /*!< Freeze independent watchdogs in Standby mode */

/******************  Bit definition for SYSCFG_UR16 register  *******************/
#define SYSCFG_UR16_FZIWDGSTP_Pos       (0U)                                   
#define SYSCFG_UR16_FZIWDGSTP_Msk       (0x1U << SYSCFG_UR16_FZIWDGSTP_Pos)    /*!< 0x00000001 */
#define SYSCFG_UR16_FZIWDGSTP           SYSCFG_UR16_FZIWDGSTP_Msk              /*!< Freeze independent watchdogs in Stop mode */
#define SYSCFG_UR16_PKP_Pos             (16U)                                  
#define SYSCFG_UR16_PKP_Msk             (0x1U << SYSCFG_UR16_PKP_Pos)          /*!< 0x00010000 */
#define SYSCFG_UR16_PKP                 SYSCFG_UR16_PKP_Msk                    /*!< Private key programmed */

/******************  Bit definition for SYSCFG_UR17 register  *******************/
#define SYSCFG_UR17_IOHSLV_Pos          (0U)                                   
#define SYSCFG_UR17_IOHSLV_Msk          (0x1U << SYSCFG_UR17_IOHSLV_Pos)       /*!< 0x00000001 */
#define SYSCFG_UR17_IOHSLV              SYSCFG_UR17_IOHSLV_Msk                 /*!< I/O high speed / low voltage */


/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define TIM_CR1_CEN               ((uint16_t)0x0001)                           /*!<Counter enable */
#define TIM_CR1_UDIS              ((uint16_t)0x0002)                           /*!<Update disable */
#define TIM_CR1_URS               ((uint16_t)0x0004)                           /*!<Update request source */
#define TIM_CR1_OPM               ((uint16_t)0x0008)                           /*!<One pulse mode */
#define TIM_CR1_DIR               ((uint16_t)0x0010)                           /*!<Direction */

#define TIM_CR1_CMS               ((uint16_t)0x0060)                           /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             ((uint16_t)0x0020)                           /*!<Bit 0 */
#define TIM_CR1_CMS_1             ((uint16_t)0x0040)                           /*!<Bit 1 */

