bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define TIM_CCMR3_OC5CE_Pos       (7U)                                         
#define TIM_CCMR3_OC5CE_Msk       (0x1U << TIM_CCMR3_OC5CE_Pos)                /*!< 0x00000080 */
#define TIM_CCMR3_OC5CE           TIM_CCMR3_OC5CE_Msk                          /*!<Output Compare 5 Clear Enable */

#define TIM_CCMR3_OC6FE_Pos       (10U)                                        
#define TIM_CCMR3_OC6FE_Msk       (0x1U << TIM_CCMR3_OC6FE_Pos)                /*!< 0x00000400 */
#define TIM_CCMR3_OC6FE           TIM_CCMR3_OC6FE_Msk                          /*!<Output Compare 4 Fast enable */
#define TIM_CCMR3_OC6PE_Pos       (11U)                                        
#define TIM_CCMR3_OC6PE_Msk       (0x1U << TIM_CCMR3_OC6PE_Pos)                /*!< 0x00000800 */
#define TIM_CCMR3_OC6PE           TIM_CCMR3_OC6PE_Msk                          /*!<Output Compare 4 Preload enable */

#define TIM_CCMR3_OC6M_Pos        (12U)                                        
#define TIM_CCMR3_OC6M_Msk        (0x7U << TIM_CCMR3_OC6M_Pos)                 /*!< 0x00007000 */
#define TIM_CCMR3_OC6M            TIM_CCMR3_OC6M_Msk                           /*!<OC4M[2:0] bits (Output Compare 4 Mode) */
#define TIM_CCMR3_OC6M_0          (0x1U << TIM_CCMR3_OC6M_Pos)                 /*!< 0x00001000 */
#define TIM_CCMR3_OC6M_1          (0x2U << TIM_CCMR3_OC6M_Pos)                 /*!< 0x00002000 */
#define TIM_CCMR3_OC6M_2          (0x4U << TIM_CCMR3_OC6M_Pos)                 /*!< 0x00004000 */
#define TIM_CCMR3_OC6M_3          (0x100U << TIM_CCMR3_OC6M_Pos)               /*!< 0x00100000 */

#define TIM_CCMR3_OC6CE_Pos       (15U)                                        
#define TIM_CCMR3_OC6CE_Msk       (0x1U << TIM_CCMR3_OC6CE_Pos)                /*!< 0x00008000 */
#define TIM_CCMR3_OC6CE           TIM_CCMR3_OC6CE_Msk                          /*!<Output Compare 4 Clear Enable */
/*******************  Bit definition for TIM1_AF1 register  *********************/
#define TIM1_AF1_BKINE_Pos         (0U)                                        
#define TIM1_AF1_BKINE_Msk         (0x1U << TIM1_AF1_BKINE_Pos)                /*!< 0x00000001 */
#define TIM1_AF1_BKINE             TIM1_AF1_BKINE_Msk                          /*!<BKINE Break input enable bit */
#define TIM1_AF1_BKCMP1E_Pos       (1U)                                        
#define TIM1_AF1_BKCMP1E_Msk       (0x1U << TIM1_AF1_BKCMP1E_Pos)              /*!< 0x00000002 */
#define TIM1_AF1_BKCMP1E           TIM1_AF1_BKCMP1E_Msk                        /*!<BKCMP1E Break Compare1 Enable bit */
#define TIM1_AF1_BKCMP2E_Pos       (2U)                                        
#define TIM1_AF1_BKCMP2E_Msk       (0x1U << TIM1_AF1_BKCMP2E_Pos)              /*!< 0x00000004 */
#define TIM1_AF1_BKCMP2E           TIM1_AF1_BKCMP2E_Msk                        /*!<BKCMP1E Break Compare2 Enable bit  */
#define TIM1_AF1_BKDFBK0E_Pos      (8U)                                        
#define TIM1_AF1_BKDFBK0E_Msk      (0x1U << TIM1_AF1_BKDFBK0E_Pos)             /*!< 0x00000100 */
#define TIM1_AF1_BKDFBK0E          TIM1_AF1_BKDFBK0E_Msk                       /*!<BKDFBK0E Break input DFSDM Break 0 */
#define TIM1_AF1_BKINP_Pos         (9U)                                        
#define TIM1_AF1_BKINP_Msk         (0x1U << TIM1_AF1_BKINP_Pos)                /*!< 0x00000200 */
#define TIM1_AF1_BKINP             TIM1_AF1_BKINP_Msk                          /*!<BRKINP Break input polarity */
#define TIM1_AF1_BKCMP1P_Pos       (10U)                                       
#define TIM1_AF1_BKCMP1P_Msk       (0x1U << TIM1_AF1_BKCMP1P_Pos)              /*!< 0x00000400 */
#define TIM1_AF1_BKCMP1P           TIM1_AF1_BKCMP1P_Msk                        /*!<BKCMP1P Break COMP1 input polarity */ 
#define TIM1_AF1_BKCMP2P_Pos       (11U)                                       
#define TIM1_AF1_BKCMP2P_Msk       (0x1U << TIM1_AF1_BKCMP2P_Pos)              /*!< 0x00000800 */
#define TIM1_AF1_BKCMP2P           TIM1_AF1_BKCMP2P_Msk                        /*!<BKCMP2P Break COMP2 input polarity */ 

#define TIM1_AF1_ETR_SEL_Pos       (14U)                                       
#define TIM1_AF1_ETR_SEL_Msk       (0xFU << TIM1_AF1_ETR_SEL_Pos)              /*!< 0x0003C000 */
#define TIM1_AF1_ETR_SEL           TIM1_AF1_ETR_SEL_Msk                        /*!<ETR_SEL[3:0] bits (TIM1 ETR SEL) */
#define TIM1_AF1_ETR_SEL_0         (0x1U << TIM1_AF1_ETR_SEL_Pos)              /*!< 0x00004000 */
#define TIM1_AF1_ETR_SEL_1         (0x2U << TIM1_AF1_ETR_SEL_Pos)              /*!< 0x00008000 */
#define TIM1_AF1_ETR_SEL_2         (0x4U << TIM1_AF1_ETR_SEL_Pos)              /*!< 0x00010000 */
#define TIM1_AF1_ETR_SEL_3         (0x8U << TIM1_AF1_ETR_SEL_Pos)              /*!< 0x00020000 */

/*******************  Bit definition for TIM1_AF2 register  *********************/
#define TIM1_AF2_BK2INE_Pos        (0U)                                        
#define TIM1_AF2_BK2INE_Msk        (0x1U << TIM1_AF2_BK2INE_Pos)               /*!< 0x00000001 */
#define TIM1_AF2_BK2INE            TIM1_AF2_BK2INE_Msk                         /*!<BK2INE Break input 2 enable bit */
#define TIM1_AF2_BK2CMP1E_Pos      (1U)                                        
#define TIM1_AF2_BK2CMP1E_Msk      (0x1U << TIM1_AF2_BK2CMP1E_Pos)             /*!< 0x00000002 */
#define TIM1_AF2_BK2CMP1E          TIM1_AF2_BK2CMP1E_Msk                       /*!<BK2CMP1E Break2 Compare1 Enable bit */
#define TIM1_AF2_BK2CMP2E_Pos      (2U)                                        
#define TIM1_AF2_BK2CMP2E_Msk      (0x1U << TIM1_AF2_BK2CMP2E_Pos)             /*!< 0x00000004 */
#define TIM1_AF2_BK2CMP2E          TIM1_AF2_BK2CMP2E_Msk                       /*!<BK2CMP1E Break2 Compare2 Enable bit  */
#define TIM1_AF2_BK2DFBK1E_Pos     (8U)                                        
#define TIM1_AF2_BK2DFBK1E_Msk     (0x1U << TIM1_AF2_BK2DFBK1E_Pos)            /*!< 0x00000100 */
#define TIM1_AF2_BK2DFBK1E         TIM1_AF2_BK2DFBK1E_Msk                      /*!<BK2DFBK1E Break input2 DFSDM Break 1 */
#define TIM1_AF2_BK2INP_Pos        (9U)                                        
#define TIM1_AF2_BK2INP_Msk        (0x1U << TIM1_AF2_BK2INP_Pos)               /*!< 0x00000200 */
#define TIM1_AF2_BK2INP            TIM1_AF2_BK2INP_Msk                         /*!<BRKINP Break2 input polarity */
#define TIM1_AF2_BK2CMP1P_Pos      (10U)                                       
#define TIM1_AF2_BK2CMP1P_Msk      (0x1U << TIM1_AF2_BK2CMP1P_Pos)             /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP1P          TIM1_AF2_BK2CMP1P_Msk                       /*!<BKCMP1P Break2 COMP1 input polarity */ 
#define TIM1_AF2_BK2CMP2P_Pos      (11U)                                       
#define TIM1_AF2_BK2CMP2P_Msk      (0x1U << TIM1_AF2_BK2CMP2P_Pos)             /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP2P          TIM1_AF2_BK2CMP2P_Msk                       /*!<BKCMP2P Break2 COMP2 input polarity */ 

/*******************  Bit definition for TIM1_TISEL register  *********************/
#define TIM1_TISEL_TI1SEL_Pos      (0U)                                        
#define TIM1_TISEL_TI1SEL_Msk      (0xFU << TIM1_TISEL_TI1SEL_Pos)             /*!< 0x0000000F */
#define TIM1_TISEL_TI1SEL          TIM1_TISEL_TI1SEL_Msk                       /*!<TI1SEL[3:0] bits (TIM1 TI1 SEL)*/
#define TIM1_TISEL_TI1SEL_0        (0x1U << TIM1_TISEL_TI1SEL_Pos)             /*!< 0x00000001 */
#define TIM1_TISEL_TI1SEL_1        (0x2U << TIM1_TISEL_TI1SEL_Pos)             /*!< 0x00000002 */
#define TIM1_TISEL_TI1SEL_2        (0x4U << TIM1_TISEL_TI1SEL_Pos)             /*!< 0x00000004 */
#define TIM1_TISEL_TI1SEL_3        (0x8U << TIM1_TISEL_TI1SEL_Pos)             /*!< 0x00000008 */

