bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define WWDG_CR_WDGA           ((uint8_t)0x80)                                 /*!<Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W             ((uint16_t)0x007F)                              /*!<W[6:0] bits (7-bit window value) */
#define WWDG_CFR_W0            ((uint16_t)0x0001)                              /*!<Bit 0 */
#define WWDG_CFR_W1            ((uint16_t)0x0002)                              /*!<Bit 1 */
#define WWDG_CFR_W2            ((uint16_t)0x0004)                              /*!<Bit 2 */
#define WWDG_CFR_W3            ((uint16_t)0x0008)                              /*!<Bit 3 */
#define WWDG_CFR_W4            ((uint16_t)0x0010)                              /*!<Bit 4 */
#define WWDG_CFR_W5            ((uint16_t)0x0020)                              /*!<Bit 5 */
#define WWDG_CFR_W6            ((uint16_t)0x0040)                              /*!<Bit 6 */

#define WWDG_CFR_EWI           ((uint16_t)0x0200)                              /*!<Early Wakeup Interrupt */

#define WWDG_CFR_WDGTB         ((uint16_t)0x3800)                              /*!<WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFR_WDGTB0        ((uint16_t)0x0800)                              /*!<Bit 0 */
#define WWDG_CFR_WDGTB1        ((uint16_t)0x1000)                              /*!<Bit 1 */
#define WWDG_CFR_WDGTB2        ((uint16_t)0x2000)                              

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF           ((uint8_t)0x01)                                 /*!<Early Wakeup Interrupt Flag */


/******************************************************************************/
/*                                                                            */
/*                                DBG                                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DBGMCU_IDCODE register  *************/
#define DBGMCU_IDCODE_DEV_ID_Pos          (0U)                                 
#define DBGMCU_IDCODE_DEV_ID_Msk          (0xFFFU << DBGMCU_IDCODE_DEV_ID_Pos) /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID              DBGMCU_IDCODE_DEV_ID_Msk             
#define DBGMCU_IDCODE_REV_ID_Pos          (16U)                                
#define DBGMCU_IDCODE_REV_ID_Msk          (0xFFFFU << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID              DBGMCU_IDCODE_REV_ID_Msk             

/********************  Bit definition for DBGMCU_CR register  *****************/
#define DBGMCU_CR_DBG_SLEEPD1_Pos         (0U)                                 
#define DBGMCU_CR_DBG_SLEEPD1_Msk         (0x1U << DBGMCU_CR_DBG_SLEEPD1_Pos)  /*!< 0x00000001 */
#define DBGMCU_CR_DBG_SLEEPD1             DBGMCU_CR_DBG_SLEEPD1_Msk            
#define DBGMCU_CR_DBG_STOPD1_Pos          (1U)                                 
#define DBGMCU_CR_DBG_STOPD1_Msk          (0x1U << DBGMCU_CR_DBG_STOPD1_Pos)   /*!< 0x00000002 */
#define DBGMCU_CR_DBG_STOPD1              DBGMCU_CR_DBG_STOPD1_Msk             
#define DBGMCU_CR_DBG_STANDBYD1_Pos       (2U)                                 
#define DBGMCU_CR_DBG_STANDBYD1_Msk       (0x1U << DBGMCU_CR_DBG_STANDBYD1_Pos) /*!< 0x00000004 */
#define DBGMCU_CR_DBG_STANDBYD1           DBGMCU_CR_DBG_STANDBYD1_Msk          
#define DBGMCU_CR_DBG_STOPD3_Pos          (7U)                                 
#define DBGMCU_CR_DBG_STOPD3_Msk          (0x1U << DBGMCU_CR_DBG_STOPD3_Pos)   /*!< 0x00000080 */
#define DBGMCU_CR_DBG_STOPD3              DBGMCU_CR_DBG_STOPD3_Msk             
#define DBGMCU_CR_DBG_STANDBYD3_Pos       (8U)                                 
#define DBGMCU_CR_DBG_STANDBYD3_Msk       (0x1U << DBGMCU_CR_DBG_STANDBYD3_Pos) /*!< 0x00000100 */
#define DBGMCU_CR_DBG_STANDBYD3           DBGMCU_CR_DBG_STANDBYD3_Msk          
#define DBGMCU_CR_DBG_TRACECKEN_Pos       (20U)                                
#define DBGMCU_CR_DBG_TRACECKEN_Msk       (0x1U << DBGMCU_CR_DBG_TRACECKEN_Pos) /*!< 0x00100000 */
#define DBGMCU_CR_DBG_TRACECKEN           DBGMCU_CR_DBG_TRACECKEN_Msk          
#define DBGMCU_CR_DBG_CKD1EN_Pos          (21U)                                
#define DBGMCU_CR_DBG_CKD1EN_Msk          (0x1U << DBGMCU_CR_DBG_CKD1EN_Pos)   /*!< 0x00200000 */
#define DBGMCU_CR_DBG_CKD1EN              DBGMCU_CR_DBG_CKD1EN_Msk             
#define DBGMCU_CR_DBG_CKD3EN_Pos          (22U)                                
#define DBGMCU_CR_DBG_CKD3EN_Msk          (0x1U << DBGMCU_CR_DBG_CKD3EN_Pos)   /*!< 0x00400000 */
#define DBGMCU_CR_DBG_CKD3EN              DBGMCU_CR_DBG_CKD3EN_Msk             
#define DBGMCU_CR_DBG_TRGOEN_Pos          (28U)                                
#define DBGMCU_CR_DBG_TRGOEN_Msk          (0x1U << DBGMCU_CR_DBG_TRGOEN_Pos)   /*!< 0x10000000 */
#define DBGMCU_CR_DBG_TRGOEN              DBGMCU_CR_DBG_TRGOEN_Msk             

/********************  Bit definition for APB3FZ1 register  ************/
#define DBGMCU_APB3FZ1_DBG_WWDG1_Pos      (6U)                                 
#define DBGMCU_APB3FZ1_DBG_WWDG1_Msk      (0x1U << DBGMCU_APB3FZ1_DBG_WWDG1_Pos) /*!< 0x00000040 */
#define DBGMCU_APB3FZ1_DBG_WWDG1          DBGMCU_APB3FZ1_DBG_WWDG1_Msk         
/********************  Bit definition for APB1LFZ1 register  ************/
#define DBGMCU_APB1LFZ1_DBG_TIM2_Pos      (0U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM2_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_TIM2_Pos) /*!< 0x00000001 */
#define DBGMCU_APB1LFZ1_DBG_TIM2          DBGMCU_APB1LFZ1_DBG_TIM2_Msk         
#define DBGMCU_APB1LFZ1_DBG_TIM3_Pos      (1U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM3_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_TIM3_Pos) /*!< 0x00000002 */
#define DBGMCU_APB1LFZ1_DBG_TIM3          DBGMCU_APB1LFZ1_DBG_TIM3_Msk         
#define DBGMCU_APB1LFZ1_DBG_TIM4_Pos      (2U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM4_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_TIM4_Pos) /*!< 0x00000004 */
#define DBGMCU_APB1LFZ1_DBG_TIM4          DBGMCU_APB1LFZ1_DBG_TIM4_Msk         
#define DBGMCU_APB1LFZ1_DBG_TIM5_Pos      (3U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM5_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_TIM5_Pos) /*!< 0x00000008 */
#define DBGMCU_APB1LFZ1_DBG_TIM5          DBGMCU_APB1LFZ1_DBG_TIM5_Msk         
#define DBGMCU_APB1LFZ1_DBG_TIM6_Pos      (4U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM6_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_TIM6_Pos) /*!< 0x00000010 */
#define DBGMCU_APB1LFZ1_DBG_TIM6          DBGMCU_APB1LFZ1_DBG_TIM6_Msk         
#define DBGMCU_APB1LFZ1_DBG_TIM7_Pos      (5U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM7_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_TIM7_Pos) /*!< 0x00000020 */
#define DBGMCU_APB1LFZ1_DBG_TIM7          DBGMCU_APB1LFZ1_DBG_TIM7_Msk         
#define DBGMCU_APB1LFZ1_DBG_TIM12_Pos     (6U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM12_Msk     (0x1U << DBGMCU_APB1LFZ1_DBG_TIM12_Pos) /*!< 0x00000040 */
#define DBGMCU_APB1LFZ1_DBG_TIM12         DBGMCU_APB1LFZ1_DBG_TIM12_Msk        
#define DBGMCU_APB1LFZ1_DBG_TIM13_Pos     (7U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM13_Msk     (0x1U << DBGMCU_APB1LFZ1_DBG_TIM13_Pos) /*!< 0x00000080 */
#define DBGMCU_APB1LFZ1_DBG_TIM13         DBGMCU_APB1LFZ1_DBG_TIM13_Msk        
#define DBGMCU_APB1LFZ1_DBG_TIM14_Pos     (8U)                                 
#define DBGMCU_APB1LFZ1_DBG_TIM14_Msk     (0x1U << DBGMCU_APB1LFZ1_DBG_TIM14_Pos) /*!< 0x00000100 */
#define DBGMCU_APB1LFZ1_DBG_TIM14         DBGMCU_APB1LFZ1_DBG_TIM14_Msk        
#define DBGMCU_APB1LFZ1_DBG_LPTIM1_Pos    (9U)                                 
#define DBGMCU_APB1LFZ1_DBG_LPTIM1_Msk    (0x1U << DBGMCU_APB1LFZ1_DBG_LPTIM1_Pos) /*!< 0x00000200 */
#define DBGMCU_APB1LFZ1_DBG_LPTIM1        DBGMCU_APB1LFZ1_DBG_LPTIM1_Msk       


