bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define DBGMCU_APB1LFZ1_DBG_I2C1_Pos      (21U)                                
#define DBGMCU_APB1LFZ1_DBG_I2C1_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_I2C1_Pos) /*!< 0x00200000 */
#define DBGMCU_APB1LFZ1_DBG_I2C1          DBGMCU_APB1LFZ1_DBG_I2C1_Msk         
#define DBGMCU_APB1LFZ1_DBG_I2C2_Pos      (22U)                                
#define DBGMCU_APB1LFZ1_DBG_I2C2_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_I2C2_Pos) /*!< 0x00400000 */
#define DBGMCU_APB1LFZ1_DBG_I2C2          DBGMCU_APB1LFZ1_DBG_I2C2_Msk         
#define DBGMCU_APB1LFZ1_DBG_I2C3_Pos      (23U)                                
#define DBGMCU_APB1LFZ1_DBG_I2C3_Msk      (0x1U << DBGMCU_APB1LFZ1_DBG_I2C3_Pos) /*!< 0x00800000 */
#define DBGMCU_APB1LFZ1_DBG_I2C3          DBGMCU_APB1LFZ1_DBG_I2C3_Msk         

/********************  Bit definition for APB1HFZ1 register  ************/
#define DBGMCU_APB1HFZ1_DBG_FDCAN_Pos     (8U)                                 
#define DBGMCU_APB1HFZ1_DBG_FDCAN_Msk     (0x1U << DBGMCU_APB1HFZ1_DBG_FDCAN_Pos) /*!< 0x00000100 */
#define DBGMCU_APB1HFZ1_DBG_FDCAN         DBGMCU_APB1HFZ1_DBG_FDCAN_Msk        

/********************  Bit definition for APB2FZ1 register  ************/
#define DBGMCU_APB2FZ1_DBG_TIM1_Pos       (0U)                                 
#define DBGMCU_APB2FZ1_DBG_TIM1_Msk       (0x1U << DBGMCU_APB2FZ1_DBG_TIM1_Pos) /*!< 0x00000001 */
#define DBGMCU_APB2FZ1_DBG_TIM1           DBGMCU_APB2FZ1_DBG_TIM1_Msk          
#define DBGMCU_APB2FZ1_DBG_TIM8_Pos       (1U)                                 
#define DBGMCU_APB2FZ1_DBG_TIM8_Msk       (0x1U << DBGMCU_APB2FZ1_DBG_TIM8_Pos) /*!< 0x00000002 */
#define DBGMCU_APB2FZ1_DBG_TIM8           DBGMCU_APB2FZ1_DBG_TIM8_Msk          
#define DBGMCU_APB2FZ1_DBG_TIM15_Pos      (16U)                                
#define DBGMCU_APB2FZ1_DBG_TIM15_Msk      (0x1U << DBGMCU_APB2FZ1_DBG_TIM15_Pos) /*!< 0x00010000 */
#define DBGMCU_APB2FZ1_DBG_TIM15          DBGMCU_APB2FZ1_DBG_TIM15_Msk         
#define DBGMCU_APB2FZ1_DBG_TIM16_Pos      (17U)                                
#define DBGMCU_APB2FZ1_DBG_TIM16_Msk      (0x1U << DBGMCU_APB2FZ1_DBG_TIM16_Pos) /*!< 0x00020000 */
#define DBGMCU_APB2FZ1_DBG_TIM16          DBGMCU_APB2FZ1_DBG_TIM16_Msk         
#define DBGMCU_APB2FZ1_DBG_TIM17_Pos      (18U)                                
#define DBGMCU_APB2FZ1_DBG_TIM17_Msk      (0x1U << DBGMCU_APB2FZ1_DBG_TIM17_Pos) /*!< 0x00040000 */
#define DBGMCU_APB2FZ1_DBG_TIM17          DBGMCU_APB2FZ1_DBG_TIM17_Msk         
#define DBGMCU_APB2FZ1_DBG_HRTIM_Pos      (29U)                                
#define DBGMCU_APB2FZ1_DBG_HRTIM_Msk      (0x1U << DBGMCU_APB2FZ1_DBG_HRTIM_Pos) /*!< 0x20000000 */
#define DBGMCU_APB2FZ1_DBG_HRTIM          DBGMCU_APB2FZ1_DBG_HRTIM_Msk         

/********************  Bit definition for APB4FZ1 register  ************/
#define DBGMCU_APB4FZ1_DBG_I2C4_Pos       (7U)                                 
#define DBGMCU_APB4FZ1_DBG_I2C4_Msk       (0x1U << DBGMCU_APB4FZ1_DBG_I2C4_Pos) /*!< 0x00000080 */
#define DBGMCU_APB4FZ1_DBG_I2C4           DBGMCU_APB4FZ1_DBG_I2C4_Msk          
#define DBGMCU_APB4FZ1_DBG_LPTIM2_Pos     (9U)                                 
#define DBGMCU_APB4FZ1_DBG_LPTIM2_Msk     (0x1U << DBGMCU_APB4FZ1_DBG_LPTIM2_Pos) /*!< 0x00000200 */
#define DBGMCU_APB4FZ1_DBG_LPTIM2         DBGMCU_APB4FZ1_DBG_LPTIM2_Msk        
#define DBGMCU_APB4FZ1_DBG_LPTIM3_Pos     (10U)                                
#define DBGMCU_APB4FZ1_DBG_LPTIM3_Msk     (0x1U << DBGMCU_APB4FZ1_DBG_LPTIM3_Pos) /*!< 0x00000400 */
#define DBGMCU_APB4FZ1_DBG_LPTIM3         DBGMCU_APB4FZ1_DBG_LPTIM3_Msk        
#define DBGMCU_APB4FZ1_DBG_LPTIM4_Pos     (11U)                                
#define DBGMCU_APB4FZ1_DBG_LPTIM4_Msk     (0x1U << DBGMCU_APB4FZ1_DBG_LPTIM4_Pos) /*!< 0x00000800 */
#define DBGMCU_APB4FZ1_DBG_LPTIM4         DBGMCU_APB4FZ1_DBG_LPTIM4_Msk        
#define DBGMCU_APB4FZ1_DBG_LPTIM5_Pos     (12U)                                
#define DBGMCU_APB4FZ1_DBG_LPTIM5_Msk     (0x1U << DBGMCU_APB4FZ1_DBG_LPTIM5_Pos) /*!< 0x00001000 */
#define DBGMCU_APB4FZ1_DBG_LPTIM5         DBGMCU_APB4FZ1_DBG_LPTIM5_Msk        
#define DBGMCU_APB4FZ1_DBG_RTC_Pos        (16U)                                
#define DBGMCU_APB4FZ1_DBG_RTC_Msk        (0x1U << DBGMCU_APB4FZ1_DBG_RTC_Pos) /*!< 0x00010000 */
#define DBGMCU_APB4FZ1_DBG_RTC            DBGMCU_APB4FZ1_DBG_RTC_Msk           
#define DBGMCU_APB4FZ1_DBG_IWDG1_Pos      (18U)                                
#define DBGMCU_APB4FZ1_DBG_IWDG1_Msk      (0x1U << DBGMCU_APB4FZ1_DBG_IWDG1_Pos) /*!< 0x00040000 */
#define DBGMCU_APB4FZ1_DBG_IWDG1          DBGMCU_APB4FZ1_DBG_IWDG1_Msk         


/******************************************************************************/
/*                                                                            */
/*                        High Resolution Timer (HRTIM)                       */
/*                                                                            */
/******************************************************************************/
/******************** Master Timer control register ***************************/
#define HRTIM_MCR_CK_PSC_Pos          (0U)                                     
#define HRTIM_MCR_CK_PSC_Msk          (0x7U << HRTIM_MCR_CK_PSC_Pos)           /*!< 0x00000007 */
#define HRTIM_MCR_CK_PSC              HRTIM_MCR_CK_PSC_Msk                     /*!< Prescaler mask */
#define HRTIM_MCR_CK_PSC_0            (0x1U << HRTIM_MCR_CK_PSC_Pos)           /*!< 0x00000001 */
#define HRTIM_MCR_CK_PSC_1            (0x2U << HRTIM_MCR_CK_PSC_Pos)           /*!< 0x00000002 */
#define HRTIM_MCR_CK_PSC_2            (0x4U << HRTIM_MCR_CK_PSC_Pos)           /*!< 0x00000004 */

#define HRTIM_MCR_CONT_Pos            (3U)                                     
#define HRTIM_MCR_CONT_Msk            (0x1U << HRTIM_MCR_CONT_Pos)             /*!< 0x00000008 */
#define HRTIM_MCR_CONT                HRTIM_MCR_CONT_Msk                       /*!< Continuous mode */
#define HRTIM_MCR_RETRIG_Pos          (4U)                                     
#define HRTIM_MCR_RETRIG_Msk          (0x1U << HRTIM_MCR_RETRIG_Pos)           /*!< 0x00000010 */
#define HRTIM_MCR_RETRIG              HRTIM_MCR_RETRIG_Msk                     /*!< Rettrigreable mode */
#define HRTIM_MCR_HALF_Pos            (5U)                                     
#define HRTIM_MCR_HALF_Msk            (0x1U << HRTIM_MCR_HALF_Pos)             /*!< 0x00000020 */
#define HRTIM_MCR_HALF                HRTIM_MCR_HALF_Msk                       /*!< Half mode */

