bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define HRTIM_RST1R_MSTPER_Pos        (7U)                                     
#define HRTIM_RST1R_MSTPER_Msk        (0x1U << HRTIM_RST1R_MSTPER_Pos)         /*!< 0x00000080 */
#define HRTIM_RST1R_MSTPER            HRTIM_RST1R_MSTPER_Msk                   /*!< Master period */
#define HRTIM_RST1R_MSTCMP1_Pos       (8U)                                     
#define HRTIM_RST1R_MSTCMP1_Msk       (0x1U << HRTIM_RST1R_MSTCMP1_Pos)        /*!< 0x00000100 */
#define HRTIM_RST1R_MSTCMP1           HRTIM_RST1R_MSTCMP1_Msk                  /*!< Master compare 1 */
#define HRTIM_RST1R_MSTCMP2_Pos       (9U)                                     
#define HRTIM_RST1R_MSTCMP2_Msk       (0x1U << HRTIM_RST1R_MSTCMP2_Pos)        /*!< 0x00000200 */
#define HRTIM_RST1R_MSTCMP2           HRTIM_RST1R_MSTCMP2_Msk                  /*!< Master compare 2 */
#define HRTIM_RST1R_MSTCMP3_Pos       (10U)                                    
#define HRTIM_RST1R_MSTCMP3_Msk       (0x1U << HRTIM_RST1R_MSTCMP3_Pos)        /*!< 0x00000400 */
#define HRTIM_RST1R_MSTCMP3           HRTIM_RST1R_MSTCMP3_Msk                  /*!< Master compare 3 */
#define HRTIM_RST1R_MSTCMP4_Pos       (11U)                                    
#define HRTIM_RST1R_MSTCMP4_Msk       (0x1U << HRTIM_RST1R_MSTCMP4_Pos)        /*!< 0x00000800 */
#define HRTIM_RST1R_MSTCMP4           HRTIM_RST1R_MSTCMP4_Msk                  /*!< Master compare 4 */

#define HRTIM_RST1R_TIMEVNT1_Pos      (12U)                                    
#define HRTIM_RST1R_TIMEVNT1_Msk      (0x1U << HRTIM_RST1R_TIMEVNT1_Pos)       /*!< 0x00001000 */
#define HRTIM_RST1R_TIMEVNT1          HRTIM_RST1R_TIMEVNT1_Msk                 /*!< Timer event 1 */
#define HRTIM_RST1R_TIMEVNT2_Pos      (13U)                                    
#define HRTIM_RST1R_TIMEVNT2_Msk      (0x1U << HRTIM_RST1R_TIMEVNT2_Pos)       /*!< 0x00002000 */
#define HRTIM_RST1R_TIMEVNT2          HRTIM_RST1R_TIMEVNT2_Msk                 /*!< Timer event 2 */
#define HRTIM_RST1R_TIMEVNT3_Pos      (14U)                                    
#define HRTIM_RST1R_TIMEVNT3_Msk      (0x1U << HRTIM_RST1R_TIMEVNT3_Pos)       /*!< 0x00004000 */
#define HRTIM_RST1R_TIMEVNT3          HRTIM_RST1R_TIMEVNT3_Msk                 /*!< Timer event 3 */
#define HRTIM_RST1R_TIMEVNT4_Pos      (15U)                                    
#define HRTIM_RST1R_TIMEVNT4_Msk      (0x1U << HRTIM_RST1R_TIMEVNT4_Pos)       /*!< 0x00008000 */
#define HRTIM_RST1R_TIMEVNT4          HRTIM_RST1R_TIMEVNT4_Msk                 /*!< Timer event 4 */
#define HRTIM_RST1R_TIMEVNT5_Pos      (16U)                                    
#define HRTIM_RST1R_TIMEVNT5_Msk      (0x1U << HRTIM_RST1R_TIMEVNT5_Pos)       /*!< 0x00010000 */
#define HRTIM_RST1R_TIMEVNT5          HRTIM_RST1R_TIMEVNT5_Msk                 /*!< Timer event 5 */
#define HRTIM_RST1R_TIMEVNT6_Pos      (17U)                                    
#define HRTIM_RST1R_TIMEVNT6_Msk      (0x1U << HRTIM_RST1R_TIMEVNT6_Pos)       /*!< 0x00020000 */
#define HRTIM_RST1R_TIMEVNT6          HRTIM_RST1R_TIMEVNT6_Msk                 /*!< Timer event 6 */
#define HRTIM_RST1R_TIMEVNT7_Pos      (18U)                                    
#define HRTIM_RST1R_TIMEVNT7_Msk      (0x1U << HRTIM_RST1R_TIMEVNT7_Pos)       /*!< 0x00040000 */
#define HRTIM_RST1R_TIMEVNT7          HRTIM_RST1R_TIMEVNT7_Msk                 /*!< Timer event 7 */
#define HRTIM_RST1R_TIMEVNT8_Pos      (19U)                                    
#define HRTIM_RST1R_TIMEVNT8_Msk      (0x1U << HRTIM_RST1R_TIMEVNT8_Pos)       /*!< 0x00080000 */
#define HRTIM_RST1R_TIMEVNT8          HRTIM_RST1R_TIMEVNT8_Msk                 /*!< Timer event 8 */
#define HRTIM_RST1R_TIMEVNT9_Pos      (20U)                                    
#define HRTIM_RST1R_TIMEVNT9_Msk      (0x1U << HRTIM_RST1R_TIMEVNT9_Pos)       /*!< 0x00100000 */
#define HRTIM_RST1R_TIMEVNT9          HRTIM_RST1R_TIMEVNT9_Msk                 /*!< Timer event 9 */

#define HRTIM_RST1R_EXTVNT1_Pos       (21U)                                    
#define HRTIM_RST1R_EXTVNT1_Msk       (0x1U << HRTIM_RST1R_EXTVNT1_Pos)        /*!< 0x00200000 */
#define HRTIM_RST1R_EXTVNT1           HRTIM_RST1R_EXTVNT1_Msk                  /*!< External event 1 */
#define HRTIM_RST1R_EXTVNT2_Pos       (22U)                                    
#define HRTIM_RST1R_EXTVNT2_Msk       (0x1U << HRTIM_RST1R_EXTVNT2_Pos)        /*!< 0x00400000 */
#define HRTIM_RST1R_EXTVNT2           HRTIM_RST1R_EXTVNT2_Msk                  /*!< External event 2 */
#define HRTIM_RST1R_EXTVNT3_Pos       (23U)                                    
#define HRTIM_RST1R_EXTVNT3_Msk       (0x1U << HRTIM_RST1R_EXTVNT3_Pos)        /*!< 0x00800000 */
#define HRTIM_RST1R_EXTVNT3           HRTIM_RST1R_EXTVNT3_Msk                  /*!< External event 3 */
#define HRTIM_RST1R_EXTVNT4_Pos       (24U)                                    
#define HRTIM_RST1R_EXTVNT4_Msk       (0x1U << HRTIM_RST1R_EXTVNT4_Pos)        /*!< 0x01000000 */
#define HRTIM_RST1R_EXTVNT4           HRTIM_RST1R_EXTVNT4_Msk                  /*!< External event 4 */
#define HRTIM_RST1R_EXTVNT5_Pos       (25U)                                    
#define HRTIM_RST1R_EXTVNT5_Msk       (0x1U << HRTIM_RST1R_EXTVNT5_Pos)        /*!< 0x02000000 */
#define HRTIM_RST1R_EXTVNT5           HRTIM_RST1R_EXTVNT5_Msk                  /*!< External event 5 */
#define HRTIM_RST1R_EXTVNT6_Pos       (26U)                                    
#define HRTIM_RST1R_EXTVNT6_Msk       (0x1U << HRTIM_RST1R_EXTVNT6_Pos)        /*!< 0x04000000 */
#define HRTIM_RST1R_EXTVNT6           HRTIM_RST1R_EXTVNT6_Msk                  /*!< External event 6 */
#define HRTIM_RST1R_EXTVNT7_Pos       (27U)                                    
#define HRTIM_RST1R_EXTVNT7_Msk       (0x1U << HRTIM_RST1R_EXTVNT7_Pos)        /*!< 0x08000000 */
#define HRTIM_RST1R_EXTVNT7           HRTIM_RST1R_EXTVNT7_Msk                  /*!< External event 7 */
#define HRTIM_RST1R_EXTVNT8_Pos       (28U)                                    
#define HRTIM_RST1R_EXTVNT8_Msk       (0x1U << HRTIM_RST1R_EXTVNT8_Pos)        /*!< 0x10000000 */
#define HRTIM_RST1R_EXTVNT8           HRTIM_RST1R_EXTVNT8_Msk                  /*!< External event 8 */
#define HRTIM_RST1R_EXTVNT9_Pos       (29U)                                    
#define HRTIM_RST1R_EXTVNT9_Msk       (0x1U << HRTIM_RST1R_EXTVNT9_Pos)        /*!< 0x20000000 */
#define HRTIM_RST1R_EXTVNT9           HRTIM_RST1R_EXTVNT9_Msk                  /*!< External event 9 */
#define HRTIM_RST1R_EXTVNT10_Pos      (30U)                                    
#define HRTIM_RST1R_EXTVNT10_Msk      (0x1U << HRTIM_RST1R_EXTVNT10_Pos)       /*!< 0x40000000 */
#define HRTIM_RST1R_EXTVNT10          HRTIM_RST1R_EXTVNT10_Msk                 /*!< External event 10 */

#define HRTIM_RST1R_UPDATE_Pos        (31U)                                    
#define HRTIM_RST1R_UPDATE_Msk        (0x1U << HRTIM_RST1R_UPDATE_Pos)         /*!< 0x80000000 */
#define HRTIM_RST1R_UPDATE            HRTIM_RST1R_UPDATE_Msk                   /*!< Register update (transfer preload to active) */


/**** Bit definition for Slave Output 2 set register **************************/
#define HRTIM_SET2R_SST_Pos           (0U)                                     
#define HRTIM_SET2R_SST_Msk           (0x1U << HRTIM_SET2R_SST_Pos)            /*!< 0x00000001 */
#define HRTIM_SET2R_SST               HRTIM_SET2R_SST_Msk                      /*!< software set trigger */
#define HRTIM_SET2R_RESYNC_Pos        (1U)                                     
#define HRTIM_SET2R_RESYNC_Msk        (0x1U << HRTIM_SET2R_RESYNC_Pos)         /*!< 0x00000002 */
#define HRTIM_SET2R_RESYNC            HRTIM_SET2R_RESYNC_Msk                   /*!< Timer A resynchronization */
#define HRTIM_SET2R_PER_Pos           (2U)                                     
#define HRTIM_SET2R_PER_Msk           (0x1U << HRTIM_SET2R_PER_Pos)            /*!< 0x00000004 */
#define HRTIM_SET2R_PER               HRTIM_SET2R_PER_Msk                      /*!< Timer A period */
#define HRTIM_SET2R_CMP1_Pos          (3U)                                     
#define HRTIM_SET2R_CMP1_Msk          (0x1U << HRTIM_SET2R_CMP1_Pos)           /*!< 0x00000008 */
#define HRTIM_SET2R_CMP1              HRTIM_SET2R_CMP1_Msk                     /*!< Timer A compare 1 */
#define HRTIM_SET2R_CMP2_Pos          (4U)                                     
#define HRTIM_SET2R_CMP2_Msk          (0x1U << HRTIM_SET2R_CMP2_Pos)           /*!< 0x00000010 */
#define HRTIM_SET2R_CMP2              HRTIM_SET2R_CMP2_Msk                     /*!< Timer A compare 2 */
#define HRTIM_SET2R_CMP3_Pos          (5U)                                     
#define HRTIM_SET2R_CMP3_Msk          (0x1U << HRTIM_SET2R_CMP3_Pos)           /*!< 0x00000020 */
#define HRTIM_SET2R_CMP3              HRTIM_SET2R_CMP3_Msk                     /*!< Timer A compare 3 */
#define HRTIM_SET2R_CMP4_Pos          (6U)                                     
#define HRTIM_SET2R_CMP4_Msk          (0x1U << HRTIM_SET2R_CMP4_Pos)           /*!< 0x00000040 */
#define HRTIM_SET2R_CMP4              HRTIM_SET2R_CMP4_Msk                     /*!< Timer A compare 4 */

