bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
/*******************  Bit definition for HRTIM_ADC3R register  ****************/
#define HRTIM_ADC3R_AD3MC1_Pos        (0U)                                     
#define HRTIM_ADC3R_AD3MC1_Msk        (0x1U << HRTIM_ADC3R_AD3MC1_Pos)         /*!< 0x00000001 */
#define HRTIM_ADC3R_AD3MC1            HRTIM_ADC3R_AD3MC1_Msk                   /*!< ADC Trigger 3 on master compare 1 */
#define HRTIM_ADC3R_AD3MC2_Pos        (1U)                                     
#define HRTIM_ADC3R_AD3MC2_Msk        (0x1U << HRTIM_ADC3R_AD3MC2_Pos)         /*!< 0x00000002 */
#define HRTIM_ADC3R_AD3MC2            HRTIM_ADC3R_AD3MC2_Msk                   /*!< ADC Trigger 3 on master compare 2 */
#define HRTIM_ADC3R_AD3MC3_Pos        (2U)                                     
#define HRTIM_ADC3R_AD3MC3_Msk        (0x1U << HRTIM_ADC3R_AD3MC3_Pos)         /*!< 0x00000004 */
#define HRTIM_ADC3R_AD3MC3            HRTIM_ADC3R_AD3MC3_Msk                   /*!< ADC Trigger 3 on master compare 3 */
#define HRTIM_ADC3R_AD3MC4_Pos        (3U)                                     
#define HRTIM_ADC3R_AD3MC4_Msk        (0x1U << HRTIM_ADC3R_AD3MC4_Pos)         /*!< 0x00000008 */
#define HRTIM_ADC3R_AD3MC4            HRTIM_ADC3R_AD3MC4_Msk                   /*!< ADC Trigger 3 on master compare 4 */
#define HRTIM_ADC3R_AD3MPER_Pos       (4U)                                     
#define HRTIM_ADC3R_AD3MPER_Msk       (0x1U << HRTIM_ADC3R_AD3MPER_Pos)        /*!< 0x00000010 */
#define HRTIM_ADC3R_AD3MPER           HRTIM_ADC3R_AD3MPER_Msk                  /*!< ADC Trigger 3 on master period */
#define HRTIM_ADC3R_AD3EEV1_Pos       (5U)                                     
#define HRTIM_ADC3R_AD3EEV1_Msk       (0x1U << HRTIM_ADC3R_AD3EEV1_Pos)        /*!< 0x00000020 */
#define HRTIM_ADC3R_AD3EEV1           HRTIM_ADC3R_AD3EEV1_Msk                  /*!< ADC Trigger 3 on external event 1 */
#define HRTIM_ADC3R_AD3EEV2_Pos       (6U)                                     
#define HRTIM_ADC3R_AD3EEV2_Msk       (0x1U << HRTIM_ADC3R_AD3EEV2_Pos)        /*!< 0x00000040 */
#define HRTIM_ADC3R_AD3EEV2           HRTIM_ADC3R_AD3EEV2_Msk                  /*!< ADC Trigger 3 on external event 2 */
#define HRTIM_ADC3R_AD3EEV3_Pos       (7U)                                     
#define HRTIM_ADC3R_AD3EEV3_Msk       (0x1U << HRTIM_ADC3R_AD3EEV3_Pos)        /*!< 0x00000080 */
#define HRTIM_ADC3R_AD3EEV3           HRTIM_ADC3R_AD3EEV3_Msk                  /*!< ADC Trigger 3 on external event 3 */
#define HRTIM_ADC3R_AD3EEV4_Pos       (8U)                                     
#define HRTIM_ADC3R_AD3EEV4_Msk       (0x1U << HRTIM_ADC3R_AD3EEV4_Pos)        /*!< 0x00000100 */
#define HRTIM_ADC3R_AD3EEV4           HRTIM_ADC3R_AD3EEV4_Msk                  /*!< ADC Trigger 3 on external event 4 */
#define HRTIM_ADC3R_AD3EEV5_Pos       (9U)                                     
#define HRTIM_ADC3R_AD3EEV5_Msk       (0x1U << HRTIM_ADC3R_AD3EEV5_Pos)        /*!< 0x00000200 */
#define HRTIM_ADC3R_AD3EEV5           HRTIM_ADC3R_AD3EEV5_Msk                  /*!< ADC Trigger 3 on external event 5 */
#define HRTIM_ADC3R_AD3TAC2_Pos       (10U)                                    
#define HRTIM_ADC3R_AD3TAC2_Msk       (0x1U << HRTIM_ADC3R_AD3TAC2_Pos)        /*!< 0x00000400 */
#define HRTIM_ADC3R_AD3TAC2           HRTIM_ADC3R_AD3TAC2_Msk                  /*!< ADC Trigger 3 on Timer A compare 2 */
#define HRTIM_ADC3R_AD3TAC3_Pos       (11U)                                    
#define HRTIM_ADC3R_AD3TAC3_Msk       (0x1U << HRTIM_ADC3R_AD3TAC3_Pos)        /*!< 0x00000800 */
#define HRTIM_ADC3R_AD3TAC3           HRTIM_ADC3R_AD3TAC3_Msk                  /*!< ADC Trigger 3 on Timer A compare 3 */
#define HRTIM_ADC3R_AD3TAC4_Pos       (12U)                                    
#define HRTIM_ADC3R_AD3TAC4_Msk       (0x1U << HRTIM_ADC3R_AD3TAC4_Pos)        /*!< 0x00001000 */
#define HRTIM_ADC3R_AD3TAC4           HRTIM_ADC3R_AD3TAC4_Msk                  /*!< ADC Trigger 3 on Timer A compare 4 */
#define HRTIM_ADC3R_AD3TAPER_Pos      (13U)                                    
#define HRTIM_ADC3R_AD3TAPER_Msk      (0x1U << HRTIM_ADC3R_AD3TAPER_Pos)       /*!< 0x00002000 */
#define HRTIM_ADC3R_AD3TAPER          HRTIM_ADC3R_AD3TAPER_Msk                 /*!< ADC Trigger 3 on Timer A period */
#define HRTIM_ADC3R_AD3TARST_Pos      (14U)                                    
#define HRTIM_ADC3R_AD3TARST_Msk      (0x1U << HRTIM_ADC3R_AD3TARST_Pos)       /*!< 0x00004000 */
#define HRTIM_ADC3R_AD3TARST          HRTIM_ADC3R_AD3TARST_Msk                 /*!< ADC Trigger 3 on Timer A reset */
#define HRTIM_ADC3R_AD3TBC2_Pos       (15U)                                    
#define HRTIM_ADC3R_AD3TBC2_Msk       (0x1U << HRTIM_ADC3R_AD3TBC2_Pos)        /*!< 0x00008000 */
#define HRTIM_ADC3R_AD3TBC2           HRTIM_ADC3R_AD3TBC2_Msk                  /*!< ADC Trigger 3 on Timer B compare 2 */
#define HRTIM_ADC3R_AD3TBC3_Pos       (16U)                                    
#define HRTIM_ADC3R_AD3TBC3_Msk       (0x1U << HRTIM_ADC3R_AD3TBC3_Pos)        /*!< 0x00010000 */
#define HRTIM_ADC3R_AD3TBC3           HRTIM_ADC3R_AD3TBC3_Msk                  /*!< ADC Trigger 3 on Timer B compare 3 */
#define HRTIM_ADC3R_AD3TBC4_Pos       (17U)                                    
#define HRTIM_ADC3R_AD3TBC4_Msk       (0x1U << HRTIM_ADC3R_AD3TBC4_Pos)        /*!< 0x00020000 */
#define HRTIM_ADC3R_AD3TBC4           HRTIM_ADC3R_AD3TBC4_Msk                  /*!< ADC Trigger 3 on Timer B compare 4 */
#define HRTIM_ADC3R_AD3TBPER_Pos      (18U)                                    
#define HRTIM_ADC3R_AD3TBPER_Msk      (0x1U << HRTIM_ADC3R_AD3TBPER_Pos)       /*!< 0x00040000 */
#define HRTIM_ADC3R_AD3TBPER          HRTIM_ADC3R_AD3TBPER_Msk                 /*!< ADC Trigger 3 on Timer B period */
#define HRTIM_ADC3R_AD3TBRST_Pos      (19U)                                    
#define HRTIM_ADC3R_AD3TBRST_Msk      (0x1U << HRTIM_ADC3R_AD3TBRST_Pos)       /*!< 0x00080000 */
#define HRTIM_ADC3R_AD3TBRST          HRTIM_ADC3R_AD3TBRST_Msk                 /*!< ADC Trigger 3 on Timer B reset */
#define HRTIM_ADC3R_AD3TCC2_Pos       (20U)                                    
#define HRTIM_ADC3R_AD3TCC2_Msk       (0x1U << HRTIM_ADC3R_AD3TCC2_Pos)        /*!< 0x00100000 */
#define HRTIM_ADC3R_AD3TCC2           HRTIM_ADC3R_AD3TCC2_Msk                  /*!< ADC Trigger 3 on Timer C compare 2 */
#define HRTIM_ADC3R_AD3TCC3_Pos       (21U)                                    
#define HRTIM_ADC3R_AD3TCC3_Msk       (0x1U << HRTIM_ADC3R_AD3TCC3_Pos)        /*!< 0x00200000 */
#define HRTIM_ADC3R_AD3TCC3           HRTIM_ADC3R_AD3TCC3_Msk                  /*!< ADC Trigger 3 on Timer C compare 3 */
#define HRTIM_ADC3R_AD3TCC4_Pos       (22U)                                    
#define HRTIM_ADC3R_AD3TCC4_Msk       (0x1U << HRTIM_ADC3R_AD3TCC4_Pos)        /*!< 0x00400000 */
#define HRTIM_ADC3R_AD3TCC4           HRTIM_ADC3R_AD3TCC4_Msk                  /*!< ADC Trigger 3 on Timer C compare 4 */
#define HRTIM_ADC3R_AD3TCPER_Pos      (23U)                                    
#define HRTIM_ADC3R_AD3TCPER_Msk      (0x1U << HRTIM_ADC3R_AD3TCPER_Pos)       /*!< 0x00800000 */
#define HRTIM_ADC3R_AD3TCPER          HRTIM_ADC3R_AD3TCPER_Msk                 /*!< ADC Trigger 3 on Timer C period */
#define HRTIM_ADC3R_AD3TDC2_Pos       (24U)                                    
#define HRTIM_ADC3R_AD3TDC2_Msk       (0x1U << HRTIM_ADC3R_AD3TDC2_Pos)        /*!< 0x01000000 */
#define HRTIM_ADC3R_AD3TDC2           HRTIM_ADC3R_AD3TDC2_Msk                  /*!< ADC Trigger 3 on Timer D compare 2 */
#define HRTIM_ADC3R_AD3TDC3_Pos       (25U)                                    
#define HRTIM_ADC3R_AD3TDC3_Msk       (0x1U << HRTIM_ADC3R_AD3TDC3_Pos)        /*!< 0x02000000 */
#define HRTIM_ADC3R_AD3TDC3           HRTIM_ADC3R_AD3TDC3_Msk                  /*!< ADC Trigger 3 on Timer D compare 3 */
#define HRTIM_ADC3R_AD3TDC4_Pos       (26U)                                    
#define HRTIM_ADC3R_AD3TDC4_Msk       (0x1U << HRTIM_ADC3R_AD3TDC4_Pos)        /*!< 0x04000000 */
#define HRTIM_ADC3R_AD3TDC4           HRTIM_ADC3R_AD3TDC4_Msk                  /*!< ADC Trigger 3 on Timer D compare 4 */
#define HRTIM_ADC3R_AD3TDPER_Pos      (27U)                                    
#define HRTIM_ADC3R_AD3TDPER_Msk      (0x1U << HRTIM_ADC3R_AD3TDPER_Pos)       /*!< 0x08000000 */
#define HRTIM_ADC3R_AD3TDPER          HRTIM_ADC3R_AD3TDPER_Msk                 /*!< ADC Trigger 3 on Timer D period */
#define HRTIM_ADC3R_AD3TEC2_Pos       (28U)                                    
#define HRTIM_ADC3R_AD3TEC2_Msk       (0x1U << HRTIM_ADC3R_AD3TEC2_Pos)        /*!< 0x10000000 */
#define HRTIM_ADC3R_AD3TEC2           HRTIM_ADC3R_AD3TEC2_Msk                  /*!< ADC Trigger 3 on Timer E compare 2 */
#define HRTIM_ADC3R_AD3TEC3_Pos       (29U)                                    
#define HRTIM_ADC3R_AD3TEC3_Msk       (0x1U << HRTIM_ADC3R_AD3TEC3_Pos)        /*!< 0x20000000 */
#define HRTIM_ADC3R_AD3TEC3           HRTIM_ADC3R_AD3TEC3_Msk                  /*!< ADC Trigger 3 on Timer E compare 3 */
#define HRTIM_ADC3R_AD3TEC4_Pos       (30U)                                    
#define HRTIM_ADC3R_AD3TEC4_Msk       (0x1U << HRTIM_ADC3R_AD3TEC4_Pos)        /*!< 0x40000000 */
#define HRTIM_ADC3R_AD3TEC4           HRTIM_ADC3R_AD3TEC4_Msk                  /*!< ADC Trigger 3 on Timer E compare 4 */
#define HRTIM_ADC3R_AD3TEPER_Pos      (31U)                                    
#define HRTIM_ADC3R_AD3TEPER_Msk      (0x1U << HRTIM_ADC3R_AD3TEPER_Pos)       /*!< 0x80000000 */
#define HRTIM_ADC3R_AD3TEPER          HRTIM_ADC3R_AD3TEPER_Msk                 /*!< ADC Trigger 3 on Timer E period */

/*******************  Bit definition for HRTIM_ADC4R register  ****************/
#define HRTIM_ADC4R_AD4MC1_Pos        (0U)                                     
#define HRTIM_ADC4R_AD4MC1_Msk        (0x1U << HRTIM_ADC4R_AD4MC1_Pos)         /*!< 0x00000001 */
#define HRTIM_ADC4R_AD4MC1            HRTIM_ADC4R_AD4MC1_Msk                   /*!< ADC Trigger 4 on master compare 1 */
#define HRTIM_ADC4R_AD4MC2_Pos        (1U)                                     
#define HRTIM_ADC4R_AD4MC2_Msk        (0x1U << HRTIM_ADC4R_AD4MC2_Pos)         /*!< 0x00000002 */
#define HRTIM_ADC4R_AD4MC2            HRTIM_ADC4R_AD4MC2_Msk                   /*!< ADC Trigger 4 on master compare 2 */
#define HRTIM_ADC4R_AD4MC3_Pos        (2U)                                     
#define HRTIM_ADC4R_AD4MC3_Msk        (0x1U << HRTIM_ADC4R_AD4MC3_Pos)         /*!< 0x00000004 */
#define HRTIM_ADC4R_AD4MC3            HRTIM_ADC4R_AD4MC3_Msk                   /*!< ADC Trigger 4 on master compare 3 */
#define HRTIM_ADC4R_AD4MC4_Pos        (3U)                                     
#define HRTIM_ADC4R_AD4MC4_Msk        (0x1U << HRTIM_ADC4R_AD4MC4_Pos)         /*!< 0x00000008 */
#define HRTIM_ADC4R_AD4MC4            HRTIM_ADC4R_AD4MC4_Msk                   /*!< ADC Trigger 4 on master compare 4 */
#define HRTIM_ADC4R_AD4MPER_Pos       (4U)                                     
#define HRTIM_ADC4R_AD4MPER_Msk       (0x1U << HRTIM_ADC4R_AD4MPER_Pos)        /*!< 0x00000010 */
#define HRTIM_ADC4R_AD4MPER           HRTIM_ADC4R_AD4MPER_Msk                  /*!< ADC Trigger 4 on master period */
#define HRTIM_ADC4R_AD4EEV6_Pos       (5U)                                     
#define HRTIM_ADC4R_AD4EEV6_Msk       (0x1U << HRTIM_ADC4R_AD4EEV6_Pos)        /*!< 0x00000020 */
#define HRTIM_ADC4R_AD4EEV6           HRTIM_ADC4R_AD4EEV6_Msk                  /*!< ADC Trigger 4 on external event 6 */
#define HRTIM_ADC4R_AD4EEV7_Pos       (6U)                                     
#define HRTIM_ADC4R_AD4EEV7_Msk       (0x1U << HRTIM_ADC4R_AD4EEV7_Pos)        /*!< 0x00000040 */
#define HRTIM_ADC4R_AD4EEV7           HRTIM_ADC4R_AD4EEV7_Msk                  /*!< ADC Trigger 4 on external event 7 */
#define HRTIM_ADC4R_AD4EEV8_Pos       (7U)                                     
#define HRTIM_ADC4R_AD4EEV8_Msk       (0x1U << HRTIM_ADC4R_AD4EEV8_Pos)        /*!< 0x00000080 */
#define HRTIM_ADC4R_AD4EEV8           HRTIM_ADC4R_AD4EEV8_Msk                  /*!< ADC Trigger 4 on external event 8 */
#define HRTIM_ADC4R_AD4EEV9_Pos       (8U)                                     
#define HRTIM_ADC4R_AD4EEV9_Msk       (0x1U << HRTIM_ADC4R_AD4EEV9_Pos)        /*!< 0x00000100 */
#define HRTIM_ADC4R_AD4EEV9           HRTIM_ADC4R_AD4EEV9_Msk                  /*!< ADC Trigger 4 on external event 9 */
#define HRTIM_ADC4R_AD4EEV10_Pos      (9U)                                     
#define HRTIM_ADC4R_AD4EEV10_Msk      (0x1U << HRTIM_ADC4R_AD4EEV10_Pos)       /*!< 0x00000200 */
#define HRTIM_ADC4R_AD4EEV10          HRTIM_ADC4R_AD4EEV10_Msk                 /*!< ADC Trigger 4 on external event 10 */
#define HRTIM_ADC4R_AD4TAC2_Pos       (10U)                                    
#define HRTIM_ADC4R_AD4TAC2_Msk       (0x1U << HRTIM_ADC4R_AD4TAC2_Pos)        /*!< 0x00000400 */
#define HRTIM_ADC4R_AD4TAC2           HRTIM_ADC4R_AD4TAC2_Msk                  /*!< ADC Trigger 4 on Timer A compare 2 */
#define HRTIM_ADC4R_AD4TAC3_Pos       (11U)                                    
#define HRTIM_ADC4R_AD4TAC3_Msk       (0x1U << HRTIM_ADC4R_AD4TAC3_Pos)        /*!< 0x00000800 */
#define HRTIM_ADC4R_AD4TAC3           HRTIM_ADC4R_AD4TAC3_Msk                  /*!< ADC Trigger 4 on Timer A compare 3 */
#define HRTIM_ADC4R_AD4TAC4_Pos       (12U)                                    
#define HRTIM_ADC4R_AD4TAC4_Msk       (0x1U << HRTIM_ADC4R_AD4TAC4_Pos)        /*!< 0x00001000 */
#define HRTIM_ADC4R_AD4TAC4           HRTIM_ADC4R_AD4TAC4_Msk                  /*!< ADC Trigger 4 on Timer A compare 4*/
#define HRTIM_ADC4R_AD4TAPER_Pos      (13U)                                    
#define HRTIM_ADC4R_AD4TAPER_Msk      (0x1U << HRTIM_ADC4R_AD4TAPER_Pos)       /*!< 0x00002000 */
#define HRTIM_ADC4R_AD4TAPER          HRTIM_ADC4R_AD4TAPER_Msk                 /*!< ADC Trigger 4 on Timer A period */
#define HRTIM_ADC4R_AD4TBC2_Pos       (14U)                                    
#define HRTIM_ADC4R_AD4TBC2_Msk       (0x1U << HRTIM_ADC4R_AD4TBC2_Pos)        /*!< 0x00004000 */
#define HRTIM_ADC4R_AD4TBC2           HRTIM_ADC4R_AD4TBC2_Msk                  /*!< ADC Trigger 4 on Timer B compare 2 */
#define HRTIM_ADC4R_AD4TBC3_Pos       (15U)                                    
#define HRTIM_ADC4R_AD4TBC3_Msk       (0x1U << HRTIM_ADC4R_AD4TBC3_Pos)        /*!< 0x00008000 */
#define HRTIM_ADC4R_AD4TBC3           HRTIM_ADC4R_AD4TBC3_Msk                  /*!< ADC Trigger 4 on Timer B compare 3 */
#define HRTIM_ADC4R_AD4TBC4_Pos       (16U)                                    
#define HRTIM_ADC4R_AD4TBC4_Msk       (0x1U << HRTIM_ADC4R_AD4TBC4_Pos)        /*!< 0x00010000 */
#define HRTIM_ADC4R_AD4TBC4           HRTIM_ADC4R_AD4TBC4_Msk                  /*!< ADC Trigger 4 on Timer B compare 4 */
#define HRTIM_ADC4R_AD4TBPER_Pos      (17U)                                    
#define HRTIM_ADC4R_AD4TBPER_Msk      (0x1U << HRTIM_ADC4R_AD4TBPER_Pos)       /*!< 0x00020000 */
#define HRTIM_ADC4R_AD4TBPER          HRTIM_ADC4R_AD4TBPER_Msk                 /*!< ADC Trigger 4 on Timer B period */
#define HRTIM_ADC4R_AD4TCC2_Pos       (18U)                                    
#define HRTIM_ADC4R_AD4TCC2_Msk       (0x1U << HRTIM_ADC4R_AD4TCC2_Pos)        /*!< 0x00040000 */
#define HRTIM_ADC4R_AD4TCC2           HRTIM_ADC4R_AD4TCC2_Msk                  /*!< ADC Trigger 4 on Timer C compare 2 */
#define HRTIM_ADC4R_AD4TCC3_Pos       (19U)                                    
#define HRTIM_ADC4R_AD4TCC3_Msk       (0x1U << HRTIM_ADC4R_AD4TCC3_Pos)        /*!< 0x00080000 */
#define HRTIM_ADC4R_AD4TCC3           HRTIM_ADC4R_AD4TCC3_Msk                  /*!< ADC Trigger 4 on Timer C compare 3 */
#define HRTIM_ADC4R_AD4TCC4_Pos       (20U)                                    
#define HRTIM_ADC4R_AD4TCC4_Msk       (0x1U << HRTIM_ADC4R_AD4TCC4_Pos)        /*!< 0x00100000 */
#define HRTIM_ADC4R_AD4TCC4           HRTIM_ADC4R_AD4TCC4_Msk                  /*!< ADC Trigger 4 on Timer C compare 4 */
#define HRTIM_ADC4R_AD4TCPER_Pos      (21U)                                    
#define HRTIM_ADC4R_AD4TCPER_Msk      (0x1U << HRTIM_ADC4R_AD4TCPER_Pos)       /*!< 0x00200000 */
#define HRTIM_ADC4R_AD4TCPER          HRTIM_ADC4R_AD4TCPER_Msk                 /*!< ADC Trigger 4 on Timer C period */
#define HRTIM_ADC4R_AD4TCRST_Pos      (22U)                                    
#define HRTIM_ADC4R_AD4TCRST_Msk      (0x1U << HRTIM_ADC4R_AD4TCRST_Pos)       /*!< 0x00400000 */
#define HRTIM_ADC4R_AD4TCRST          HRTIM_ADC4R_AD4TCRST_Msk                 /*!< ADC Trigger 4 on Timer C reset */
#define HRTIM_ADC4R_AD4TDC2_Pos       (23U)                                    
#define HRTIM_ADC4R_AD4TDC2_Msk       (0x1U << HRTIM_ADC4R_AD4TDC2_Pos)        /*!< 0x00800000 */
#define HRTIM_ADC4R_AD4TDC2           HRTIM_ADC4R_AD4TDC2_Msk                  /*!< ADC Trigger 4 on Timer D compare 2 */
#define HRTIM_ADC4R_AD4TDC3_Pos       (24U)                                    
#define HRTIM_ADC4R_AD4TDC3_Msk       (0x1U << HRTIM_ADC4R_AD4TDC3_Pos)        /*!< 0x01000000 */
#define HRTIM_ADC4R_AD4TDC3           HRTIM_ADC4R_AD4TDC3_Msk                  /*!< ADC Trigger 4 on Timer D compare 3 */
#define HRTIM_ADC4R_AD4TDC4_Pos       (25U)                                    
#define HRTIM_ADC4R_AD4TDC4_Msk       (0x1U << HRTIM_ADC4R_AD4TDC4_Pos)        /*!< 0x02000000 */
#define HRTIM_ADC4R_AD4TDC4           HRTIM_ADC4R_AD4TDC4_Msk                  /*!< ADC Trigger 4 on Timer D compare 4*/
#define HRTIM_ADC4R_AD4TDPER_Pos      (26U)                                    
#define HRTIM_ADC4R_AD4TDPER_Msk      (0x1U << HRTIM_ADC4R_AD4TDPER_Pos)       /*!< 0x04000000 */
#define HRTIM_ADC4R_AD4TDPER          HRTIM_ADC4R_AD4TDPER_Msk                 /*!< ADC Trigger 4 on Timer D period */
#define HRTIM_ADC4R_AD4TDRST_Pos      (27U)                                    
#define HRTIM_ADC4R_AD4TDRST_Msk      (0x1U << HRTIM_ADC4R_AD4TDRST_Pos)       /*!< 0x08000000 */
#define HRTIM_ADC4R_AD4TDRST          HRTIM_ADC4R_AD4TDRST_Msk                 /*!< ADC Trigger 4 on Timer D reset */
#define HRTIM_ADC4R_AD4TEC2_Pos       (28U)                                    
#define HRTIM_ADC4R_AD4TEC2_Msk       (0x1U << HRTIM_ADC4R_AD4TEC2_Pos)        /*!< 0x10000000 */
#define HRTIM_ADC4R_AD4TEC2           HRTIM_ADC4R_AD4TEC2_Msk                  /*!< ADC Trigger 4 on Timer E compare 2 */
#define HRTIM_ADC4R_AD4TEC3_Pos       (29U)                                    
#define HRTIM_ADC4R_AD4TEC3_Msk       (0x1U << HRTIM_ADC4R_AD4TEC3_Pos)        /*!< 0x20000000 */
#define HRTIM_ADC4R_AD4TEC3           HRTIM_ADC4R_AD4TEC3_Msk                  /*!< ADC Trigger 4 on Timer E compare 3 */
#define HRTIM_ADC4R_AD4TEC4_Pos       (30U)                                    
#define HRTIM_ADC4R_AD4TEC4_Msk       (0x1U << HRTIM_ADC4R_AD4TEC4_Pos)        /*!< 0x40000000 */
#define HRTIM_ADC4R_AD4TEC4           HRTIM_ADC4R_AD4TEC4_Msk                  /*!< ADC Trigger 4 on Timer E compare 4 */
#define HRTIM_ADC4R_AD4TERST_Pos      (31U)                                    
#define HRTIM_ADC4R_AD4TERST_Msk      (0x1U << HRTIM_ADC4R_AD4TERST_Pos)       /*!< 0x80000000 */
#define HRTIM_ADC4R_AD4TERST          HRTIM_ADC4R_AD4TERST_Msk                 /*!< ADC Trigger 4 on Timer E reset */

/*******************  Bit definition for HRTIM_FLTINR1 register  ***************/  
#define HRTIM_FLTINR1_FLT1E_Pos       (0U)                                     
#define HRTIM_FLTINR1_FLT1E_Msk       (0x1U << HRTIM_FLTINR1_FLT1E_Pos)        /*!< 0x00000001 */
#define HRTIM_FLTINR1_FLT1E           HRTIM_FLTINR1_FLT1E_Msk                  /*!< Fault 1 enable */ 
#define HRTIM_FLTINR1_FLT1P_Pos       (1U)                                     
#define HRTIM_FLTINR1_FLT1P_Msk       (0x1U << HRTIM_FLTINR1_FLT1P_Pos)        /*!< 0x00000002 */
#define HRTIM_FLTINR1_FLT1P           HRTIM_FLTINR1_FLT1P_Msk                  /*!< Fault 1 polarity */
#define HRTIM_FLTINR1_FLT1SRC_Pos     (2U)                                     
#define HRTIM_FLTINR1_FLT1SRC_Msk     (0x1U << HRTIM_FLTINR1_FLT1SRC_Pos)      /*!< 0x00000004 */
#define HRTIM_FLTINR1_FLT1SRC         HRTIM_FLTINR1_FLT1SRC_Msk                /*!< Fault 1 source */
#define HRTIM_FLTINR1_FLT1F_Pos       (3U)                                     
#define HRTIM_FLTINR1_FLT1F_Msk       (0xFU << HRTIM_FLTINR1_FLT1F_Pos)        /*!< 0x00000078 */
#define HRTIM_FLTINR1_FLT1F           HRTIM_FLTINR1_FLT1F_Msk                  /*!< Fault 1 filter */
#define HRTIM_FLTINR1_FLT1F_0         (0x1U << HRTIM_FLTINR1_FLT1F_Pos)        /*!< 0x00000008 */
#define HRTIM_FLTINR1_FLT1F_1         (0x2U << HRTIM_FLTINR1_FLT1F_Pos)        /*!< 0x00000010 */
#define HRTIM_FLTINR1_FLT1F_2         (0x4U << HRTIM_FLTINR1_FLT1F_Pos)        /*!< 0x00000020 */
#define HRTIM_FLTINR1_FLT1F_3         (0x8U << HRTIM_FLTINR1_FLT1F_Pos)        /*!< 0x00000040 */
#define HRTIM_FLTINR1_FLT1LCK_Pos     (7U)                                     
#define HRTIM_FLTINR1_FLT1LCK_Msk     (0x1U << HRTIM_FLTINR1_FLT1LCK_Pos)      /*!< 0x00000080 */
#define HRTIM_FLTINR1_FLT1LCK         HRTIM_FLTINR1_FLT1LCK_Msk                /*!< Fault 1 lock */ 

#define HRTIM_FLTINR1_FLT2E_Pos       (8U)                                     
#define HRTIM_FLTINR1_FLT2E_Msk       (0x1U << HRTIM_FLTINR1_FLT2E_Pos)        /*!< 0x00000100 */
#define HRTIM_FLTINR1_FLT2E           HRTIM_FLTINR1_FLT2E_Msk                  /*!< Fault 2 enable */ 
#define HRTIM_FLTINR1_FLT2P_Pos       (9U)                                     
#define HRTIM_FLTINR1_FLT2P_Msk       (0x1U << HRTIM_FLTINR1_FLT2P_Pos)        /*!< 0x00000200 */
#define HRTIM_FLTINR1_FLT2P           HRTIM_FLTINR1_FLT2P_Msk                  /*!< Fault 2 polarity */
#define HRTIM_FLTINR1_FLT2SRC_Pos     (10U)                                    
#define HRTIM_FLTINR1_FLT2SRC_Msk     (0x1U << HRTIM_FLTINR1_FLT2SRC_Pos)      /*!< 0x00000400 */
#define HRTIM_FLTINR1_FLT2SRC         HRTIM_FLTINR1_FLT2SRC_Msk                /*!< Fault 2 source */
#define HRTIM_FLTINR1_FLT2F_Pos       (11U)                                    
#define HRTIM_FLTINR1_FLT2F_Msk       (0xFU << HRTIM_FLTINR1_FLT2F_Pos)        /*!< 0x00007800 */
#define HRTIM_FLTINR1_FLT2F           HRTIM_FLTINR1_FLT2F_Msk                  /*!< Fault 2 filter */
#define HRTIM_FLTINR1_FLT2F_0         (0x1U << HRTIM_FLTINR1_FLT2F_Pos)        /*!< 0x00000800 */
#define HRTIM_FLTINR1_FLT2F_1         (0x2U << HRTIM_FLTINR1_FLT2F_Pos)        /*!< 0x00001000 */
#define HRTIM_FLTINR1_FLT2F_2         (0x4U << HRTIM_FLTINR1_FLT2F_Pos)        /*!< 0x00002000 */
#define HRTIM_FLTINR1_FLT2F_3         (0x8U << HRTIM_FLTINR1_FLT2F_Pos)        /*!< 0x00004000 */
#define HRTIM_FLTINR1_FLT2LCK_Pos     (15U)                                    
#define HRTIM_FLTINR1_FLT2LCK_Msk     (0x1U << HRTIM_FLTINR1_FLT2LCK_Pos)      /*!< 0x00008000 */
#define HRTIM_FLTINR1_FLT2LCK         HRTIM_FLTINR1_FLT2LCK_Msk                /*!< Fault 2 lock */ 

