bkht/Nucleo-H743ZI_SDMMC/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h753xx__5.h
#define HRTIM_FLTINR1_FLT3E_Pos       (16U)                                    
#define HRTIM_FLTINR1_FLT3E_Msk       (0x1U << HRTIM_FLTINR1_FLT3E_Pos)        /*!< 0x00010000 */
#define HRTIM_FLTINR1_FLT3E           HRTIM_FLTINR1_FLT3E_Msk                  /*!< Fault 3 enable */ 
#define HRTIM_FLTINR1_FLT3P_Pos       (17U)                                    
#define HRTIM_FLTINR1_FLT3P_Msk       (0x1U << HRTIM_FLTINR1_FLT3P_Pos)        /*!< 0x00020000 */
#define HRTIM_FLTINR1_FLT3P           HRTIM_FLTINR1_FLT3P_Msk                  /*!< Fault 3 polarity */
#define HRTIM_FLTINR1_FLT3SRC_Pos     (18U)                                    
#define HRTIM_FLTINR1_FLT3SRC_Msk     (0x1U << HRTIM_FLTINR1_FLT3SRC_Pos)      /*!< 0x00040000 */
#define HRTIM_FLTINR1_FLT3SRC         HRTIM_FLTINR1_FLT3SRC_Msk                /*!< Fault 3 source */
#define HRTIM_FLTINR1_FLT3F_Pos       (19U)                                    
#define HRTIM_FLTINR1_FLT3F_Msk       (0xFU << HRTIM_FLTINR1_FLT3F_Pos)        /*!< 0x00780000 */
#define HRTIM_FLTINR1_FLT3F           HRTIM_FLTINR1_FLT3F_Msk                  /*!< Fault 3 filter */
#define HRTIM_FLTINR1_FLT3F_0         (0x1U << HRTIM_FLTINR1_FLT3F_Pos)        /*!< 0x00080000 */
#define HRTIM_FLTINR1_FLT3F_1         (0x2U << HRTIM_FLTINR1_FLT3F_Pos)        /*!< 0x00100000 */
#define HRTIM_FLTINR1_FLT3F_2         (0x4U << HRTIM_FLTINR1_FLT3F_Pos)        /*!< 0x00200000 */
#define HRTIM_FLTINR1_FLT3F_3         (0x8U << HRTIM_FLTINR1_FLT3F_Pos)        /*!< 0x00400000 */
#define HRTIM_FLTINR1_FLT3LCK_Pos     (23U)                                    
#define HRTIM_FLTINR1_FLT3LCK_Msk     (0x1U << HRTIM_FLTINR1_FLT3LCK_Pos)      /*!< 0x00800000 */
#define HRTIM_FLTINR1_FLT3LCK         HRTIM_FLTINR1_FLT3LCK_Msk                /*!< Fault 3 lock */ 

#define HRTIM_FLTINR1_FLT4E_Pos       (24U)                                    
#define HRTIM_FLTINR1_FLT4E_Msk       (0x1U << HRTIM_FLTINR1_FLT4E_Pos)        /*!< 0x01000000 */
#define HRTIM_FLTINR1_FLT4E           HRTIM_FLTINR1_FLT4E_Msk                  /*!< Fault 4 enable */ 
#define HRTIM_FLTINR1_FLT4P_Pos       (25U)                                    
#define HRTIM_FLTINR1_FLT4P_Msk       (0x1U << HRTIM_FLTINR1_FLT4P_Pos)        /*!< 0x02000000 */
#define HRTIM_FLTINR1_FLT4P           HRTIM_FLTINR1_FLT4P_Msk                  /*!< Fault 4 polarity */
#define HRTIM_FLTINR1_FLT4SRC_Pos     (26U)                                    
#define HRTIM_FLTINR1_FLT4SRC_Msk     (0x1U << HRTIM_FLTINR1_FLT4SRC_Pos)      /*!< 0x04000000 */
#define HRTIM_FLTINR1_FLT4SRC         HRTIM_FLTINR1_FLT4SRC_Msk                /*!< Fault 4 source */
#define HRTIM_FLTINR1_FLT4F_Pos       (27U)                                    
#define HRTIM_FLTINR1_FLT4F_Msk       (0xFU << HRTIM_FLTINR1_FLT4F_Pos)        /*!< 0x78000000 */
#define HRTIM_FLTINR1_FLT4F           HRTIM_FLTINR1_FLT4F_Msk                  /*!< Fault 4 filter */
#define HRTIM_FLTINR1_FLT4F_0         (0x1U << HRTIM_FLTINR1_FLT4F_Pos)        /*!< 0x08000000 */
#define HRTIM_FLTINR1_FLT4F_1         (0x2U << HRTIM_FLTINR1_FLT4F_Pos)        /*!< 0x10000000 */
#define HRTIM_FLTINR1_FLT4F_2         (0x4U << HRTIM_FLTINR1_FLT4F_Pos)        /*!< 0x20000000 */
#define HRTIM_FLTINR1_FLT4F_3         (0x8U << HRTIM_FLTINR1_FLT4F_Pos)        /*!< 0x40000000 */
#define HRTIM_FLTINR1_FLT4LCK_Pos     (31U)                                    
#define HRTIM_FLTINR1_FLT4LCK_Msk     (0x1U << HRTIM_FLTINR1_FLT4LCK_Pos)      /*!< 0x80000000 */
#define HRTIM_FLTINR1_FLT4LCK         HRTIM_FLTINR1_FLT4LCK_Msk                /*!< Fault 4 lock */

/*******************  Bit definition for HRTIM_FLTINR2 register  ***************/  
#define HRTIM_FLTINR2_FLT5E_Pos       (0U)                                     
#define HRTIM_FLTINR2_FLT5E_Msk       (0x1U << HRTIM_FLTINR2_FLT5E_Pos)        /*!< 0x00000001 */
#define HRTIM_FLTINR2_FLT5E           HRTIM_FLTINR2_FLT5E_Msk                  /*!< Fault 5 enable */ 
#define HRTIM_FLTINR2_FLT5P_Pos       (1U)                                     
#define HRTIM_FLTINR2_FLT5P_Msk       (0x1U << HRTIM_FLTINR2_FLT5P_Pos)        /*!< 0x00000002 */
#define HRTIM_FLTINR2_FLT5P           HRTIM_FLTINR2_FLT5P_Msk                  /*!< Fault 5 polarity */
#define HRTIM_FLTINR2_FLT5SRC_Pos     (2U)                                     
#define HRTIM_FLTINR2_FLT5SRC_Msk     (0x1U << HRTIM_FLTINR2_FLT5SRC_Pos)      /*!< 0x00000004 */
#define HRTIM_FLTINR2_FLT5SRC         HRTIM_FLTINR2_FLT5SRC_Msk                /*!< Fault 5 source */
#define HRTIM_FLTINR2_FLT5F_Pos       (3U)                                     
#define HRTIM_FLTINR2_FLT5F_Msk       (0xFU << HRTIM_FLTINR2_FLT5F_Pos)        /*!< 0x00000078 */
#define HRTIM_FLTINR2_FLT5F           HRTIM_FLTINR2_FLT5F_Msk                  /*!< Fault 5 filter */
#define HRTIM_FLTINR2_FLT5F_0         (0x1U << HRTIM_FLTINR2_FLT5F_Pos)        /*!< 0x00000008 */
#define HRTIM_FLTINR2_FLT5F_1         (0x2U << HRTIM_FLTINR2_FLT5F_Pos)        /*!< 0x00000010 */
#define HRTIM_FLTINR2_FLT5F_2         (0x4U << HRTIM_FLTINR2_FLT5F_Pos)        /*!< 0x00000020 */
#define HRTIM_FLTINR2_FLT5F_3         (0x8U << HRTIM_FLTINR2_FLT5F_Pos)        /*!< 0x00000040 */
#define HRTIM_FLTINR2_FLT5LCK_Pos     (7U)                                     
#define HRTIM_FLTINR2_FLT5LCK_Msk     (0x1U << HRTIM_FLTINR2_FLT5LCK_Pos)      /*!< 0x00000080 */
#define HRTIM_FLTINR2_FLT5LCK         HRTIM_FLTINR2_FLT5LCK_Msk                /*!< Fault 5 lock */
#define HRTIM_FLTINR2_FLTSD_Pos       (24U)                                    
#define HRTIM_FLTINR2_FLTSD_Msk       (0x3U << HRTIM_FLTINR2_FLTSD_Pos)        /*!< 0x03000000 */
#define HRTIM_FLTINR2_FLTSD           HRTIM_FLTINR2_FLTSD_Msk                  /*!< Fault sampling clock division */
#define HRTIM_FLTINR2_FLTSD_0         (0x1U << HRTIM_FLTINR2_FLTSD_Pos)        /*!< 0x01000000 */
#define HRTIM_FLTINR2_FLTSD_1         (0x2U << HRTIM_FLTINR2_FLTSD_Pos)        /*!< 0x02000000 */

/*******************  Bit definition for HRTIM_BDMUPR register  ***************/  
#define HRTIM_BDMUPR_MCR_Pos          (0U)                                     
#define HRTIM_BDMUPR_MCR_Msk          (0x1U << HRTIM_BDMUPR_MCR_Pos)           /*!< 0x00000001 */
#define HRTIM_BDMUPR_MCR              HRTIM_BDMUPR_MCR_Msk                     /*!< MCR register update enable */ 
#define HRTIM_BDMUPR_MICR_Pos         (1U)                                     
#define HRTIM_BDMUPR_MICR_Msk         (0x1U << HRTIM_BDMUPR_MICR_Pos)          /*!< 0x00000002 */
#define HRTIM_BDMUPR_MICR             HRTIM_BDMUPR_MICR_Msk                    /*!< MICR register update enable */ 
#define HRTIM_BDMUPR_MDIER_Pos        (2U)                                     
#define HRTIM_BDMUPR_MDIER_Msk        (0x1U << HRTIM_BDMUPR_MDIER_Pos)         /*!< 0x00000004 */
#define HRTIM_BDMUPR_MDIER            HRTIM_BDMUPR_MDIER_Msk                   /*!< MDIER register update enable */ 
#define HRTIM_BDMUPR_MCNT_Pos         (3U)                                     
#define HRTIM_BDMUPR_MCNT_Msk         (0x1U << HRTIM_BDMUPR_MCNT_Pos)          /*!< 0x00000008 */
#define HRTIM_BDMUPR_MCNT             HRTIM_BDMUPR_MCNT_Msk                    /*!< MCNT register update enable */ 
#define HRTIM_BDMUPR_MPER_Pos         (4U)                                     
#define HRTIM_BDMUPR_MPER_Msk         (0x1U << HRTIM_BDMUPR_MPER_Pos)          /*!< 0x00000010 */
#define HRTIM_BDMUPR_MPER             HRTIM_BDMUPR_MPER_Msk                    /*!< MPER register update enable */ 
#define HRTIM_BDMUPR_MREP_Pos         (5U)                                     
#define HRTIM_BDMUPR_MREP_Msk         (0x1U << HRTIM_BDMUPR_MREP_Pos)          /*!< 0x00000020 */
#define HRTIM_BDMUPR_MREP             HRTIM_BDMUPR_MREP_Msk                    /*!< MREP register update enable */ 
#define HRTIM_BDMUPR_MCMP1_Pos        (6U)                                     
#define HRTIM_BDMUPR_MCMP1_Msk        (0x1U << HRTIM_BDMUPR_MCMP1_Pos)         /*!< 0x00000040 */
#define HRTIM_BDMUPR_MCMP1            HRTIM_BDMUPR_MCMP1_Msk                   /*!< MCMP1 register update enable */ 
#define HRTIM_BDMUPR_MCMP2_Pos        (7U)                                     
#define HRTIM_BDMUPR_MCMP2_Msk        (0x1U << HRTIM_BDMUPR_MCMP2_Pos)         /*!< 0x00000080 */
#define HRTIM_BDMUPR_MCMP2            HRTIM_BDMUPR_MCMP2_Msk                   /*!< MCMP2 register update enable */ 
#define HRTIM_BDMUPR_MCMP3_Pos        (8U)                                     
#define HRTIM_BDMUPR_MCMP3_Msk        (0x1U << HRTIM_BDMUPR_MCMP3_Pos)         /*!< 0x00000100 */
#define HRTIM_BDMUPR_MCMP3            HRTIM_BDMUPR_MCMP3_Msk                   /*!< MCMP3 register update enable */ 
#define HRTIM_BDMUPR_MCMP4_Pos        (9U)                                     
#define HRTIM_BDMUPR_MCMP4_Msk        (0x1U << HRTIM_BDMUPR_MCMP4_Pos)         /*!< 0x00000200 */
#define HRTIM_BDMUPR_MCMP4            HRTIM_BDMUPR_MCMP4_Msk                   /*!< MPCMP4 register update enable */ 

/*******************  Bit definition for HRTIM_BDTUPR register  ***************/  
#define HRTIM_BDTUPR_TIMCR_Pos        (0U)                                     
#define HRTIM_BDTUPR_TIMCR_Msk        (0x1U << HRTIM_BDTUPR_TIMCR_Pos)         /*!< 0x00000001 */
#define HRTIM_BDTUPR_TIMCR            HRTIM_BDTUPR_TIMCR_Msk                   /*!<  TIMCR register update enable */ 
#define HRTIM_BDTUPR_TIMICR_Pos       (1U)                                     
#define HRTIM_BDTUPR_TIMICR_Msk       (0x1U << HRTIM_BDTUPR_TIMICR_Pos)        /*!< 0x00000002 */
#define HRTIM_BDTUPR_TIMICR           HRTIM_BDTUPR_TIMICR_Msk                  /*!<  TIMICR register update enable */ 
#define HRTIM_BDTUPR_TIMDIER_Pos      (2U)                                     
#define HRTIM_BDTUPR_TIMDIER_Msk      (0x1U << HRTIM_BDTUPR_TIMDIER_Pos)       /*!< 0x00000004 */
#define HRTIM_BDTUPR_TIMDIER          HRTIM_BDTUPR_TIMDIER_Msk                 /*!<  TIMDIER register update enable */ 
#define HRTIM_BDTUPR_TIMCNT_Pos       (3U)                                     
#define HRTIM_BDTUPR_TIMCNT_Msk       (0x1U << HRTIM_BDTUPR_TIMCNT_Pos)        /*!< 0x00000008 */
#define HRTIM_BDTUPR_TIMCNT           HRTIM_BDTUPR_TIMCNT_Msk                  /*!<  TIMCNT register update enable */ 
#define HRTIM_BDTUPR_TIMPER_Pos       (4U)                                     
#define HRTIM_BDTUPR_TIMPER_Msk       (0x1U << HRTIM_BDTUPR_TIMPER_Pos)        /*!< 0x00000010 */
#define HRTIM_BDTUPR_TIMPER           HRTIM_BDTUPR_TIMPER_Msk                  /*!<  TIMPER register update enable */ 
#define HRTIM_BDTUPR_TIMREP_Pos       (5U)                                     
#define HRTIM_BDTUPR_TIMREP_Msk       (0x1U << HRTIM_BDTUPR_TIMREP_Pos)        /*!< 0x00000020 */
#define HRTIM_BDTUPR_TIMREP           HRTIM_BDTUPR_TIMREP_Msk                  /*!<  TIMREP register update enable */ 
#define HRTIM_BDTUPR_TIMCMP1_Pos      (6U)                                     
#define HRTIM_BDTUPR_TIMCMP1_Msk      (0x1U << HRTIM_BDTUPR_TIMCMP1_Pos)       /*!< 0x00000040 */
#define HRTIM_BDTUPR_TIMCMP1          HRTIM_BDTUPR_TIMCMP1_Msk                 /*!<  TIMCMP1 register update enable */ 
#define HRTIM_BDTUPR_TIMCMP2_Pos      (7U)                                     
#define HRTIM_BDTUPR_TIMCMP2_Msk      (0x1U << HRTIM_BDTUPR_TIMCMP2_Pos)       /*!< 0x00000080 */
#define HRTIM_BDTUPR_TIMCMP2          HRTIM_BDTUPR_TIMCMP2_Msk                 /*!<  TIMCMP2 register update enable */ 
#define HRTIM_BDTUPR_TIMCMP3_Pos      (8U)                                     
#define HRTIM_BDTUPR_TIMCMP3_Msk      (0x1U << HRTIM_BDTUPR_TIMCMP3_Pos)       /*!< 0x00000100 */
#define HRTIM_BDTUPR_TIMCMP3          HRTIM_BDTUPR_TIMCMP3_Msk                 /*!<  TIMCMP3 register update enable */ 
#define HRTIM_BDTUPR_TIMCMP4_Pos      (9U)                                     
#define HRTIM_BDTUPR_TIMCMP4_Msk      (0x1U << HRTIM_BDTUPR_TIMCMP4_Pos)       /*!< 0x00000200 */
#define HRTIM_BDTUPR_TIMCMP4          HRTIM_BDTUPR_TIMCMP4_Msk                 /*!<  TIMCMP4 register update enable */ 
#define HRTIM_BDTUPR_TIMDTR_Pos       (10U)                                    
#define HRTIM_BDTUPR_TIMDTR_Msk       (0x1U << HRTIM_BDTUPR_TIMDTR_Pos)        /*!< 0x00000400 */
#define HRTIM_BDTUPR_TIMDTR           HRTIM_BDTUPR_TIMDTR_Msk                  /*!<  TIMDTR register update enable */ 
#define HRTIM_BDTUPR_TIMSET1R_Pos     (11U)                                    
#define HRTIM_BDTUPR_TIMSET1R_Msk     (0x1U << HRTIM_BDTUPR_TIMSET1R_Pos)      /*!< 0x00000800 */
#define HRTIM_BDTUPR_TIMSET1R         HRTIM_BDTUPR_TIMSET1R_Msk                /*!<  TIMSET1R register update enable */ 
#define HRTIM_BDTUPR_TIMRST1R_Pos     (12U)                                    
#define HRTIM_BDTUPR_TIMRST1R_Msk     (0x1U << HRTIM_BDTUPR_TIMRST1R_Pos)      /*!< 0x00001000 */
#define HRTIM_BDTUPR_TIMRST1R         HRTIM_BDTUPR_TIMRST1R_Msk                /*!<  TIMRST1R register update enable */ 
#define HRTIM_BDTUPR_TIMSET2R_Pos     (13U)                                    
#define HRTIM_BDTUPR_TIMSET2R_Msk     (0x1U << HRTIM_BDTUPR_TIMSET2R_Pos)      /*!< 0x00002000 */
#define HRTIM_BDTUPR_TIMSET2R         HRTIM_BDTUPR_TIMSET2R_Msk                /*!<  TIMSET2R register update enable */ 
#define HRTIM_BDTUPR_TIMRST2R_Pos     (14U)                                    
#define HRTIM_BDTUPR_TIMRST2R_Msk     (0x1U << HRTIM_BDTUPR_TIMRST2R_Pos)      /*!< 0x00004000 */
#define HRTIM_BDTUPR_TIMRST2R         HRTIM_BDTUPR_TIMRST2R_Msk                /*!<  TIMRST2R register update enable */ 
#define HRTIM_BDTUPR_TIMEEFR1_Pos     (15U)                                    
#define HRTIM_BDTUPR_TIMEEFR1_Msk     (0x1U << HRTIM_BDTUPR_TIMEEFR1_Pos)      /*!< 0x00008000 */
#define HRTIM_BDTUPR_TIMEEFR1         HRTIM_BDTUPR_TIMEEFR1_Msk                /*!<  TIMEEFR1 register update enable */ 
#define HRTIM_BDTUPR_TIMEEFR2_Pos     (16U)                                    
#define HRTIM_BDTUPR_TIMEEFR2_Msk     (0x1U << HRTIM_BDTUPR_TIMEEFR2_Pos)      /*!< 0x00010000 */
#define HRTIM_BDTUPR_TIMEEFR2         HRTIM_BDTUPR_TIMEEFR2_Msk                /*!<  TIMEEFR2 register update enable */ 
#define HRTIM_BDTUPR_TIMRSTR_Pos      (17U)                                    
#define HRTIM_BDTUPR_TIMRSTR_Msk      (0x1U << HRTIM_BDTUPR_TIMRSTR_Pos)       /*!< 0x00020000 */
#define HRTIM_BDTUPR_TIMRSTR          HRTIM_BDTUPR_TIMRSTR_Msk                 /*!<  TIMRSTR register update enable */ 
#define HRTIM_BDTUPR_TIMCHPR_Pos      (18U)                                    
#define HRTIM_BDTUPR_TIMCHPR_Msk      (0x1U << HRTIM_BDTUPR_TIMCHPR_Pos)       /*!< 0x00040000 */
#define HRTIM_BDTUPR_TIMCHPR          HRTIM_BDTUPR_TIMCHPR_Msk                 /*!<  TIMCHPR register update enable */ 
#define HRTIM_BDTUPR_TIMOUTR_Pos      (19U)                                    
#define HRTIM_BDTUPR_TIMOUTR_Msk      (0x1U << HRTIM_BDTUPR_TIMOUTR_Pos)       /*!< 0x00080000 */
#define HRTIM_BDTUPR_TIMOUTR          HRTIM_BDTUPR_TIMOUTR_Msk                 /*!<  TIMOUTR register update enable */ 
#define HRTIM_BDTUPR_TIMFLTR_Pos      (20U)                                    
#define HRTIM_BDTUPR_TIMFLTR_Msk      (0x1U << HRTIM_BDTUPR_TIMFLTR_Pos)       /*!< 0x00100000 */
#define HRTIM_BDTUPR_TIMFLTR          HRTIM_BDTUPR_TIMFLTR_Msk                 /*!<  TIMFLTR register update enable */ 

/*******************  Bit definition for HRTIM_BDMADR register  ***************/  
#define HRTIM_BDMADR_BDMADR_Pos       (0U)                                     
#define HRTIM_BDMADR_BDMADR_Msk       (0xFFFFFFFFU << HRTIM_BDMADR_BDMADR_Pos) /*!< 0xFFFFFFFF */
#define HRTIM_BDMADR_BDMADR           HRTIM_BDMADR_BDMADR_Msk                  /*!<  Burst DMA Data register */

/******************************************************************************/
/*                                                                            */
/*                                MDIOS                                        */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MDIOS_CR register  *******************/
#define MDIOS_CR_EN_Pos                (0U)                                    
#define MDIOS_CR_EN_Msk                (0x1U << MDIOS_CR_EN_Pos)               /*!< 0x00000001 */
#define MDIOS_CR_EN                    MDIOS_CR_EN_Msk                         /*!<  MDIOS slave peripheral enable */
#define MDIOS_CR_WRIE_Pos              (1U)                                    
#define MDIOS_CR_WRIE_Msk              (0x1U << MDIOS_CR_WRIE_Pos)             /*!< 0x00000002 */
#define MDIOS_CR_WRIE                  MDIOS_CR_WRIE_Msk                       /*!<  MDIOS slave register write interrupt enable. */ 
#define MDIOS_CR_RDIE_Pos              (2U)                                    
#define MDIOS_CR_RDIE_Msk              (0x1U << MDIOS_CR_RDIE_Pos)             /*!< 0x00000004 */
#define MDIOS_CR_RDIE                  MDIOS_CR_RDIE_Msk                       /*!<  MDIOS slave register read interrupt enable. */
#define MDIOS_CR_EIE_Pos               (3U)                                    
#define MDIOS_CR_EIE_Msk               (0x1U << MDIOS_CR_EIE_Pos)              /*!< 0x00000008 */
#define MDIOS_CR_EIE                   MDIOS_CR_EIE_Msk                        /*!<  MDIOS slave register error interrupt enable. */
#define MDIOS_CR_DPC_Pos               (7U)                                    
#define MDIOS_CR_DPC_Msk               (0x1U << MDIOS_CR_DPC_Pos)              /*!< 0x00000080 */
#define MDIOS_CR_DPC                   MDIOS_CR_DPC_Msk                        /*!<  MDIOS slave disable preamble check. */
#define MDIOS_CR_PORT_ADDRESS_Pos      (8U)                                    
#define MDIOS_CR_PORT_ADDRESS_Msk      (0x1FU << MDIOS_CR_PORT_ADDRESS_Pos)    /*!< 0x00001F00 */
#define MDIOS_CR_PORT_ADDRESS          MDIOS_CR_PORT_ADDRESS_Msk               /*!<  MDIOS slave port address mask. */
#define MDIOS_CR_PORT_ADDRESS_0        (0x01U << MDIOS_CR_PORT_ADDRESS_Pos)    /*!< 0x00000100 */
#define MDIOS_CR_PORT_ADDRESS_1        (0x02U << MDIOS_CR_PORT_ADDRESS_Pos)    /*!< 0x00000200 */
#define MDIOS_CR_PORT_ADDRESS_2        (0x04U << MDIOS_CR_PORT_ADDRESS_Pos)    /*!< 0x00000400 */
#define MDIOS_CR_PORT_ADDRESS_3        (0x08U << MDIOS_CR_PORT_ADDRESS_Pos)    /*!< 0x00000800 */
#define MDIOS_CR_PORT_ADDRESS_4        (0x10U << MDIOS_CR_PORT_ADDRESS_Pos)    /*!< 0x00001000 */

/********************  Bit definition for MDIOS_SR register  *******************/
#define MDIOS_SR_PERF_Pos              (0U)                                    
#define MDIOS_SR_PERF_Msk              (0x1U << MDIOS_SR_PERF_Pos)             /*!< 0x00000001 */
#define MDIOS_SR_PERF                  MDIOS_SR_PERF_Msk                       /*!<  MDIOS slave turnaround error flag*/
#define MDIOS_SR_SERF_Pos              (1U)                                    
#define MDIOS_SR_SERF_Msk              (0x1U << MDIOS_SR_SERF_Pos)             /*!< 0x00000002 */
#define MDIOS_SR_SERF                  MDIOS_SR_SERF_Msk                       /*!<  MDIOS slave start error flag */
#define MDIOS_SR_TERF_Pos              (2U)                                    
#define MDIOS_SR_TERF_Msk              (0x1U << MDIOS_SR_TERF_Pos)             /*!< 0x00000004 */
#define MDIOS_SR_TERF                  MDIOS_SR_TERF_Msk                       /*!<  MDIOS slave preamble error flag */

/********************  Bit definition for MDIOS_CLRFR register  *******************/
#define MDIOS_SR_CPERF_Pos             (0U)                                    
#define MDIOS_SR_CPERF_Msk             (0x1U << MDIOS_SR_CPERF_Pos)            /*!< 0x00000001 */
#define MDIOS_SR_CPERF                 MDIOS_SR_CPERF_Msk                      /*!<  MDIOS slave Clear the turnaround error flag */
#define MDIOS_SR_CSERF_Pos             (1U)                                    
#define MDIOS_SR_CSERF_Msk             (0x1U << MDIOS_SR_CSERF_Pos)            /*!< 0x00000002 */
#define MDIOS_SR_CSERF                 MDIOS_SR_CSERF_Msk                      /*!<  MDIOS slave Clear the start error flag */
#define MDIOS_SR_CTERF_Pos             (2U)                                    
#define MDIOS_SR_CTERF_Msk             (0x1U << MDIOS_SR_CTERF_Pos)            /*!< 0x00000004 */
#define MDIOS_SR_CTERF                 MDIOS_SR_CTERF_Msk                      /*!<  MDIOS slave Clear the preamble error flag */

